sol4ik/audio-steganography/try/fm4/s6e2cc_i2s_sk-fm4-176l-s6se2cc-v10/svd/S6E2CC.xml
      </registers>
    </peripheral>
    <!-- PERIPHERAL "DUALFLASH_IF" -->
    <peripheral>
      <name>DUALFLASH_IF</name>
      <description> peripheral DUALFLASH_IF </description>
      <groupName>DUALFLASH_IF</groupName>
      <baseAddress>0x40000400</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "DFASZR" -->
        <register>
          <name>DFASZR</name>
          <description> register DFASZR </description>
          <addressOffset>0x00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000002</resetValue>
          <resetMask>0x00000003</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ASZ" -->
            <field>
              <name>ASZ</name>
              <description> bitfield ASZ </description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "DFRWTR" -->
        <register>
          <name>DFRWTR</name>
          <description> register DFRWTR </description>
          <addressOffset>0x04</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000003</resetValue>
          <resetMask>0x00000003</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RWT" -->
            <field>
              <name>RWT</name>
              <description> bitfield RWT </description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "DFSTR" -->
        <register>
          <name>DFSTR</name>
          <description> register DFSTR </description>
          <addressOffset>0x08</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DFERR" -->
            <field>
              <name>DFERR</name>
              <description> bitfield DFERR </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DFHNG" -->
            <field>
              <name>DFHNG</name>
              <description> bitfield DFHNG </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "DFRDY" -->
            <field>
              <name>DFRDY</name>
              <description> bitfield DFRDY </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "UNIQUE_ID" -->
    <peripheral>
      <name>UNIQUE_ID</name>
      <description> peripheral UNIQUE_ID </description>
      <groupName>UNIQUE_ID</groupName>
      <baseAddress>0x40000200</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "UIDR0" -->
        <register>
          <name>UIDR0</name>
          <description> register UIDR0 </description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFF0</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "UID" -->
            <field>
              <name>UID</name>
              <description> bitfield UID </description>
              <lsb>4</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "UIDR1" -->
        <register>
          <name>UIDR1</name>
          <description> register UIDR1 </description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00001FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "UID" -->
            <field>
              <name>UID</name>
              <description> bitfield UID </description>
              <lsb>0</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "ECC_CAPTURE" -->
    <peripheral>
      <name>ECC_CAPTURE</name>
      <description> peripheral ECC_CAPTURE </description>
      <groupName>ECC_CAPTURE</groupName>
      <baseAddress>0x40000300</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "FERRAD" -->
        <register>
          <name>FERRAD</name>
          <description> register FERRAD </description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x007FFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ERRAD" -->
            <field>
              <name>ERRAD</name>
              <description> bitfield ERRAD </description>
              <lsb>0</lsb>
              <msb>22</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
