sol4ik/audio-steganography/try/fm4/s6e2cc_i2s_sk-fm4-176l-s6se2cc-v10/svd/S6E2CC.xml
        <!-- REGISTER "WFG_WFSA54" -->
        <register derivedFrom="WFG_WFSA10">
          <name>WFG_WFSA54</name>
          <description> register WFG_WFSA54 </description>
          <addressOffset>0x1AC</addressOffset>
        </register>
        <!-- REGISTER "WFG_WFIR" -->
        <register>
          <name>WFG_WFIR</name>
          <description> register WFG_WFIR </description>
          <addressOffset>0x1B0</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TMIS54" -->
            <field>
              <name>TMIS54</name>
              <description> bitfield TMIS54 </description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "TMIE54" -->
            <field>
              <name>TMIE54</name>
              <description> bitfield TMIE54 </description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TMIC54" -->
            <field>
              <name>TMIC54</name>
              <description> bitfield TMIC54 </description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "TMIF54" -->
            <field>
              <name>TMIF54</name>
              <description> bitfield TMIF54 </description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TMIS32" -->
            <field>
              <name>TMIS32</name>
              <description> bitfield TMIS32 </description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "TMIE32" -->
            <field>
              <name>TMIE32</name>
              <description> bitfield TMIE32 </description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TMIC32" -->
            <field>
              <name>TMIC32</name>
              <description> bitfield TMIC32 </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "TMIF32" -->
            <field>
              <name>TMIF32</name>
              <description> bitfield TMIF32 </description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TMIS10" -->
            <field>
              <name>TMIS10</name>
              <description> bitfield TMIS10 </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "TMIE10" -->
            <field>
              <name>TMIE10</name>
              <description> bitfield TMIE10 </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TMIC10" -->
            <field>
              <name>TMIC10</name>
              <description> bitfield TMIC10 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "TMIF10" -->
            <field>
              <name>TMIF10</name>
              <description> bitfield TMIF10 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "DTICB" -->
            <field>
              <name>DTICB</name>
              <description> bitfield DTICB </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "DTIFB" -->
            <field>
              <name>DTIFB</name>
              <description> bitfield DTIFB </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "DTICA" -->
            <field>
              <name>DTICA</name>
              <description> bitfield DTICA </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "DTIFA" -->
            <field>
              <name>DTIFA</name>
              <description> bitfield DTIFA </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WFG_NZCL" -->
        <register>
          <name>WFG_NZCL</name>
          <description> register WFG_NZCL </description>
          <addressOffset>0x1B4</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x733F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WIM54" -->
            <field>
              <name>WIM54</name>
              <description> bitfield WIM54 </description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WIM32" -->
            <field>
              <name>WIM32</name>
              <description> bitfield WIM32 </description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WIM10" -->
            <field>
              <name>WIM10</name>
              <description> bitfield WIM10 </description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DIMB" -->
            <field>
              <name>DIMB</name>
              <description> bitfield DIMB </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DIMA" -->
            <field>
              <name>DIMA</name>
              <description> bitfield DIMA </description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DTIEB" -->
            <field>
              <name>DTIEB</name>
              <description> bitfield DTIEB </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SDTI" -->
            <field>
              <name>SDTI</name>
              <description> bitfield SDTI </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "NWS" -->
            <field>
              <name>NWS</name>
              <description> bitfield NWS </description>
              <lsb>1</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DTIEA" -->
            <field>
              <name>DTIEA</name>
              <description> bitfield DTIEA </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ICU_ICFS10" -->
        <register>
          <name>ICU_ICFS10</name>
          <description> register ICU_ICFS10 </description>
          <addressOffset>0x16C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FSI1" -->
            <field>
              <name>FSI1</name>
              <description> bitfield FSI1 </description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FSI0" -->
            <field>
              <name>FSI0</name>
              <description> bitfield FSI0 </description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
