sol4ik/audio-steganography/try/fm4/s6e2cc_i2s_sk-fm4-176l-s6se2cc-v10/svd/S6E2CC.xml
    <!-- PERIPHERAL "BT5" -->
    <peripheral derivedFrom="BT0">
      <name>BT5</name>
      <baseAddress>0x40025240</baseAddress>
      <!-- INTERRUPT "BT5" -->
      <interrupt>
        <name>BT5</name>
        <value>44</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "BT6" -->
    <peripheral derivedFrom="BT0">
      <name>BT6</name>
      <baseAddress>0x40025280</baseAddress>
      <!-- INTERRUPT "BT6" -->
      <interrupt>
        <name>BT6</name>
        <value>45</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "BT7" -->
    <peripheral derivedFrom="BT0">
      <name>BT7</name>
      <baseAddress>0x400252C0</baseAddress>
      <!-- INTERRUPT "BT7" -->
      <interrupt>
        <name>BT7</name>
        <value>46</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "BT8" -->
    <peripheral derivedFrom="BT0">
      <name>BT8</name>
      <baseAddress>0x40025400</baseAddress>
      <!-- INTERRUPT "BT8" -->
      <interrupt>
        <name>BT8</name>
        <value>98</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "BT9" -->
    <peripheral derivedFrom="BT0">
      <name>BT9</name>
      <baseAddress>0x40025440</baseAddress>
      <!-- INTERRUPT "BT9" -->
      <interrupt>
        <name>BT9</name>
        <value>99</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "BT10" -->
    <peripheral derivedFrom="BT0">
      <name>BT10</name>
      <baseAddress>0x40025480</baseAddress>
      <!-- INTERRUPT "BT10" -->
      <interrupt>
        <name>BT10</name>
        <value>100</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "BT11" -->
    <peripheral derivedFrom="BT0">
      <name>BT11</name>
      <baseAddress>0x400254C0</baseAddress>
      <!-- INTERRUPT "BT11" -->
      <interrupt>
        <name>BT11</name>
        <value>101</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "BT12" -->
    <peripheral derivedFrom="BT0">
      <name>BT12</name>
      <baseAddress>0x40025600</baseAddress>
      <!-- INTERRUPT "BT12_13_14_15" -->
      <interrupt>
        <name>BT12_13_14_15</name>
        <value>102</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "BT13" -->
    <peripheral derivedFrom="BT0">
      <name>BT13</name>
      <baseAddress>0x40025640</baseAddress>
    </peripheral>
    <!-- PERIPHERAL "BT14" -->
    <peripheral derivedFrom="BT0">
      <name>BT14</name>
      <baseAddress>0x40025680</baseAddress>
    </peripheral>
    <!-- PERIPHERAL "BT15" -->
    <peripheral derivedFrom="BT0">
      <name>BT15</name>
      <baseAddress>0x400256C0</baseAddress>
    </peripheral>
    <!-- PERIPHERAL "QPRC0" -->
    <peripheral>
      <name>QPRC0</name>
      <description> peripheral QPRC0 </description>
      <groupName>QPRC0</groupName>
      <baseAddress>0x40026000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xC</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x14</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x18</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1C</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x3C</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x3E</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- INTERRUPT "QPRC0" -->
      <interrupt>
        <name>QPRC0</name>
        <value>19</value>
      </interrupt>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "QPCR" -->
        <register>
          <name>QPCR</name>
          <description> register QPCR </description>
          <addressOffset>0x00</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <!-- REGISTER "QRCR" -->
        <register>
          <name>QRCR</name>
          <description> register QRCR </description>
          <addressOffset>0x04</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <!-- REGISTER "QPCCR" -->
        <register>
          <name>QPCCR</name>
          <description> register QPCCR </description>
          <addressOffset>0x08</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <!-- REGISTER "QPRCR" -->
        <register>
          <name>QPRCR</name>
          <description> register QPRCR </description>
          <addressOffset>0x0C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <!-- REGISTER "QMPR" -->
        <register>
          <name>QMPR</name>
          <description> register QMPR </description>
          <addressOffset>0x10</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0xFFFF</resetValue>
          <resetMask>0xFFFF</resetMask>
        </register>
        <!-- REGISTER "QICRL" -->
        <register>
          <name>QICRL</name>
          <description> register QICRL </description>
          <addressOffset>0x14</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ZIIF" -->
            <field>
              <name>ZIIF</name>
              <description> bitfield ZIIF </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "OFDF" -->
            <field>
              <name>OFDF</name>
              <description> bitfield OFDF </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UFDF" -->
            <field>
              <name>UFDF</name>
              <description> bitfield UFDF </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "OUZIE" -->
            <field>
              <name>OUZIE</name>
              <description> bitfield OUZIE </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "QPRCMF" -->
            <field>
              <name>QPRCMF</name>
              <description> bitfield QPRCMF </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "QPRCMIE" -->
            <field>
              <name>QPRCMIE</name>
              <description> bitfield QPRCMIE </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "QPCMF" -->
            <field>
              <name>QPCMF</name>
              <description> bitfield QPCMF </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "QPCMIE" -->
            <field>
              <name>QPCMIE</name>
              <description> bitfield QPCMIE </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "QICRH" -->
        <register>
          <name>QICRH</name>
          <description> register QICRH </description>
          <addressOffset>0x15</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "QPCNRCMF" -->
            <field>
              <name>QPCNRCMF</name>
              <description> bitfield QPCNRCMF </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "QPCNRCMIE" -->
            <field>
              <name>QPCNRCMIE</name>
              <description> bitfield QPCNRCMIE </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DIROU" -->
            <field>
              <name>DIROU</name>
              <description> bitfield DIROU </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "DIRPC" -->
            <field>
              <name>DIRPC</name>
              <description> bitfield DIRPC </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CDCF" -->
            <field>
              <name>CDCF</name>
              <description> bitfield CDCF </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CDCIE" -->
            <field>
              <name>CDCIE</name>
              <description> bitfield CDCIE </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "QCR" -->
        <register>
          <name>QCR</name>
          <description> register QCR </description>
          <addressOffset>0x18</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CGE" -->
            <field>
              <name>CGE</name>
              <description> bitfield CGE </description>
              <lsb>14</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BES" -->
            <field>
              <name>BES</name>
              <description> bitfield BES </description>
              <lsb>12</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AES" -->
            <field>
              <name>AES</name>
              <description> bitfield AES </description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PCRM" -->
            <field>
              <name>PCRM</name>
              <description> bitfield PCRM </description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SWAP" -->
            <field>
              <name>SWAP</name>
              <description> bitfield SWAP </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RSEL" -->
            <field>
              <name>RSEL</name>
              <description> bitfield RSEL </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CGSC" -->
            <field>
              <name>CGSC</name>
              <description> bitfield CGSC </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PSTP" -->
            <field>
              <name>PSTP</name>
              <description> bitfield PSTP </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RCM" -->
            <field>
              <name>RCM</name>
              <description> bitfield RCM </description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PCM" -->
            <field>
              <name>PCM</name>
              <description> bitfield PCM </description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "QECR" -->
        <register>
          <name>QECR</name>
          <description> register QECR </description>
          <addressOffset>0x1C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x000F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PEC" -->
            <field>
              <name>PEC</name>
              <description> bitfield PEC </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ORNGIE" -->
            <field>
              <name>ORNGIE</name>
              <description> bitfield ORNGIE </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ORNGF" -->
            <field>
              <name>ORNGF</name>
              <description> bitfield ORNGF </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ORNGMD" -->
            <field>
              <name>ORNGMD</name>
              <description> bitfield ORNGMD </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "QPRCRR" -->
        <register>
          <name>QPRCRR</name>
          <description> register QPRCRR </description>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "QRCRR" -->
            <field>
              <name>QRCRR</name>
              <description> bitfield QRCRR </description>
              <lsb>16</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QPCRR" -->
            <field>
              <name>QPCRR</name>
              <description> bitfield QPCRR </description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
