sol4ik/audio-steganography/try/fm4/s6e2cc_i2s_sk-fm4-176l-s6se2cc-v10/svd/S6E2CC.xml
        <!-- REGISTER "IRQ003MON" -->
        <register>
          <name>IRQ003MON</name>
          <description> register IRQ003MON </description>
          <addressOffset>0x210</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "IRQBIT7" -->
            <field>
              <name>IRQBIT7</name>
              <description> bitfield IRQBIT7 </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT6" -->
            <field>
              <name>IRQBIT6</name>
              <description> bitfield IRQBIT6 </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT5" -->
            <field>
              <name>IRQBIT5</name>
              <description> bitfield IRQBIT5 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT4" -->
            <field>
              <name>IRQBIT4</name>
              <description> bitfield IRQBIT4 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT3" -->
            <field>
              <name>IRQBIT3</name>
              <description> bitfield IRQBIT3 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT2" -->
            <field>
              <name>IRQBIT2</name>
              <description> bitfield IRQBIT2 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT1" -->
            <field>
              <name>IRQBIT1</name>
              <description> bitfield IRQBIT1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT0" -->
            <field>
              <name>IRQBIT0</name>
              <description> bitfield IRQBIT0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ004MON" -->
        <register>
          <name>IRQ004MON</name>
          <description> register IRQ004MON </description>
          <addressOffset>0x214</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "IRQBIT7" -->
            <field>
              <name>IRQBIT7</name>
              <description> bitfield IRQBIT7 </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT6" -->
            <field>
              <name>IRQBIT6</name>
              <description> bitfield IRQBIT6 </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT5" -->
            <field>
              <name>IRQBIT5</name>
              <description> bitfield IRQBIT5 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT4" -->
            <field>
              <name>IRQBIT4</name>
              <description> bitfield IRQBIT4 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT3" -->
            <field>
              <name>IRQBIT3</name>
              <description> bitfield IRQBIT3 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT2" -->
            <field>
              <name>IRQBIT2</name>
              <description> bitfield IRQBIT2 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT1" -->
            <field>
              <name>IRQBIT1</name>
              <description> bitfield IRQBIT1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT0" -->
            <field>
              <name>IRQBIT0</name>
              <description> bitfield IRQBIT0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ005MON" -->
        <register>
          <name>IRQ005MON</name>
          <description> register IRQ005MON </description>
          <addressOffset>0x218</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "IRQBIT7" -->
            <field>
              <name>IRQBIT7</name>
              <description> bitfield IRQBIT7 </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT6" -->
            <field>
              <name>IRQBIT6</name>
              <description> bitfield IRQBIT6 </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT5" -->
            <field>
              <name>IRQBIT5</name>
              <description> bitfield IRQBIT5 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT4" -->
            <field>
              <name>IRQBIT4</name>
              <description> bitfield IRQBIT4 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT3" -->
            <field>
              <name>IRQBIT3</name>
              <description> bitfield IRQBIT3 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT2" -->
            <field>
              <name>IRQBIT2</name>
              <description> bitfield IRQBIT2 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT1" -->
            <field>
              <name>IRQBIT1</name>
              <description> bitfield IRQBIT1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT0" -->
            <field>
              <name>IRQBIT0</name>
              <description> bitfield IRQBIT0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ006MON" -->
        <register>
          <name>IRQ006MON</name>
          <description> register IRQ006MON </description>
          <addressOffset>0x21C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "IRQBIT7" -->
            <field>
              <name>IRQBIT7</name>
              <description> bitfield IRQBIT7 </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT6" -->
            <field>
              <name>IRQBIT6</name>
              <description> bitfield IRQBIT6 </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT5" -->
            <field>
              <name>IRQBIT5</name>
              <description> bitfield IRQBIT5 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT4" -->
            <field>
              <name>IRQBIT4</name>
              <description> bitfield IRQBIT4 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT3" -->
            <field>
              <name>IRQBIT3</name>
              <description> bitfield IRQBIT3 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT2" -->
            <field>
              <name>IRQBIT2</name>
              <description> bitfield IRQBIT2 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT1" -->
            <field>
              <name>IRQBIT1</name>
              <description> bitfield IRQBIT1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "IRQBIT0" -->
            <field>
              <name>IRQBIT0</name>
              <description> bitfield IRQBIT0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
