sol4ik/audio-steganography/try/fm4/s6e2cc_i2s_sk-fm4-176l-s6se2cc-v10/svd/S6E2CC.xml
        <!-- REGISTER "IRQ028MON" -->
        <register>
          <name>IRQ028MON</name>
          <description> register IRQ028MON </description>
          <addressOffset>0x274</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x07</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FRT_PEAK_INT2" -->
            <field>
              <name>FRT_PEAK_INT2</name>
              <description> bitfield FRT_PEAK_INT2 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "FRT_PEAK_INT1" -->
            <field>
              <name>FRT_PEAK_INT1</name>
              <description> bitfield FRT_PEAK_INT1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "FRT_PEAK_INT0" -->
            <field>
              <name>FRT_PEAK_INT0</name>
              <description> bitfield FRT_PEAK_INT0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ029MON" -->
        <register>
          <name>IRQ029MON</name>
          <description> register IRQ029MON </description>
          <addressOffset>0x278</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x07</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FRT_ZERO_INT2" -->
            <field>
              <name>FRT_ZERO_INT2</name>
              <description> bitfield FRT_ZERO_INT2 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "FRT_ZERO_INT1" -->
            <field>
              <name>FRT_ZERO_INT1</name>
              <description> bitfield FRT_ZERO_INT1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "FRT_ZERO_INT0" -->
            <field>
              <name>FRT_ZERO_INT0</name>
              <description> bitfield FRT_ZERO_INT0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ030MON" -->
        <register>
          <name>IRQ030MON</name>
          <description> register IRQ030MON </description>
          <addressOffset>0x27C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ICUINT3" -->
            <field>
              <name>ICUINT3</name>
              <description> bitfield ICUINT3 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ICUINT2" -->
            <field>
              <name>ICUINT2</name>
              <description> bitfield ICUINT2 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ICUINT1" -->
            <field>
              <name>ICUINT1</name>
              <description> bitfield ICUINT1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ICUINT0" -->
            <field>
              <name>ICUINT0</name>
              <description> bitfield ICUINT0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ031MON" -->
        <register>
          <name>IRQ031MON</name>
          <description> register IRQ031MON </description>
          <addressOffset>0x280</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "OCUINT5" -->
            <field>
              <name>OCUINT5</name>
              <description> bitfield OCUINT5 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "OCUINT4" -->
            <field>
              <name>OCUINT4</name>
              <description> bitfield OCUINT4 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "OCUINT3" -->
            <field>
              <name>OCUINT3</name>
              <description> bitfield OCUINT3 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "OCUINT2" -->
            <field>
              <name>OCUINT2</name>
              <description> bitfield OCUINT2 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "OCUINT1" -->
            <field>
              <name>OCUINT1</name>
              <description> bitfield OCUINT1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "OCUINT0" -->
            <field>
              <name>OCUINT0</name>
              <description> bitfield OCUINT0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
