sol4ik/audio-steganography/try/fm4/s6e2cc_i2s_sk-fm4-176l-s6se2cc-v10/svd/S6E2CC.xml
        <!-- REGISTER "IRQ107MON" -->
        <register>
          <name>IRQ107MON</name>
          <description> register IRQ107MON </description>
          <addressOffset>0x3B0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSRINT" -->
            <field>
              <name>MFSRINT</name>
              <description> bitfield MFSRINT </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ108MON" -->
        <register>
          <name>IRQ108MON</name>
          <description> register IRQ108MON </description>
          <addressOffset>0x3B4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT1" -->
            <field>
              <name>MFSINT1</name>
              <description> bitfield MFSINT1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MFSINT0" -->
            <field>
              <name>MFSINT0</name>
              <description> bitfield MFSINT0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ109MON" -->
        <register>
          <name>IRQ109MON</name>
          <description> register IRQ109MON </description>
          <addressOffset>0x3B8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSRINT" -->
            <field>
              <name>MFSRINT</name>
              <description> bitfield MFSRINT </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ110MON" -->
        <register>
          <name>IRQ110MON</name>
          <description> register IRQ110MON </description>
          <addressOffset>0x3BC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MFSINT1" -->
            <field>
              <name>MFSINT1</name>
              <description> bitfield MFSINT1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MFSINT0" -->
            <field>
              <name>MFSINT0</name>
              <description> bitfield MFSINT0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ111MON" -->
        <register>
          <name>IRQ111MON</name>
          <description> register IRQ111MON </description>
          <addressOffset>0x3C0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x1F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ADCINT4" -->
            <field>
              <name>ADCINT4</name>
              <description> bitfield ADCINT4 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ADCINT3" -->
            <field>
              <name>ADCINT3</name>
              <description> bitfield ADCINT3 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ADCINT2" -->
            <field>
              <name>ADCINT2</name>
              <description> bitfield ADCINT2 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ADCINT1" -->
            <field>
              <name>ADCINT1</name>
              <description> bitfield ADCINT1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ADCINT0" -->
            <field>
              <name>ADCINT0</name>
              <description> bitfield ADCINT0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ112MON" -->
        <register>
          <name>IRQ112MON</name>
          <description> register IRQ112MON </description>
          <addressOffset>0x3C4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CANDINT" -->
            <field>
              <name>CANDINT</name>
              <description> bitfield CANDINT </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "PCRCDINT" -->
            <field>
              <name>PCRCDINT</name>
              <description> bitfield PCRCDINT </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QSPIDINT1" -->
            <field>
              <name>QSPIDINT1</name>
              <description> bitfield QSPIDINT1 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "QSPIDINT0" -->
            <field>
              <name>QSPIDINT0</name>
              <description> bitfield QSPIDINT0 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "I2SDINT1" -->
            <field>
              <name>I2SDINT1</name>
              <description> bitfield I2SDINT1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "I2SDINT0" -->
            <field>
              <name>I2SDINT0</name>
              <description> bitfield I2SDINT0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ113MON" -->
        <register>
          <name>IRQ113MON</name>
          <description> register IRQ113MON </description>
          <addressOffset>0x3C8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RCEC0INT" -->
            <field>
              <name>RCEC0INT</name>
              <description> bitfield RCEC0INT </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "USB_DRQ_INT4" -->
            <field>
              <name>USB_DRQ_INT4</name>
              <description> bitfield USB_DRQ_INT4 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "USB_DRQ_INT3" -->
            <field>
              <name>USB_DRQ_INT3</name>
              <description> bitfield USB_DRQ_INT3 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "USB_DRQ_INT2" -->
            <field>
              <name>USB_DRQ_INT2</name>
              <description> bitfield USB_DRQ_INT2 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "USB_DRQ_INT1" -->
            <field>
              <name>USB_DRQ_INT1</name>
              <description> bitfield USB_DRQ_INT1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "USB_DRQ_INT0" -->
            <field>
              <name>USB_DRQ_INT0</name>
              <description> bitfield USB_DRQ_INT0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IRQ114MON" -->
        <register>
          <name>IRQ114MON</name>
          <description> register IRQ114MON </description>
          <addressOffset>0x3CC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x7F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RCEC1INT" -->
            <field>
              <name>RCEC1INT</name>
              <description> bitfield RCEC1INT </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "USB_INT5" -->
            <field>
              <name>USB_INT5</name>
              <description> bitfield USB_INT5 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "USB_INT4" -->
            <field>
              <name>USB_INT4</name>
              <description> bitfield USB_INT4 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "USB_INT3" -->
            <field>
              <name>USB_INT3</name>
              <description> bitfield USB_INT3 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "USB_INT2" -->
            <field>
              <name>USB_INT2</name>
              <description> bitfield USB_INT2 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "USB_INT1" -->
            <field>
              <name>USB_INT1</name>
              <description> bitfield USB_INT1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "USB_INT0" -->
            <field>
              <name>USB_INT0</name>
              <description> bitfield USB_INT0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
