sol4ik/audio-steganography/try/fm4/s6e2cc_i2s_sk-fm4-176l-s6se2cc-v10/svd/S6E2CC.xml
        <!-- REGISTER "PFR7" -->
        <register>
          <name>PFR7</name>
          <description> register PFR7 </description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x00007FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P7E" -->
            <field>
              <name>P7E</name>
              <description> bitfield P7E </description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P7D" -->
            <field>
              <name>P7D</name>
              <description> bitfield P7D </description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P7C" -->
            <field>
              <name>P7C</name>
              <description> bitfield P7C </description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P7B" -->
            <field>
              <name>P7B</name>
              <description> bitfield P7B </description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P7A" -->
            <field>
              <name>P7A</name>
              <description> bitfield P7A </description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P79" -->
            <field>
              <name>P79</name>
              <description> bitfield P79 </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P78" -->
            <field>
              <name>P78</name>
              <description> bitfield P78 </description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P77" -->
            <field>
              <name>P77</name>
              <description> bitfield P77 </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P76" -->
            <field>
              <name>P76</name>
              <description> bitfield P76 </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P75" -->
            <field>
              <name>P75</name>
              <description> bitfield P75 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P74" -->
            <field>
              <name>P74</name>
              <description> bitfield P74 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P73" -->
            <field>
              <name>P73</name>
              <description> bitfield P73 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P72" -->
            <field>
              <name>P72</name>
              <description> bitfield P72 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P71" -->
            <field>
              <name>P71</name>
              <description> bitfield P71 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P70" -->
            <field>
              <name>P70</name>
              <description> bitfield P70 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PFR8" -->
        <register>
          <name>PFR8</name>
          <description> register PFR8 </description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0000000F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P83" -->
            <field>
              <name>P83</name>
              <description> bitfield P83 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P82" -->
            <field>
              <name>P82</name>
              <description> bitfield P82 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P81" -->
            <field>
              <name>P81</name>
              <description> bitfield P81 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P80" -->
            <field>
              <name>P80</name>
              <description> bitfield P80 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PFR9" -->
        <register>
          <name>PFR9</name>
          <description> register PFR9 </description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x000000FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "P97" -->
            <field>
              <name>P97</name>
              <description> bitfield P97 </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P96" -->
            <field>
              <name>P96</name>
              <description> bitfield P96 </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P95" -->
            <field>
              <name>P95</name>
              <description> bitfield P95 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P94" -->
            <field>
              <name>P94</name>
              <description> bitfield P94 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P93" -->
            <field>
              <name>P93</name>
              <description> bitfield P93 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P92" -->
            <field>
              <name>P92</name>
              <description> bitfield P92 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P91" -->
            <field>
              <name>P91</name>
              <description> bitfield P91 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "P90" -->
            <field>
              <name>P90</name>
              <description> bitfield P90 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
