sol4ik/audio-steganography/try/fm4/s6e2cc_i2s_sk-fm4-176l-s6se2cc-v10/svd/S6E2CC.xml
        <!-- REGISTER "PFRA" -->
        <register>
          <name>PFRA</name>
          <description> register PFRA </description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PAF" -->
            <field>
              <name>PAF</name>
              <description> bitfield PAF </description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PAE" -->
            <field>
              <name>PAE</name>
              <description> bitfield PAE </description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PAD" -->
            <field>
              <name>PAD</name>
              <description> bitfield PAD </description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PAC" -->
            <field>
              <name>PAC</name>
              <description> bitfield PAC </description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PAB" -->
            <field>
              <name>PAB</name>
              <description> bitfield PAB </description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PAA" -->
            <field>
              <name>PAA</name>
              <description> bitfield PAA </description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PA9" -->
            <field>
              <name>PA9</name>
              <description> bitfield PA9 </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PA8" -->
            <field>
              <name>PA8</name>
              <description> bitfield PA8 </description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PA7" -->
            <field>
              <name>PA7</name>
              <description> bitfield PA7 </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PA6" -->
            <field>
              <name>PA6</name>
              <description> bitfield PA6 </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PA5" -->
            <field>
              <name>PA5</name>
              <description> bitfield PA5 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PA4" -->
            <field>
              <name>PA4</name>
              <description> bitfield PA4 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PA3" -->
            <field>
              <name>PA3</name>
              <description> bitfield PA3 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PA2" -->
            <field>
              <name>PA2</name>
              <description> bitfield PA2 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PA1" -->
            <field>
              <name>PA1</name>
              <description> bitfield PA1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PA0" -->
            <field>
              <name>PA0</name>
              <description> bitfield PA0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PFRB" -->
        <register>
          <name>PFRB</name>
          <description> register PFRB </description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PBF" -->
            <field>
              <name>PBF</name>
              <description> bitfield PBF </description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PBE" -->
            <field>
              <name>PBE</name>
              <description> bitfield PBE </description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PBD" -->
            <field>
              <name>PBD</name>
              <description> bitfield PBD </description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PBC" -->
            <field>
              <name>PBC</name>
              <description> bitfield PBC </description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PBB" -->
            <field>
              <name>PBB</name>
              <description> bitfield PBB </description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PBA" -->
            <field>
              <name>PBA</name>
              <description> bitfield PBA </description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PB9" -->
            <field>
              <name>PB9</name>
              <description> bitfield PB9 </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PB8" -->
            <field>
              <name>PB8</name>
              <description> bitfield PB8 </description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PB7" -->
            <field>
              <name>PB7</name>
              <description> bitfield PB7 </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PB6" -->
            <field>
              <name>PB6</name>
              <description> bitfield PB6 </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PB5" -->
            <field>
              <name>PB5</name>
              <description> bitfield PB5 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PB4" -->
            <field>
              <name>PB4</name>
              <description> bitfield PB4 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PB3" -->
            <field>
              <name>PB3</name>
              <description> bitfield PB3 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PB2" -->
            <field>
              <name>PB2</name>
              <description> bitfield PB2 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PB1" -->
            <field>
              <name>PB1</name>
              <description> bitfield PB1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PB0" -->
            <field>
              <name>PB0</name>
              <description> bitfield PB0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PFRC" -->
        <register>
          <name>PFRC</name>
          <description> register PFRC </description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PCF" -->
            <field>
              <name>PCF</name>
              <description> bitfield PCF </description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PCE" -->
            <field>
              <name>PCE</name>
              <description> bitfield PCE </description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PCD" -->
            <field>
              <name>PCD</name>
              <description> bitfield PCD </description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PCC" -->
            <field>
              <name>PCC</name>
              <description> bitfield PCC </description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PCB" -->
            <field>
              <name>PCB</name>
              <description> bitfield PCB </description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PCA" -->
            <field>
              <name>PCA</name>
              <description> bitfield PCA </description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PC9" -->
            <field>
              <name>PC9</name>
              <description> bitfield PC9 </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PC8" -->
            <field>
              <name>PC8</name>
              <description> bitfield PC8 </description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PC7" -->
            <field>
              <name>PC7</name>
              <description> bitfield PC7 </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PC6" -->
            <field>
              <name>PC6</name>
              <description> bitfield PC6 </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PC5" -->
            <field>
              <name>PC5</name>
              <description> bitfield PC5 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PC4" -->
            <field>
              <name>PC4</name>
              <description> bitfield PC4 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PC3" -->
            <field>
              <name>PC3</name>
              <description> bitfield PC3 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PC2" -->
            <field>
              <name>PC2</name>
              <description> bitfield PC2 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PC1" -->
            <field>
              <name>PC1</name>
              <description> bitfield PC1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PC0" -->
            <field>
              <name>PC0</name>
              <description> bitfield PC0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PFRD" -->
        <register>
          <name>PFRD</name>
          <description> register PFRD </description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x00000007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PD2" -->
            <field>
              <name>PD2</name>
              <description> bitfield PD2 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PD1" -->
            <field>
              <name>PD1</name>
              <description> bitfield PD1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PD0" -->
            <field>
              <name>PD0</name>
              <description> bitfield PD0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PFRE" -->
        <register>
          <name>PFRE</name>
          <description> register PFRE </description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x0000000B</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PE3" -->
            <field>
              <name>PE3</name>
              <description> bitfield PE3 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PE2" -->
            <field>
              <name>PE2</name>
              <description> bitfield PE2 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PE0" -->
            <field>
              <name>PE0</name>
              <description> bitfield PE0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
