sol4ik/audio-steganography/try/fm4/s6e2cc_i2s_sk-fm4-176l-s6se2cc-v10/svd/S6E2CC.xml
        <!-- REGISTER "PFRF" -->
        <register>
          <name>PFRF</name>
          <description> register PFRF </description>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <resetMask>0x00001FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PFC" -->
            <field>
              <name>PFC</name>
              <description> bitfield PFC </description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PFB" -->
            <field>
              <name>PFB</name>
              <description> bitfield PFB </description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PFA" -->
            <field>
              <name>PFA</name>
              <description> bitfield PFA </description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PF9" -->
            <field>
              <name>PF9</name>
              <description> bitfield PF9 </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PF8" -->
            <field>
              <name>PF8</name>
              <description> bitfield PF8 </description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PF7" -->
            <field>
              <name>PF7</name>
              <description> bitfield PF7 </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PF6" -->
            <field>
              <name>PF6</name>
              <description> bitfield PF6 </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PF5" -->
            <field>
              <name>PF5</name>
              <description> bitfield PF5 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PF4" -->
            <field>
              <name>PF4</name>
              <description> bitfield PF4 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PF3" -->
            <field>
              <name>PF3</name>
              <description> bitfield PF3 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PF2" -->
            <field>
              <name>PF2</name>
              <description> bitfield PF2 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PF1" -->
            <field>
              <name>PF1</name>
              <description> bitfield PF1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PF0" -->
            <field>
              <name>PF0</name>
              <description> bitfield PF0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PCR0" -->
        <register derivedFrom="PFR0">
          <name>PCR0</name>
          <description> register PCR0 </description>
          <addressOffset>0x100</addressOffset>
        </register>
        <!-- REGISTER "PCR1" -->
        <register derivedFrom="PFR1">
          <name>PCR1</name>
          <description> register PCR1 </description>
          <addressOffset>0x104</addressOffset>
        </register>
        <!-- REGISTER "PCR2" -->
        <register derivedFrom="PFR2">
          <name>PCR2</name>
          <description> register PCR2 </description>
          <addressOffset>0x108</addressOffset>
        </register>
        <!-- REGISTER "PCR3" -->
        <register derivedFrom="PFR3">
          <name>PCR3</name>
          <description> register PCR3 </description>
          <addressOffset>0x10C</addressOffset>
        </register>
        <!-- REGISTER "PCR4" -->
        <register derivedFrom="PFR4">
          <name>PCR4</name>
          <description> register PCR4 </description>
          <addressOffset>0x110</addressOffset>
        </register>
        <!-- REGISTER "PCR5" -->
        <register derivedFrom="PFR5">
          <name>PCR5</name>
          <description> register PCR5 </description>
          <addressOffset>0x114</addressOffset>
        </register>
        <!-- REGISTER "PCR6" -->
        <register derivedFrom="PFR6">
          <name>PCR6</name>
          <description> register PCR6 </description>
          <addressOffset>0x118</addressOffset>
        </register>
        <!-- REGISTER "PCR7" -->
        <register derivedFrom="PFR7">
          <name>PCR7</name>
          <description> register PCR7 </description>
          <addressOffset>0x11C</addressOffset>
        </register>
        <!-- REGISTER "PCR8" -->
        <register derivedFrom="PFR8">
          <name>PCR8</name>
          <description> register PCR8 </description>
          <addressOffset>0x120</addressOffset>
        </register>
        <!-- REGISTER "PCR9" -->
        <register derivedFrom="PFR9">
          <name>PCR9</name>
          <description> register PCR9 </description>
          <addressOffset>0x124</addressOffset>
        </register>
