sol4ik/audio-steganography/try/fm4/s6e2cc_i2s_sk-fm4-176l-s6se2cc-v10/svd/S6E2CC.xml
        <!-- REGISTER "PZR0" -->
        <register derivedFrom="DDR0">
          <name>PZR0</name>
          <description> register PZR0 </description>
          <addressOffset>0x700</addressOffset>
        </register>
        <!-- REGISTER "PZR1" -->
        <register derivedFrom="DDR1">
          <name>PZR1</name>
          <description> register PZR1 </description>
          <addressOffset>0x704</addressOffset>
        </register>
        <!-- REGISTER "PZR2" -->
        <register derivedFrom="DDR2">
          <name>PZR2</name>
          <description> register PZR2 </description>
          <addressOffset>0x708</addressOffset>
        </register>
        <!-- REGISTER "PZR3" -->
        <register derivedFrom="DDR3">
          <name>PZR3</name>
          <description> register PZR3 </description>
          <addressOffset>0x70C</addressOffset>
        </register>
        <!-- REGISTER "PZR4" -->
        <register derivedFrom="DDR4">
          <name>PZR4</name>
          <description> register PZR4 </description>
          <addressOffset>0x710</addressOffset>
        </register>
        <!-- REGISTER "PZR5" -->
        <register derivedFrom="DDR5">
          <name>PZR5</name>
          <description> register PZR5 </description>
          <addressOffset>0x714</addressOffset>
        </register>
        <!-- REGISTER "PZR6" -->
        <register derivedFrom="DDR6">
          <name>PZR6</name>
          <description> register PZR6 </description>
          <addressOffset>0x718</addressOffset>
        </register>
        <!-- REGISTER "PZR7" -->
        <register derivedFrom="DDR7">
          <name>PZR7</name>
          <description> register PZR7 </description>
          <addressOffset>0x71C</addressOffset>
        </register>
        <!-- REGISTER "PZR8" -->
        <register derivedFrom="DDR8">
          <name>PZR8</name>
          <description> register PZR8 </description>
          <addressOffset>0x720</addressOffset>
        </register>
        <!-- REGISTER "PZR9" -->
        <register derivedFrom="DDR9">
          <name>PZR9</name>
          <description> register PZR9 </description>
          <addressOffset>0x724</addressOffset>
        </register>
        <!-- REGISTER "PZRA" -->
        <register derivedFrom="DDRA">
          <name>PZRA</name>
          <description> register PZRA </description>
          <addressOffset>0x728</addressOffset>
        </register>
        <!-- REGISTER "PZRB" -->
        <register derivedFrom="DDRB">
          <name>PZRB</name>
          <description> register PZRB </description>
          <addressOffset>0x72C</addressOffset>
        </register>
        <!-- REGISTER "PZRC" -->
        <register derivedFrom="DDRC">
          <name>PZRC</name>
          <description> register PZRC </description>
          <addressOffset>0x730</addressOffset>
        </register>
        <!-- REGISTER "PZRD" -->
        <register derivedFrom="DDRD">
          <name>PZRD</name>
          <description> register PZRD </description>
          <addressOffset>0x734</addressOffset>
        </register>
        <!-- REGISTER "PZRE" -->
        <register derivedFrom="DDRE">
          <name>PZRE</name>
          <description> register PZRE </description>
          <addressOffset>0x738</addressOffset>
        </register>
        <!-- REGISTER "PZRF" -->
        <register derivedFrom="DDRF">
          <name>PZRF</name>
          <description> register PZRF </description>
          <addressOffset>0x73C</addressOffset>
        </register>
        <!-- REGISTER "PDSR0" -->
        <register derivedFrom="DDR0">
          <name>PDSR0</name>
          <description> register PDSR0 </description>
          <addressOffset>0x740</addressOffset>
        </register>
        <!-- REGISTER "PDSR1" -->
        <register derivedFrom="DDR1">
          <name>PDSR1</name>
          <description> register PDSR1 </description>
          <addressOffset>0x744</addressOffset>
        </register>
        <!-- REGISTER "PDSR2" -->
        <register derivedFrom="DDR2">
          <name>PDSR2</name>
          <description> register PDSR2 </description>
          <addressOffset>0x748</addressOffset>
        </register>
        <!-- REGISTER "PDSR3" -->
        <register derivedFrom="DDR3">
          <name>PDSR3</name>
          <description> register PDSR3 </description>
          <addressOffset>0x74C</addressOffset>
        </register>
        <!-- REGISTER "PDSR4" -->
        <register derivedFrom="DDR4">
          <name>PDSR4</name>
          <description> register PDSR4 </description>
          <addressOffset>0x750</addressOffset>
        </register>
        <!-- REGISTER "PDSR5" -->
        <register derivedFrom="DDR5">
          <name>PDSR5</name>
          <description> register PDSR5 </description>
          <addressOffset>0x754</addressOffset>
        </register>
        <!-- REGISTER "PDSR6" -->
        <register derivedFrom="DDR6">
          <name>PDSR6</name>
          <description> register PDSR6 </description>
          <addressOffset>0x758</addressOffset>
        </register>
        <!-- REGISTER "PDSR7" -->
        <register derivedFrom="DDR7">
          <name>PDSR7</name>
          <description> register PDSR7 </description>
          <addressOffset>0x75C</addressOffset>
        </register>
        <!-- REGISTER "PDSR8" -->
        <register derivedFrom="DDR8">
          <name>PDSR8</name>
          <description> register PDSR8 </description>
          <addressOffset>0x760</addressOffset>
        </register>
        <!-- REGISTER "PDSR9" -->
        <register derivedFrom="DDR9">
          <name>PDSR9</name>
          <description> register PDSR9 </description>
          <addressOffset>0x764</addressOffset>
        </register>
        <!-- REGISTER "PDSRA" -->
        <register derivedFrom="DDRA">
          <name>PDSRA</name>
          <description> register PDSRA </description>
          <addressOffset>0x768</addressOffset>
        </register>
        <!-- REGISTER "PDSRB" -->
        <register derivedFrom="DDRB">
          <name>PDSRB</name>
          <description> register PDSRB </description>
          <addressOffset>0x76C</addressOffset>
        </register>
        <!-- REGISTER "PDSRC" -->
        <register derivedFrom="DDRC">
          <name>PDSRC</name>
          <description> register PDSRC </description>
          <addressOffset>0x770</addressOffset>
        </register>
        <!-- REGISTER "PDSRD" -->
        <register derivedFrom="DDRD">
          <name>PDSRD</name>
          <description> register PDSRD </description>
          <addressOffset>0x774</addressOffset>
        </register>
        <!-- REGISTER "PDSRE" -->
        <register derivedFrom="DDRE">
          <name>PDSRE</name>
          <description> register PDSRE </description>
          <addressOffset>0x778</addressOffset>
        </register>
        <!-- REGISTER "PDSRF" -->
        <register derivedFrom="DDRF">
          <name>PDSRF</name>
          <description> register PDSRF </description>
          <addressOffset>0x77C</addressOffset>
        </register>
