sol4ik/audio-steganography/try/fm4/s6e2cc_i2s_sk-fm4-176l-s6se2cc-v10/svd/S6E2CC.xml
      </registers>
    </peripheral>
    <!-- PERIPHERAL "LVD" -->
    <peripheral>
      <name>LVD</name>
      <description> peripheral LVD </description>
      <groupName>LVD</groupName>
      <baseAddress>0x40035000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xC</offset>
        <size>0x5</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- INTERRUPT "LVD" -->
      <interrupt>
        <name>LVD</name>
        <value>2</value>
      </interrupt>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "LVD_CTL" -->
        <register>
          <name>LVD_CTL</name>
          <description> register LVD_CTL </description>
          <addressOffset>0x0</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x40</resetValue>
          <resetMask>0xFC</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LVDIE" -->
            <field>
              <name>LVDIE</name>
              <description> bitfield LVDIE </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SVHI" -->
            <field>
              <name>SVHI</name>
              <description> bitfield SVHI </description>
              <lsb>2</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LVD_STR" -->
        <register>
          <name>LVD_STR</name>
          <description> register LVD_STR </description>
          <addressOffset>0x4</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x80</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LVDIR" -->
            <field>
              <name>LVDIR</name>
              <description> bitfield LVDIR </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LVD_CLR" -->
        <register>
          <name>LVD_CLR</name>
          <description> register LVD_CLR </description>
          <addressOffset>0x8</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x80</resetValue>
          <resetMask>0x80</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LVDCL" -->
            <field>
              <name>LVDCL</name>
              <description> bitfield LVDCL </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LVD_RLR" -->
        <register>
          <name>LVD_RLR</name>
          <description> register LVD_RLR </description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LVDLCK" -->
            <field>
              <name>LVDLCK</name>
              <description> bitfield LVDLCK </description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LVD_STR2" -->
        <register>
          <name>LVD_STR2</name>
          <description> register LVD_STR2 </description>
          <addressOffset>0x10</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x40</resetValue>
          <resetMask>0x80</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LVDIRDY" -->
            <field>
              <name>LVDIRDY</name>
              <description> bitfield LVDIRDY </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "DS" -->
    <peripheral>
      <name>DS</name>
      <description> peripheral DS </description>
      <groupName>DS</groupName>
      <baseAddress>0x40035100</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x4</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x700</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x704</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x708</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x70C</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x710</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x714</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x800</offset>
        <size>0x16</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "RCK_CTL" -->
        <register>
          <name>RCK_CTL</name>
          <description> register RCK_CTL </description>
          <addressOffset>0x4</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x01</resetValue>
          <resetMask>0x01</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RTCCKE" -->
            <field>
              <name>RTCCKE</name>
              <description> bitfield RTCCKE </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PMD_CTL" -->
        <register>
          <name>PMD_CTL</name>
          <description> register PMD_CTL </description>
          <addressOffset>0x700</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x01</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RTCE" -->
            <field>
              <name>RTCE</name>
              <description> bitfield RTCE </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WRFSR" -->
        <register>
          <name>WRFSR</name>
          <description> register WRFSR </description>
          <addressOffset>0x704</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WLVDH" -->
            <field>
              <name>WLVDH</name>
              <description> bitfield WLVDH </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WINITX" -->
            <field>
              <name>WINITX</name>
              <description> bitfield WINITX </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WIFSR" -->
        <register>
          <name>WIFSR</name>
          <description> register WIFSR </description>
          <addressOffset>0x708</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x00FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WUI5" -->
            <field>
              <name>WUI5</name>
              <description> bitfield WUI5 </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WUI4" -->
            <field>
              <name>WUI4</name>
              <description> bitfield WUI4 </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WUI3" -->
            <field>
              <name>WUI3</name>
              <description> bitfield WUI3 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WUI2" -->
            <field>
              <name>WUI2</name>
              <description> bitfield WUI2 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WUI1" -->
            <field>
              <name>WUI1</name>
              <description> bitfield WUI1 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WUI0" -->
            <field>
              <name>WUI0</name>
              <description> bitfield WUI0 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WLVDI" -->
            <field>
              <name>WLVDI</name>
              <description> bitfield WLVDI </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WRTCI" -->
            <field>
              <name>WRTCI</name>
              <description> bitfield WRTCI </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
