sol4ik/audio-steganography/try/fm4/s6e2cc_i2s_sk-fm4-176l-s6se2cc-v10/svd/S6E2CC.xml
        <!-- REGISTER "WTYR" -->
        <register>
          <name>WTYR</name>
          <description> register WTYR </description>
          <addressOffset>0x134</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TY" -->
            <field>
              <name>TY</name>
              <description> bitfield TY </description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "Y" -->
            <field>
              <name>Y</name>
              <description> bitfield Y </description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ALMIR" -->
        <register>
          <name>ALMIR</name>
          <description> register ALMIR </description>
          <addressOffset>0x138</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x7F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TAMI" -->
            <field>
              <name>TAMI</name>
              <description> bitfield TAMI </description>
              <lsb>4</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AMI" -->
            <field>
              <name>AMI</name>
              <description> bitfield AMI </description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ALHR" -->
        <register>
          <name>ALHR</name>
          <description> register ALHR </description>
          <addressOffset>0x13C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TAH" -->
            <field>
              <name>TAH</name>
              <description> bitfield TAH </description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AH" -->
            <field>
              <name>AH</name>
              <description> bitfield AH </description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ALDR" -->
        <register>
          <name>ALDR</name>
          <description> register ALDR </description>
          <addressOffset>0x140</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TAD" -->
            <field>
              <name>TAD</name>
              <description> bitfield TAD </description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AD" -->
            <field>
              <name>AD</name>
              <description> bitfield AD </description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ALMOR" -->
        <register>
          <name>ALMOR</name>
          <description> register ALMOR </description>
          <addressOffset>0x144</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x1F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TAMO0" -->
            <field>
              <name>TAMO0</name>
              <description> bitfield TAMO0 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AMO" -->
            <field>
              <name>AMO</name>
              <description> bitfield AMO </description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ALYR" -->
        <register>
          <name>ALYR</name>
          <description> register ALYR </description>
          <addressOffset>0x148</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TAY" -->
            <field>
              <name>TAY</name>
              <description> bitfield TAY </description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AY" -->
            <field>
              <name>AY</name>
              <description> bitfield AY </description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WTTR0" -->
        <register>
          <name>WTTR0</name>
          <description> register WTTR0 </description>
          <addressOffset>0x14C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TM7_0" -->
            <field>
              <name>TM7_0</name>
              <description> bitfield TM7_0 </description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WTTR1" -->
        <register>
          <name>WTTR1</name>
          <description> register WTTR1 </description>
          <addressOffset>0x150</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TM15_8" -->
            <field>
              <name>TM15_8</name>
              <description> bitfield TM15_8 </description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WTTR2" -->
        <register>
          <name>WTTR2</name>
          <description> register WTTR2 </description>
          <addressOffset>0x154</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TM17_16" -->
            <field>
              <name>TM17_16</name>
              <description> bitfield TM17_16 </description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "WTCAL0" -->
        <register>
          <name>WTCAL0</name>
          <description> register WTCAL0 </description>
          <addressOffset>0x158</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WTCAL0" -->
            <field>
              <name>WTCAL0</name>
              <description> bitfield WTCAL0 </description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
