sol4ik/audio-steganography/try/fm4/s6e2cc_i2s_sk-fm4-176l-s6se2cc-v10/svd/S6E2CC.xml
        <!-- REGISTER "BREG39" -->
        <register>
          <name>BREG39</name>
          <description> register BREG39 </description>
          <addressOffset>0x239</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG3A" -->
        <register>
          <name>BREG3A</name>
          <description> register BREG3A </description>
          <addressOffset>0x23A</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG3B" -->
        <register>
          <name>BREG3B</name>
          <description> register BREG3B </description>
          <addressOffset>0x23B</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG3C" -->
        <register>
          <name>BREG3C</name>
          <description> register BREG3C </description>
          <addressOffset>0x23C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG3D" -->
        <register>
          <name>BREG3D</name>
          <description> register BREG3D </description>
          <addressOffset>0x23D</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG3E" -->
        <register>
          <name>BREG3E</name>
          <description> register BREG3E </description>
          <addressOffset>0x23E</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG3F" -->
        <register>
          <name>BREG3F</name>
          <description> register BREG3F </description>
          <addressOffset>0x23F</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG40" -->
        <register>
          <name>BREG40</name>
          <description> register BREG40 </description>
          <addressOffset>0x240</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG41" -->
        <register>
          <name>BREG41</name>
          <description> register BREG41 </description>
          <addressOffset>0x241</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG42" -->
        <register>
          <name>BREG42</name>
          <description> register BREG42 </description>
          <addressOffset>0x242</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG43" -->
        <register>
          <name>BREG43</name>
          <description> register BREG43 </description>
          <addressOffset>0x243</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG44" -->
        <register>
          <name>BREG44</name>
          <description> register BREG44 </description>
          <addressOffset>0x244</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG45" -->
        <register>
          <name>BREG45</name>
          <description> register BREG45 </description>
          <addressOffset>0x245</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG46" -->
        <register>
          <name>BREG46</name>
          <description> register BREG46 </description>
          <addressOffset>0x246</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG47" -->
        <register>
          <name>BREG47</name>
          <description> register BREG47 </description>
          <addressOffset>0x247</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG48" -->
        <register>
          <name>BREG48</name>
          <description> register BREG48 </description>
          <addressOffset>0x248</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG49" -->
        <register>
          <name>BREG49</name>
          <description> register BREG49 </description>
          <addressOffset>0x249</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG4A" -->
        <register>
          <name>BREG4A</name>
          <description> register BREG4A </description>
          <addressOffset>0x24A</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
