sol4ik/audio-steganography/try/fm4/s6e2cc_i2s_sk-fm4-176l-s6se2cc-v10/svd/S6E2CC.xml
        <!-- REGISTER "BREG4B" -->
        <register>
          <name>BREG4B</name>
          <description> register BREG4B </description>
          <addressOffset>0x24B</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG4C" -->
        <register>
          <name>BREG4C</name>
          <description> register BREG4C </description>
          <addressOffset>0x24C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG4D" -->
        <register>
          <name>BREG4D</name>
          <description> register BREG4D </description>
          <addressOffset>0x24D</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG4E" -->
        <register>
          <name>BREG4E</name>
          <description> register BREG4E </description>
          <addressOffset>0x24E</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG4F" -->
        <register>
          <name>BREG4F</name>
          <description> register BREG4F </description>
          <addressOffset>0x24F</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG50" -->
        <register>
          <name>BREG50</name>
          <description> register BREG50 </description>
          <addressOffset>0x250</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG51" -->
        <register>
          <name>BREG51</name>
          <description> register BREG51 </description>
          <addressOffset>0x251</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG52" -->
        <register>
          <name>BREG52</name>
          <description> register BREG52 </description>
          <addressOffset>0x252</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG53" -->
        <register>
          <name>BREG53</name>
          <description> register BREG53 </description>
          <addressOffset>0x253</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG54" -->
        <register>
          <name>BREG54</name>
          <description> register BREG54 </description>
          <addressOffset>0x254</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG55" -->
        <register>
          <name>BREG55</name>
          <description> register BREG55 </description>
          <addressOffset>0x255</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG56" -->
        <register>
          <name>BREG56</name>
          <description> register BREG56 </description>
          <addressOffset>0x256</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG57" -->
        <register>
          <name>BREG57</name>
          <description> register BREG57 </description>
          <addressOffset>0x257</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG58" -->
        <register>
          <name>BREG58</name>
          <description> register BREG58 </description>
          <addressOffset>0x258</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG59" -->
        <register>
          <name>BREG59</name>
          <description> register BREG59 </description>
          <addressOffset>0x259</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG5A" -->
        <register>
          <name>BREG5A</name>
          <description> register BREG5A </description>
          <addressOffset>0x25A</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG5B" -->
        <register>
          <name>BREG5B</name>
          <description> register BREG5B </description>
          <addressOffset>0x25B</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG5C" -->
        <register>
          <name>BREG5C</name>
          <description> register BREG5C </description>
          <addressOffset>0x25C</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
        <!-- REGISTER "BREG5D" -->
        <register>
          <name>BREG5D</name>
          <description> register BREG5D </description>
          <addressOffset>0x25D</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0xFF</resetMask>
        </register>
