sol4ik/audio-steganography/try/fm4/s6e2cc_i2s_sk-fm4-176l-s6se2cc-v10/svd/S6E2CC.xml
        <!-- REGISTER "AREA2" -->
        <register>
          <name>AREA2</name>
          <description> register AREA2 </description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x000F0020</resetValue>
          <resetMask>0x007F00FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MASK" -->
            <field>
              <name>MASK</name>
              <description> bitfield MASK </description>
              <lsb>16</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ADDR" -->
            <field>
              <name>ADDR</name>
              <description> bitfield ADDR </description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "AREA3" -->
        <register>
          <name>AREA3</name>
          <description> register AREA3 </description>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x000F0030</resetValue>
          <resetMask>0x007F00FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MASK" -->
            <field>
              <name>MASK</name>
              <description> bitfield MASK </description>
              <lsb>16</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ADDR" -->
            <field>
              <name>ADDR</name>
              <description> bitfield ADDR </description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "AREA4" -->
        <register>
          <name>AREA4</name>
          <description> register AREA4 </description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x000F0040</resetValue>
          <resetMask>0x007F00FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MASK" -->
            <field>
              <name>MASK</name>
              <description> bitfield MASK </description>
              <lsb>16</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ADDR" -->
            <field>
              <name>ADDR</name>
              <description> bitfield ADDR </description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "AREA5" -->
        <register>
          <name>AREA5</name>
          <description> register AREA5 </description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x000F0050</resetValue>
          <resetMask>0x007F00FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MASK" -->
            <field>
              <name>MASK</name>
              <description> bitfield MASK </description>
              <lsb>16</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ADDR" -->
            <field>
              <name>ADDR</name>
              <description> bitfield ADDR </description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "AREA6" -->
        <register>
          <name>AREA6</name>
          <description> register AREA6 </description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x000F0060</resetValue>
          <resetMask>0x007F00FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MASK" -->
            <field>
              <name>MASK</name>
              <description> bitfield MASK </description>
              <lsb>16</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ADDR" -->
            <field>
              <name>ADDR</name>
              <description> bitfield ADDR </description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "AREA7" -->
        <register>
          <name>AREA7</name>
          <description> register AREA7 </description>
          <addressOffset>0x5C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x000F0070</resetValue>
          <resetMask>0x007F00FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MASK" -->
            <field>
              <name>MASK</name>
              <description> bitfield MASK </description>
              <lsb>16</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ADDR" -->
            <field>
              <name>ADDR</name>
              <description> bitfield ADDR </description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ATIM0" -->
        <register>
          <name>ATIM0</name>
          <description> register ATIM0 </description>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000045F</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ALEW" -->
            <field>
              <name>ALEW</name>
              <description> bitfield ALEW </description>
              <lsb>8</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ALES" -->
            <field>
              <name>ALES</name>
              <description> bitfield ALES </description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ALC" -->
            <field>
              <name>ALC</name>
              <description> bitfield ALC </description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ATIM1" -->
        <register derivedFrom="ATIM0">
          <name>ATIM1</name>
          <description> register ATIM1 </description>
          <addressOffset>0x64</addressOffset>
        </register>
        <!-- REGISTER "ATIM2" -->
        <register derivedFrom="ATIM0">
          <name>ATIM2</name>
          <description> register ATIM2 </description>
          <addressOffset>0x68</addressOffset>
        </register>
