sol4ik/audio-steganography/try/fm4/s6e2cc_i2s_sk-fm4-176l-s6se2cc-v10/svd/S6E2CC.xml
        <!-- REGISTER "ESCLR" -->
        <register>
          <name>ESCLR</name>
          <description> register ESCLR </description>
          <addressOffset>0x30C</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00000001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WERRCLR" -->
            <field>
              <name>WERRCLR</name>
              <description> bitfield WERRCLR </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "AMODE" -->
        <register>
          <name>AMODE</name>
          <description> register AMODE </description>
          <addressOffset>0x310</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00000001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WAEN" -->
            <field>
              <name>WAEN</name>
              <description> bitfield WAEN </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "USBETHERCLK" -->
    <peripheral>
      <name>USBETHERCLK</name>
      <description> peripheral USBETHERCLK </description>
      <groupName>USBETHERCLK</groupName>
      <baseAddress>0x40036000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xC</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x14</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x18</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1C</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x20</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x24</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x28</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2C</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x30</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x34</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "UCCR" -->
        <register>
          <name>UCCR</name>
          <description> register UCCR </description>
          <addressOffset>0x00</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x7F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ECSEL1" -->
            <field>
              <name>ECSEL1</name>
              <description> bitfield ECSEL1 </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECSEL0" -->
            <field>
              <name>ECSEL0</name>
              <description> bitfield ECSEL0 </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECEN" -->
            <field>
              <name>ECEN</name>
              <description> bitfield ECEN </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UCEN1" -->
            <field>
              <name>UCEN1</name>
              <description> bitfield UCEN1 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UCSEL1" -->
            <field>
              <name>UCSEL1</name>
              <description> bitfield UCSEL1 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UCSEL0" -->
            <field>
              <name>UCSEL0</name>
              <description> bitfield UCSEL0 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UCEN0" -->
            <field>
              <name>UCEN0</name>
              <description> bitfield UCEN0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "UPCR1" -->
        <register>
          <name>UPCR1</name>
          <description> register UPCR1 </description>
          <addressOffset>0x04</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "UPINC" -->
            <field>
              <name>UPINC</name>
              <description> bitfield UPINC </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UPLLEN" -->
            <field>
              <name>UPLLEN</name>
              <description> bitfield UPLLEN </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
