sol4ik/audio-steganography/try/fm4/s6e2cc_i2s_sk-fm4-176l-s6se2cc-v10/svd/S6E2CC.xml
      </registers>
    </peripheral>
    <!-- PERIPHERAL "CAN1" -->
    <peripheral derivedFrom="CAN0">
      <name>CAN1</name>
      <baseAddress>0x40063000</baseAddress>
      <!-- INTERRUPT "CAN1" -->
      <interrupt>
        <name>CAN1</name>
        <value>81</value>
      </interrupt>
    </peripheral>
    <!-- PERIPHERAL "CANFD" -->
    <peripheral>
      <name>CANFD</name>
      <description> peripheral CANFD </description>
      <groupName>CANFD</groupName>
      <baseAddress>0x40070000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xC</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x14</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x18</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1C</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x20</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x24</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x28</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2C</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x30</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x34</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x35</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x38</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x39</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x3A</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x3B</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x3C</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x3E</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x40</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x44</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x50</offset>
        <size>0x64</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x90</offset>
        <size>0x64</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xD0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xD4</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xD8</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xDC</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xE0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xE4</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xF0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xF4</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xF8</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x200</offset>
        <size>0x20</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "CREL" -->
        <register>
          <name>CREL</name>
          <description> register CREL </description>
          <addressOffset>0x00</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x30130506</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "REL" -->
            <field>
              <name>REL</name>
              <description> bitfield REL </description>
              <lsb>28</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "STEP" -->
            <field>
              <name>STEP</name>
              <description> bitfield STEP </description>
              <lsb>24</lsb>
              <msb>27</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "SUBSTEP" -->
            <field>
              <name>SUBSTEP</name>
              <description> bitfield SUBSTEP </description>
              <lsb>20</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "YEAR" -->
            <field>
              <name>YEAR</name>
              <description> bitfield YEAR </description>
              <lsb>16</lsb>
              <msb>19</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MON" -->
            <field>
              <name>MON</name>
              <description> bitfield MON </description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "DAY" -->
            <field>
              <name>DAY</name>
              <description> bitfield DAY </description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ENDN" -->
        <register>
          <name>ENDN</name>
          <description> register ENDN </description>
          <addressOffset>0x04</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x87654321</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ETV" -->
            <field>
              <name>ETV</name>
              <description> bitfield ETV </description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FBTP" -->
        <register>
          <name>FBTP</name>
          <description> register FBTP </description>
          <addressOffset>0x0C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x1F9F0F73</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TDCO" -->
            <field>
              <name>TDCO</name>
              <description> bitfield TDCO </description>
              <lsb>24</lsb>
              <msb>28</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TDC" -->
            <field>
              <name>TDC</name>
              <description> bitfield TDC </description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FBRP" -->
            <field>
              <name>FBRP</name>
              <description> bitfield FBRP </description>
              <lsb>16</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FTSEG1" -->
            <field>
              <name>FTSEG1</name>
              <description> bitfield FTSEG1 </description>
              <lsb>8</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FTSEG2" -->
            <field>
              <name>FTSEG2</name>
              <description> bitfield FTSEG2 </description>
              <lsb>4</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FSJW" -->
            <field>
              <name>FSJW</name>
              <description> bitfield FSJW </description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TEST" -->
        <register>
          <name>TEST</name>
          <description> register TEST </description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00003FF0</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TDCV" -->
            <field>
              <name>TDCV</name>
              <description> bitfield TDCV </description>
              <lsb>8</lsb>
              <msb>13</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RX" -->
            <field>
              <name>RX</name>
              <description> bitfield RX </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TX" -->
            <field>
              <name>TX</name>
              <description> bitfield TX </description>
              <lsb>5</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LBCK" -->
            <field>
              <name>LBCK</name>
              <description> bitfield LBCK </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RWD" -->
        <register>
          <name>RWD</name>
          <description> register RWD </description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WDV" -->
            <field>
              <name>WDV</name>
              <description> bitfield WDV </description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WDC" -->
            <field>
              <name>WDC</name>
              <description> bitfield WDC </description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CCCR" -->
        <register>
          <name>CCCR</name>
          <description> register CCCR </description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x00007FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TXP" -->
            <field>
              <name>TXP</name>
              <description> bitfield TXP </description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FDBS" -->
            <field>
              <name>FDBS</name>
              <description> bitfield FDBS </description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "FDO" -->
            <field>
              <name>FDO</name>
              <description> bitfield FDO </description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CMR" -->
            <field>
              <name>CMR</name>
              <description> bitfield CMR </description>
              <lsb>10</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CME" -->
            <field>
              <name>CME</name>
              <description> bitfield CME </description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TEST" -->
            <field>
              <name>TEST</name>
              <description> bitfield TEST </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DAR" -->
            <field>
              <name>DAR</name>
              <description> bitfield DAR </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MON" -->
            <field>
              <name>MON</name>
              <description> bitfield MON </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CSR" -->
            <field>
              <name>CSR</name>
              <description> bitfield CSR </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CSA" -->
            <field>
              <name>CSA</name>
              <description> bitfield CSA </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ASM" -->
            <field>
              <name>ASM</name>
              <description> bitfield ASM </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CCE" -->
            <field>
              <name>CCE</name>
              <description> bitfield CCE </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "INIT" -->
            <field>
              <name>INIT</name>
              <description> bitfield INIT </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "BTP" -->
        <register>
          <name>BTP</name>
          <description> register BTP </description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000A33</resetValue>
          <resetMask>0x03FF3FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BRP" -->
            <field>
              <name>BRP</name>
              <description> bitfield BRP </description>
              <lsb>16</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TSEG1" -->
            <field>
              <name>TSEG1</name>
              <description> bitfield TSEG1 </description>
              <lsb>8</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TSEG2" -->
            <field>
              <name>TSEG2</name>
              <description> bitfield TSEG2 </description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SJW" -->
            <field>
              <name>SJW</name>
              <description> bitfield SJW </description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TSCC" -->
        <register>
          <name>TSCC</name>
          <description> register TSCC </description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000F0003</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TCP" -->
            <field>
              <name>TCP</name>
              <description> bitfield TCP </description>
              <lsb>16</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TSS" -->
            <field>
              <name>TSS</name>
              <description> bitfield TSS </description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TSCV" -->
        <register>
          <name>TSCV</name>
          <description> register TSCV </description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TSC" -->
            <field>
              <name>TSC</name>
              <description> bitfield TSC </description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TOCC" -->
        <register>
          <name>TOCC</name>
          <description> register TOCC </description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFF0007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TOP" -->
            <field>
              <name>TOP</name>
              <description> bitfield TOP </description>
              <lsb>16</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TOS" -->
            <field>
              <name>TOS</name>
              <description> bitfield TOS </description>
              <lsb>1</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ETOC" -->
            <field>
              <name>ETOC</name>
              <description> bitfield ETOC </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TOCV" -->
        <register>
          <name>TOCV</name>
          <description> register TOCV </description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000FFFF</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TOC" -->
            <field>
              <name>TOC</name>
              <description> bitfield TOC </description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
