sol4ik/audio-steganography/try/fm4/s6e2cc_i2s_sk-fm4-176l-s6se2cc-v10/svd/S6E2CC.xml
        <!-- REGISTER "ECR" -->
        <register>
          <name>ECR</name>
          <description> register ECR </description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CEL" -->
            <field>
              <name>CEL</name>
              <description> bitfield CEL </description>
              <lsb>16</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RP" -->
            <field>
              <name>RP</name>
              <description> bitfield RP </description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "REC" -->
            <field>
              <name>REC</name>
              <description> bitfield REC </description>
              <lsb>8</lsb>
              <msb>14</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TEC" -->
            <field>
              <name>TEC</name>
              <description> bitfield TEC </description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PSR" -->
        <register>
          <name>PSR</name>
          <description> register PSR </description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000707</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "REDL" -->
            <field>
              <name>REDL</name>
              <description> bitfield REDL </description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RBRS" -->
            <field>
              <name>RBRS</name>
              <description> bitfield RBRS </description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RESI" -->
            <field>
              <name>RESI</name>
              <description> bitfield RESI </description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "FLEC" -->
            <field>
              <name>FLEC</name>
              <description> bitfield FLEC </description>
              <lsb>8</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BO" -->
            <field>
              <name>BO</name>
              <description> bitfield BO </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EW" -->
            <field>
              <name>EW</name>
              <description> bitfield EW </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EP" -->
            <field>
              <name>EP</name>
              <description> bitfield EP </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ACT" -->
            <field>
              <name>ACT</name>
              <description> bitfield ACT </description>
              <lsb>3</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "LEC" -->
            <field>
              <name>LEC</name>
              <description> bitfield LEC </description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IR" -->
        <register>
          <name>IR</name>
          <description> register IR </description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "STE" -->
            <field>
              <name>STE</name>
              <description> bitfield STE </description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FOE" -->
            <field>
              <name>FOE</name>
              <description> bitfield FOE </description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ACKE" -->
            <field>
              <name>ACKE</name>
              <description> bitfield ACKE </description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BE" -->
            <field>
              <name>BE</name>
              <description> bitfield BE </description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CRCE" -->
            <field>
              <name>CRCE</name>
              <description> bitfield CRCE </description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WDI" -->
            <field>
              <name>WDI</name>
              <description> bitfield WDI </description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BO" -->
            <field>
              <name>BO</name>
              <description> bitfield BO </description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EW" -->
            <field>
              <name>EW</name>
              <description> bitfield EW </description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EP" -->
            <field>
              <name>EP</name>
              <description> bitfield EP </description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ELO" -->
            <field>
              <name>ELO</name>
              <description> bitfield ELO </description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BEU" -->
            <field>
              <name>BEU</name>
              <description> bitfield BEU </description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BEC" -->
            <field>
              <name>BEC</name>
              <description> bitfield BEC </description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DRX" -->
            <field>
              <name>DRX</name>
              <description> bitfield DRX </description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TOO" -->
            <field>
              <name>TOO</name>
              <description> bitfield TOO </description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MRAF" -->
            <field>
              <name>MRAF</name>
              <description> bitfield MRAF </description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TSW" -->
            <field>
              <name>TSW</name>
              <description> bitfield TSW </description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TEFL" -->
            <field>
              <name>TEFL</name>
              <description> bitfield TEFL </description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TEFF" -->
            <field>
              <name>TEFF</name>
              <description> bitfield TEFF </description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TEFW" -->
            <field>
              <name>TEFW</name>
              <description> bitfield TEFW </description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TEFN" -->
            <field>
              <name>TEFN</name>
              <description> bitfield TEFN </description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TFE" -->
            <field>
              <name>TFE</name>
              <description> bitfield TFE </description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TCF" -->
            <field>
              <name>TCF</name>
              <description> bitfield TCF </description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TC" -->
            <field>
              <name>TC</name>
              <description> bitfield TC </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "HPM" -->
            <field>
              <name>HPM</name>
              <description> bitfield HPM </description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RF1L" -->
            <field>
              <name>RF1L</name>
              <description> bitfield RF1L </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RF1F" -->
            <field>
              <name>RF1F</name>
              <description> bitfield RF1F </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RF1W" -->
            <field>
              <name>RF1W</name>
              <description> bitfield RF1W </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RF1N" -->
            <field>
              <name>RF1N</name>
              <description> bitfield RF1N </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RF0L" -->
            <field>
              <name>RF0L</name>
              <description> bitfield RF0L </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RF0F" -->
            <field>
              <name>RF0F</name>
              <description> bitfield RF0F </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RF0W" -->
            <field>
              <name>RF0W</name>
              <description> bitfield RF0W </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RF0N" -->
            <field>
              <name>RF0N</name>
              <description> bitfield RF0N </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IE" -->
        <register>
          <name>IE</name>
          <description> register IE </description>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "STEE" -->
            <field>
              <name>STEE</name>
              <description> bitfield STEE </description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FOEE" -->
            <field>
              <name>FOEE</name>
              <description> bitfield FOEE </description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ACKEE" -->
            <field>
              <name>ACKEE</name>
              <description> bitfield ACKEE </description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BEE" -->
            <field>
              <name>BEE</name>
              <description> bitfield BEE </description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CRCEE" -->
            <field>
              <name>CRCEE</name>
              <description> bitfield CRCEE </description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WDIE" -->
            <field>
              <name>WDIE</name>
              <description> bitfield WDIE </description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BOE" -->
            <field>
              <name>BOE</name>
              <description> bitfield BOE </description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EWE" -->
            <field>
              <name>EWE</name>
              <description> bitfield EWE </description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EPE" -->
            <field>
              <name>EPE</name>
              <description> bitfield EPE </description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ELOE" -->
            <field>
              <name>ELOE</name>
              <description> bitfield ELOE </description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BEUE" -->
            <field>
              <name>BEUE</name>
              <description> bitfield BEUE </description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BECE" -->
            <field>
              <name>BECE</name>
              <description> bitfield BECE </description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DRXE" -->
            <field>
              <name>DRXE</name>
              <description> bitfield DRXE </description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TOOE" -->
            <field>
              <name>TOOE</name>
              <description> bitfield TOOE </description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MRAFE" -->
            <field>
              <name>MRAFE</name>
              <description> bitfield MRAFE </description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TSWE" -->
            <field>
              <name>TSWE</name>
              <description> bitfield TSWE </description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TEFLE" -->
            <field>
              <name>TEFLE</name>
              <description> bitfield TEFLE </description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TEFFE" -->
            <field>
              <name>TEFFE</name>
              <description> bitfield TEFFE </description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TEFWE" -->
            <field>
              <name>TEFWE</name>
              <description> bitfield TEFWE </description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TEFNE" -->
            <field>
              <name>TEFNE</name>
              <description> bitfield TEFNE </description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TFEE" -->
            <field>
              <name>TFEE</name>
              <description> bitfield TFEE </description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TCFE" -->
            <field>
              <name>TCFE</name>
              <description> bitfield TCFE </description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TCE" -->
            <field>
              <name>TCE</name>
              <description> bitfield TCE </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "HPME" -->
            <field>
              <name>HPME</name>
              <description> bitfield HPME </description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RF1LE" -->
            <field>
              <name>RF1LE</name>
              <description> bitfield RF1LE </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RF1FE" -->
            <field>
              <name>RF1FE</name>
              <description> bitfield RF1FE </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RF1WE" -->
            <field>
              <name>RF1WE</name>
              <description> bitfield RF1WE </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RF1NE" -->
            <field>
              <name>RF1NE</name>
              <description> bitfield RF1NE </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RF0LE" -->
            <field>
              <name>RF0LE</name>
              <description> bitfield RF0LE </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RF0FE" -->
            <field>
              <name>RF0FE</name>
              <description> bitfield RF0FE </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RF0WE" -->
            <field>
              <name>RF0WE</name>
              <description> bitfield RF0WE </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RF0NE" -->
            <field>
              <name>RF0NE</name>
              <description> bitfield RF0NE </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
