sol4ik/audio-steganography/try/fm4/s6e2cc_i2s_sk-fm4-176l-s6se2cc-v10/svd/S6E2CC.xml
        <!-- REGISTER "ILS" -->
        <register>
          <name>ILS</name>
          <description> register ILS </description>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "STEL" -->
            <field>
              <name>STEL</name>
              <description> bitfield STEL </description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FOEL" -->
            <field>
              <name>FOEL</name>
              <description> bitfield FOEL </description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ACKEL" -->
            <field>
              <name>ACKEL</name>
              <description> bitfield ACKEL </description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BEL" -->
            <field>
              <name>BEL</name>
              <description> bitfield BEL </description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CRCEL" -->
            <field>
              <name>CRCEL</name>
              <description> bitfield CRCEL </description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WDIL" -->
            <field>
              <name>WDIL</name>
              <description> bitfield WDIL </description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BOL" -->
            <field>
              <name>BOL</name>
              <description> bitfield BOL </description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EWL" -->
            <field>
              <name>EWL</name>
              <description> bitfield EWL </description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EPL" -->
            <field>
              <name>EPL</name>
              <description> bitfield EPL </description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ELOL" -->
            <field>
              <name>ELOL</name>
              <description> bitfield ELOL </description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BEUL" -->
            <field>
              <name>BEUL</name>
              <description> bitfield BEUL </description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BECL" -->
            <field>
              <name>BECL</name>
              <description> bitfield BECL </description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DRXL" -->
            <field>
              <name>DRXL</name>
              <description> bitfield DRXL </description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TOOL" -->
            <field>
              <name>TOOL</name>
              <description> bitfield TOOL </description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MRAFL" -->
            <field>
              <name>MRAFL</name>
              <description> bitfield MRAFL </description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TSWL" -->
            <field>
              <name>TSWL</name>
              <description> bitfield TSWL </description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TEFLL" -->
            <field>
              <name>TEFLL</name>
              <description> bitfield TEFLL </description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TEFFL" -->
            <field>
              <name>TEFFL</name>
              <description> bitfield TEFFL </description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TEFWL" -->
            <field>
              <name>TEFWL</name>
              <description> bitfield TEFWL </description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TEFNL" -->
            <field>
              <name>TEFNL</name>
              <description> bitfield TEFNL </description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TFEL" -->
            <field>
              <name>TFEL</name>
              <description> bitfield TFEL </description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TCFL" -->
            <field>
              <name>TCFL</name>
              <description> bitfield TCFL </description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TCL" -->
            <field>
              <name>TCL</name>
              <description> bitfield TCL </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "HPML" -->
            <field>
              <name>HPML</name>
              <description> bitfield HPML </description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RF1LL" -->
            <field>
              <name>RF1LL</name>
              <description> bitfield RF1LL </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RF1FL" -->
            <field>
              <name>RF1FL</name>
              <description> bitfield RF1FL </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RF1WL" -->
            <field>
              <name>RF1WL</name>
              <description> bitfield RF1WL </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RF1NL" -->
            <field>
              <name>RF1NL</name>
              <description> bitfield RF1NL </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RF0LL" -->
            <field>
              <name>RF0LL</name>
              <description> bitfield RF0LL </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RF0FL" -->
            <field>
              <name>RF0FL</name>
              <description> bitfield RF0FL </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RF0WL" -->
            <field>
              <name>RF0WL</name>
              <description> bitfield RF0WL </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RF0NL" -->
            <field>
              <name>RF0NL</name>
              <description> bitfield RF0NL </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ILE" -->
        <register>
          <name>ILE</name>
          <description> register ILE </description>
          <addressOffset>0x5C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000003</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EINT1" -->
            <field>
              <name>EINT1</name>
              <description> bitfield EINT1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EINT0" -->
            <field>
              <name>EINT0</name>
              <description> bitfield EINT0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
