sol4ik/audio-steganography/try/fm4/s6e2cc_i2s_sk-fm4-176l-s6se2cc-v10/svd/S6E2CC.xml
        <!-- REGISTER "GFC" -->
        <register>
          <name>GFC</name>
          <description> register GFC </description>
          <addressOffset>0x80</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000003F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ANFS" -->
            <field>
              <name>ANFS</name>
              <description> bitfield ANFS </description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ANFE" -->
            <field>
              <name>ANFE</name>
              <description> bitfield ANFE </description>
              <lsb>2</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RRFS" -->
            <field>
              <name>RRFS</name>
              <description> bitfield RRFS </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RRFE" -->
            <field>
              <name>RRFE</name>
              <description> bitfield RRFE </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "SIDFC" -->
        <register>
          <name>SIDFC</name>
          <description> register SIDFC </description>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFC</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LSS" -->
            <field>
              <name>LSS</name>
              <description> bitfield LSS </description>
              <lsb>16</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FLSSA" -->
            <field>
              <name>FLSSA</name>
              <description> bitfield FLSSA </description>
              <lsb>2</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "XIDFC" -->
        <register>
          <name>XIDFC</name>
          <description> register XIDFC </description>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x007FFFFC</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LSE" -->
            <field>
              <name>LSE</name>
              <description> bitfield LSE </description>
              <lsb>16</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FLESA" -->
            <field>
              <name>FLESA</name>
              <description> bitfield FLESA </description>
              <lsb>2</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "XIDAM" -->
        <register>
          <name>XIDAM</name>
          <description> register XIDAM </description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x1FFFFFFF</resetValue>
          <resetMask>0x1FFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EIDM" -->
            <field>
              <name>EIDM</name>
              <description> bitfield EIDM </description>
              <lsb>0</lsb>
              <msb>28</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "HPMS" -->
        <register>
          <name>HPMS</name>
          <description> register HPMS </description>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "FLST" -->
            <field>
              <name>FLST</name>
              <description> bitfield FLST </description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "FIDX" -->
            <field>
              <name>FIDX</name>
              <description> bitfield FIDX </description>
              <lsb>8</lsb>
              <msb>14</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MSI" -->
            <field>
              <name>MSI</name>
              <description> bitfield MSI </description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "BIDX" -->
            <field>
              <name>BIDX</name>
              <description> bitfield BIDX </description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "NDAT1" -->
        <register>
          <name>NDAT1</name>
          <description> register NDAT1 </description>
          <addressOffset>0x98</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ND31" -->
            <field>
              <name>ND31</name>
              <description> bitfield ND31 </description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND30" -->
            <field>
              <name>ND30</name>
              <description> bitfield ND30 </description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND29" -->
            <field>
              <name>ND29</name>
              <description> bitfield ND29 </description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND28" -->
            <field>
              <name>ND28</name>
              <description> bitfield ND28 </description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND27" -->
            <field>
              <name>ND27</name>
              <description> bitfield ND27 </description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND26" -->
            <field>
              <name>ND26</name>
              <description> bitfield ND26 </description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND25" -->
            <field>
              <name>ND25</name>
              <description> bitfield ND25 </description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND24" -->
            <field>
              <name>ND24</name>
              <description> bitfield ND24 </description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND23" -->
            <field>
              <name>ND23</name>
              <description> bitfield ND23 </description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND22" -->
            <field>
              <name>ND22</name>
              <description> bitfield ND22 </description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND21" -->
            <field>
              <name>ND21</name>
              <description> bitfield ND21 </description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND20" -->
            <field>
              <name>ND20</name>
              <description> bitfield ND20 </description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND19" -->
            <field>
              <name>ND19</name>
              <description> bitfield ND19 </description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND18" -->
            <field>
              <name>ND18</name>
              <description> bitfield ND18 </description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND17" -->
            <field>
              <name>ND17</name>
              <description> bitfield ND17 </description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND16" -->
            <field>
              <name>ND16</name>
              <description> bitfield ND16 </description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND15" -->
            <field>
              <name>ND15</name>
              <description> bitfield ND15 </description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND14" -->
            <field>
              <name>ND14</name>
              <description> bitfield ND14 </description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND13" -->
            <field>
              <name>ND13</name>
              <description> bitfield ND13 </description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND12" -->
            <field>
              <name>ND12</name>
              <description> bitfield ND12 </description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND11" -->
            <field>
              <name>ND11</name>
              <description> bitfield ND11 </description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND10" -->
            <field>
              <name>ND10</name>
              <description> bitfield ND10 </description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND9" -->
            <field>
              <name>ND9</name>
              <description> bitfield ND9 </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND8" -->
            <field>
              <name>ND8</name>
              <description> bitfield ND8 </description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND7" -->
            <field>
              <name>ND7</name>
              <description> bitfield ND7 </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND6" -->
            <field>
              <name>ND6</name>
              <description> bitfield ND6 </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND5" -->
            <field>
              <name>ND5</name>
              <description> bitfield ND5 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND4" -->
            <field>
              <name>ND4</name>
              <description> bitfield ND4 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND3" -->
            <field>
              <name>ND3</name>
              <description> bitfield ND3 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND2" -->
            <field>
              <name>ND2</name>
              <description> bitfield ND2 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND1" -->
            <field>
              <name>ND1</name>
              <description> bitfield ND1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND0" -->
            <field>
              <name>ND0</name>
              <description> bitfield ND0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "NDAT2" -->
        <register>
          <name>NDAT2</name>
          <description> register NDAT2 </description>
          <addressOffset>0x9C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ND63" -->
            <field>
              <name>ND63</name>
              <description> bitfield ND63 </description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND62" -->
            <field>
              <name>ND62</name>
              <description> bitfield ND62 </description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND61" -->
            <field>
              <name>ND61</name>
              <description> bitfield ND61 </description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND60" -->
            <field>
              <name>ND60</name>
              <description> bitfield ND60 </description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND59" -->
            <field>
              <name>ND59</name>
              <description> bitfield ND59 </description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND58" -->
            <field>
              <name>ND58</name>
              <description> bitfield ND58 </description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND57" -->
            <field>
              <name>ND57</name>
              <description> bitfield ND57 </description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND56" -->
            <field>
              <name>ND56</name>
              <description> bitfield ND56 </description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND55" -->
            <field>
              <name>ND55</name>
              <description> bitfield ND55 </description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND54" -->
            <field>
              <name>ND54</name>
              <description> bitfield ND54 </description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND53" -->
            <field>
              <name>ND53</name>
              <description> bitfield ND53 </description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND52" -->
            <field>
              <name>ND52</name>
              <description> bitfield ND52 </description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND51" -->
            <field>
              <name>ND51</name>
              <description> bitfield ND51 </description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND50" -->
            <field>
              <name>ND50</name>
              <description> bitfield ND50 </description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND49" -->
            <field>
              <name>ND49</name>
              <description> bitfield ND49 </description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND48" -->
            <field>
              <name>ND48</name>
              <description> bitfield ND48 </description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND47" -->
            <field>
              <name>ND47</name>
              <description> bitfield ND47 </description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND46" -->
            <field>
              <name>ND46</name>
              <description> bitfield ND46 </description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND45" -->
            <field>
              <name>ND45</name>
              <description> bitfield ND45 </description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND44" -->
            <field>
              <name>ND44</name>
              <description> bitfield ND44 </description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND43" -->
            <field>
              <name>ND43</name>
              <description> bitfield ND43 </description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND42" -->
            <field>
              <name>ND42</name>
              <description> bitfield ND42 </description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND41" -->
            <field>
              <name>ND41</name>
              <description> bitfield ND41 </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND40" -->
            <field>
              <name>ND40</name>
              <description> bitfield ND40 </description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND39" -->
            <field>
              <name>ND39</name>
              <description> bitfield ND39 </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND38" -->
            <field>
              <name>ND38</name>
              <description> bitfield ND38 </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND37" -->
            <field>
              <name>ND37</name>
              <description> bitfield ND37 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND36" -->
            <field>
              <name>ND36</name>
              <description> bitfield ND36 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND35" -->
            <field>
              <name>ND35</name>
              <description> bitfield ND35 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND34" -->
            <field>
              <name>ND34</name>
              <description> bitfield ND34 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND33" -->
            <field>
              <name>ND33</name>
              <description> bitfield ND33 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ND32" -->
            <field>
              <name>ND32</name>
              <description> bitfield ND32 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
