sol4ik/audio-steganography/try/fm4/s6e2cc_i2s_sk-fm4-176l-s6se2cc-v10/svd/S6E2CC.xml
        <!-- REGISTER "RXF0C" -->
        <register>
          <name>RXF0C</name>
          <description> register RXF0C </description>
          <addressOffset>0xA0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFF7FFFFC</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "F0OM" -->
            <field>
              <name>F0OM</name>
              <description> bitfield F0OM </description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "F0WM" -->
            <field>
              <name>F0WM</name>
              <description> bitfield F0WM </description>
              <lsb>24</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "F0S" -->
            <field>
              <name>F0S</name>
              <description> bitfield F0S </description>
              <lsb>16</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "F0SA" -->
            <field>
              <name>F0SA</name>
              <description> bitfield F0SA </description>
              <lsb>2</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RXF0S" -->
        <register>
          <name>RXF0S</name>
          <description> register RXF0S </description>
          <addressOffset>0xA4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x033F3F7F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RF0L" -->
            <field>
              <name>RF0L</name>
              <description> bitfield RF0L </description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "F0F" -->
            <field>
              <name>F0F</name>
              <description> bitfield F0F </description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "F0PI" -->
            <field>
              <name>F0PI</name>
              <description> bitfield F0PI </description>
              <lsb>16</lsb>
              <msb>21</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "F0GI" -->
            <field>
              <name>F0GI</name>
              <description> bitfield F0GI </description>
              <lsb>8</lsb>
              <msb>13</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "F0FL" -->
            <field>
              <name>F0FL</name>
              <description> bitfield F0FL </description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RXF0A" -->
        <register>
          <name>RXF0A</name>
          <description> register RXF0A </description>
          <addressOffset>0xA8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000003F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "F0AI" -->
            <field>
              <name>F0AI</name>
              <description> bitfield F0AI </description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RXBC" -->
        <register>
          <name>RXBC</name>
          <description> register RXBC </description>
          <addressOffset>0xAC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFC</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RBSA" -->
            <field>
              <name>RBSA</name>
              <description> bitfield RBSA </description>
              <lsb>2</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RXF1C" -->
        <register>
          <name>RXF1C</name>
          <description> register RXF1C </description>
          <addressOffset>0xB0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFF7FFFFC</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "F1OM" -->
            <field>
              <name>F1OM</name>
              <description> bitfield F1OM </description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "F1WM" -->
            <field>
              <name>F1WM</name>
              <description> bitfield F1WM </description>
              <lsb>24</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "F1S" -->
            <field>
              <name>F1S</name>
              <description> bitfield F1S </description>
              <lsb>16</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "F1SA" -->
            <field>
              <name>F1SA</name>
              <description> bitfield F1SA </description>
              <lsb>2</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RXF1S" -->
        <register>
          <name>RXF1S</name>
          <description> register RXF1S </description>
          <addressOffset>0xB4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x033F3F7F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RF1L" -->
            <field>
              <name>RF1L</name>
              <description> bitfield RF1L </description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "F1F" -->
            <field>
              <name>F1F</name>
              <description> bitfield F1F </description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "F1PI" -->
            <field>
              <name>F1PI</name>
              <description> bitfield F1PI </description>
              <lsb>16</lsb>
              <msb>21</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "F1GI" -->
            <field>
              <name>F1GI</name>
              <description> bitfield F1GI </description>
              <lsb>8</lsb>
              <msb>13</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "F1FL" -->
            <field>
              <name>F1FL</name>
              <description> bitfield F1FL </description>
              <lsb>0</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RXF1A" -->
        <register>
          <name>RXF1A</name>
          <description> register RXF1A </description>
          <addressOffset>0xB8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000003F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "F1AI" -->
            <field>
              <name>F1AI</name>
              <description> bitfield F1AI </description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RXESC" -->
        <register>
          <name>RXESC</name>
          <description> register RXESC </description>
          <addressOffset>0xBC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000777</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RBDS" -->
            <field>
              <name>RBDS</name>
              <description> bitfield RBDS </description>
              <lsb>8</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "F1DS" -->
            <field>
              <name>F1DS</name>
              <description> bitfield F1DS </description>
              <lsb>4</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "F0DS" -->
            <field>
              <name>F0DS</name>
              <description> bitfield F0DS </description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
