sol4ik/audio-steganography/try/fm4/s6e2cc_i2s_sk-fm4-176l-s6se2cc-v10/svd/S6E2CC.xml
        <!-- REGISTER "TXBC" -->
        <register>
          <name>TXBC</name>
          <description> register TXBC </description>
          <addressOffset>0xC0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7F3FFFFC</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TFQM" -->
            <field>
              <name>TFQM</name>
              <description> bitfield TFQM </description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TFQS" -->
            <field>
              <name>TFQS</name>
              <description> bitfield TFQS </description>
              <lsb>24</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "NDTB" -->
            <field>
              <name>NDTB</name>
              <description> bitfield NDTB </description>
              <lsb>16</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TBSA" -->
            <field>
              <name>TBSA</name>
              <description> bitfield TBSA </description>
              <lsb>2</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TXFQS" -->
        <register>
          <name>TXFQS</name>
          <description> register TXFQS </description>
          <addressOffset>0xC4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x003F1F3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TFQF" -->
            <field>
              <name>TFQF</name>
              <description> bitfield TFQF </description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TFQPI" -->
            <field>
              <name>TFQPI</name>
              <description> bitfield TFQPI </description>
              <lsb>16</lsb>
              <msb>20</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TFGI" -->
            <field>
              <name>TFGI</name>
              <description> bitfield TFGI </description>
              <lsb>8</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TFFL" -->
            <field>
              <name>TFFL</name>
              <description> bitfield TFFL </description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TXESC" -->
        <register>
          <name>TXESC</name>
          <description> register TXESC </description>
          <addressOffset>0xC8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000007</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TBDS" -->
            <field>
              <name>TBDS</name>
              <description> bitfield TBDS </description>
              <lsb>0</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TXBRP" -->
        <register>
          <name>TXBRP</name>
          <description> register TXBRP </description>
          <addressOffset>0xCC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TRP31" -->
            <field>
              <name>TRP31</name>
              <description> bitfield TRP31 </description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TRP30" -->
            <field>
              <name>TRP30</name>
              <description> bitfield TRP30 </description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TRP29" -->
            <field>
              <name>TRP29</name>
              <description> bitfield TRP29 </description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TRP28" -->
            <field>
              <name>TRP28</name>
              <description> bitfield TRP28 </description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TRP27" -->
            <field>
              <name>TRP27</name>
              <description> bitfield TRP27 </description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TRP26" -->
            <field>
              <name>TRP26</name>
              <description> bitfield TRP26 </description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TRP25" -->
            <field>
              <name>TRP25</name>
              <description> bitfield TRP25 </description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TRP24" -->
            <field>
              <name>TRP24</name>
              <description> bitfield TRP24 </description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TRP23" -->
            <field>
              <name>TRP23</name>
              <description> bitfield TRP23 </description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TRP22" -->
            <field>
              <name>TRP22</name>
              <description> bitfield TRP22 </description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TRP21" -->
            <field>
              <name>TRP21</name>
              <description> bitfield TRP21 </description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TRP20" -->
            <field>
              <name>TRP20</name>
              <description> bitfield TRP20 </description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TRP19" -->
            <field>
              <name>TRP19</name>
              <description> bitfield TRP19 </description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TRP18" -->
            <field>
              <name>TRP18</name>
              <description> bitfield TRP18 </description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TRP17" -->
            <field>
              <name>TRP17</name>
              <description> bitfield TRP17 </description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TRP16" -->
            <field>
              <name>TRP16</name>
              <description> bitfield TRP16 </description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TRP15" -->
            <field>
              <name>TRP15</name>
              <description> bitfield TRP15 </description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TRP14" -->
            <field>
              <name>TRP14</name>
              <description> bitfield TRP14 </description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TRP13" -->
            <field>
              <name>TRP13</name>
              <description> bitfield TRP13 </description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TRP12" -->
            <field>
              <name>TRP12</name>
              <description> bitfield TRP12 </description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TRP11" -->
            <field>
              <name>TRP11</name>
              <description> bitfield TRP11 </description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TRP10" -->
            <field>
              <name>TRP10</name>
              <description> bitfield TRP10 </description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TRP9" -->
            <field>
              <name>TRP9</name>
              <description> bitfield TRP9 </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TRP8" -->
            <field>
              <name>TRP8</name>
              <description> bitfield TRP8 </description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TRP7" -->
            <field>
              <name>TRP7</name>
              <description> bitfield TRP7 </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TRP6" -->
            <field>
              <name>TRP6</name>
              <description> bitfield TRP6 </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TRP5" -->
            <field>
              <name>TRP5</name>
              <description> bitfield TRP5 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TRP4" -->
            <field>
              <name>TRP4</name>
              <description> bitfield TRP4 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TRP3" -->
            <field>
              <name>TRP3</name>
              <description> bitfield TRP3 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TRP2" -->
            <field>
              <name>TRP2</name>
              <description> bitfield TRP2 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TRP1" -->
            <field>
              <name>TRP1</name>
              <description> bitfield TRP1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TRP0" -->
            <field>
              <name>TRP0</name>
              <description> bitfield TRP0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TXBAR" -->
        <register>
          <name>TXBAR</name>
          <description> register TXBAR </description>
          <addressOffset>0xD0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "AR31" -->
            <field>
              <name>AR31</name>
              <description> bitfield AR31 </description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AR30" -->
            <field>
              <name>AR30</name>
              <description> bitfield AR30 </description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AR29" -->
            <field>
              <name>AR29</name>
              <description> bitfield AR29 </description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AR28" -->
            <field>
              <name>AR28</name>
              <description> bitfield AR28 </description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AR27" -->
            <field>
              <name>AR27</name>
              <description> bitfield AR27 </description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AR26" -->
            <field>
              <name>AR26</name>
              <description> bitfield AR26 </description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AR25" -->
            <field>
              <name>AR25</name>
              <description> bitfield AR25 </description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AR24" -->
            <field>
              <name>AR24</name>
              <description> bitfield AR24 </description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AR23" -->
            <field>
              <name>AR23</name>
              <description> bitfield AR23 </description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AR22" -->
            <field>
              <name>AR22</name>
              <description> bitfield AR22 </description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AR21" -->
            <field>
              <name>AR21</name>
              <description> bitfield AR21 </description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AR20" -->
            <field>
              <name>AR20</name>
              <description> bitfield AR20 </description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AR19" -->
            <field>
              <name>AR19</name>
              <description> bitfield AR19 </description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AR18" -->
            <field>
              <name>AR18</name>
              <description> bitfield AR18 </description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AR17" -->
            <field>
              <name>AR17</name>
              <description> bitfield AR17 </description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AR16" -->
            <field>
              <name>AR16</name>
              <description> bitfield AR16 </description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AR15" -->
            <field>
              <name>AR15</name>
              <description> bitfield AR15 </description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AR14" -->
            <field>
              <name>AR14</name>
              <description> bitfield AR14 </description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AR13" -->
            <field>
              <name>AR13</name>
              <description> bitfield AR13 </description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AR12" -->
            <field>
              <name>AR12</name>
              <description> bitfield AR12 </description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AR11" -->
            <field>
              <name>AR11</name>
              <description> bitfield AR11 </description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AR10" -->
            <field>
              <name>AR10</name>
              <description> bitfield AR10 </description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AR9" -->
            <field>
              <name>AR9</name>
              <description> bitfield AR9 </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AR8" -->
            <field>
              <name>AR8</name>
              <description> bitfield AR8 </description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AR7" -->
            <field>
              <name>AR7</name>
              <description> bitfield AR7 </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AR6" -->
            <field>
              <name>AR6</name>
              <description> bitfield AR6 </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AR5" -->
            <field>
              <name>AR5</name>
              <description> bitfield AR5 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AR4" -->
            <field>
              <name>AR4</name>
              <description> bitfield AR4 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AR3" -->
            <field>
              <name>AR3</name>
              <description> bitfield AR3 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AR2" -->
            <field>
              <name>AR2</name>
              <description> bitfield AR2 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AR1" -->
            <field>
              <name>AR1</name>
              <description> bitfield AR1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AR0" -->
            <field>
              <name>AR0</name>
              <description> bitfield AR0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
