sol4ik/audio-steganography/try/fm4/s6e2cc_i2s_sk-fm4-176l-s6se2cc-v10/svd/S6E2CC.xml
        <!-- REGISTER "TXBCR" -->
        <register>
          <name>TXBCR</name>
          <description> register TXBCR </description>
          <addressOffset>0xD4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CR31" -->
            <field>
              <name>CR31</name>
              <description> bitfield CR31 </description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CR30" -->
            <field>
              <name>CR30</name>
              <description> bitfield CR30 </description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CR29" -->
            <field>
              <name>CR29</name>
              <description> bitfield CR29 </description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CR28" -->
            <field>
              <name>CR28</name>
              <description> bitfield CR28 </description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CR27" -->
            <field>
              <name>CR27</name>
              <description> bitfield CR27 </description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CR26" -->
            <field>
              <name>CR26</name>
              <description> bitfield CR26 </description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CR25" -->
            <field>
              <name>CR25</name>
              <description> bitfield CR25 </description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CR24" -->
            <field>
              <name>CR24</name>
              <description> bitfield CR24 </description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CR23" -->
            <field>
              <name>CR23</name>
              <description> bitfield CR23 </description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CR22" -->
            <field>
              <name>CR22</name>
              <description> bitfield CR22 </description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CR21" -->
            <field>
              <name>CR21</name>
              <description> bitfield CR21 </description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CR20" -->
            <field>
              <name>CR20</name>
              <description> bitfield CR20 </description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CR19" -->
            <field>
              <name>CR19</name>
              <description> bitfield CR19 </description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CR18" -->
            <field>
              <name>CR18</name>
              <description> bitfield CR18 </description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CR17" -->
            <field>
              <name>CR17</name>
              <description> bitfield CR17 </description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CR16" -->
            <field>
              <name>CR16</name>
              <description> bitfield CR16 </description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CR15" -->
            <field>
              <name>CR15</name>
              <description> bitfield CR15 </description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CR14" -->
            <field>
              <name>CR14</name>
              <description> bitfield CR14 </description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CR13" -->
            <field>
              <name>CR13</name>
              <description> bitfield CR13 </description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CR12" -->
            <field>
              <name>CR12</name>
              <description> bitfield CR12 </description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CR11" -->
            <field>
              <name>CR11</name>
              <description> bitfield CR11 </description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CR10" -->
            <field>
              <name>CR10</name>
              <description> bitfield CR10 </description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CR9" -->
            <field>
              <name>CR9</name>
              <description> bitfield CR9 </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CR8" -->
            <field>
              <name>CR8</name>
              <description> bitfield CR8 </description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CR7" -->
            <field>
              <name>CR7</name>
              <description> bitfield CR7 </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CR6" -->
            <field>
              <name>CR6</name>
              <description> bitfield CR6 </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CR5" -->
            <field>
              <name>CR5</name>
              <description> bitfield CR5 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CR4" -->
            <field>
              <name>CR4</name>
              <description> bitfield CR4 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CR3" -->
            <field>
              <name>CR3</name>
              <description> bitfield CR3 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CR2" -->
            <field>
              <name>CR2</name>
              <description> bitfield CR2 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CR1" -->
            <field>
              <name>CR1</name>
              <description> bitfield CR1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CR0" -->
            <field>
              <name>CR0</name>
              <description> bitfield CR0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TXBTO" -->
        <register>
          <name>TXBTO</name>
          <description> register TXBTO </description>
          <addressOffset>0xD8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TO31" -->
            <field>
              <name>TO31</name>
              <description> bitfield TO31 </description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TO30" -->
            <field>
              <name>TO30</name>
              <description> bitfield TO30 </description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TO29" -->
            <field>
              <name>TO29</name>
              <description> bitfield TO29 </description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TO28" -->
            <field>
              <name>TO28</name>
              <description> bitfield TO28 </description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TO27" -->
            <field>
              <name>TO27</name>
              <description> bitfield TO27 </description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TO26" -->
            <field>
              <name>TO26</name>
              <description> bitfield TO26 </description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TO25" -->
            <field>
              <name>TO25</name>
              <description> bitfield TO25 </description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TO24" -->
            <field>
              <name>TO24</name>
              <description> bitfield TO24 </description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TO23" -->
            <field>
              <name>TO23</name>
              <description> bitfield TO23 </description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TO22" -->
            <field>
              <name>TO22</name>
              <description> bitfield TO22 </description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TO21" -->
            <field>
              <name>TO21</name>
              <description> bitfield TO21 </description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TO20" -->
            <field>
              <name>TO20</name>
              <description> bitfield TO20 </description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TO19" -->
            <field>
              <name>TO19</name>
              <description> bitfield TO19 </description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TO18" -->
            <field>
              <name>TO18</name>
              <description> bitfield TO18 </description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TO17" -->
            <field>
              <name>TO17</name>
              <description> bitfield TO17 </description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TO16" -->
            <field>
              <name>TO16</name>
              <description> bitfield TO16 </description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TO15" -->
            <field>
              <name>TO15</name>
              <description> bitfield TO15 </description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TO14" -->
            <field>
              <name>TO14</name>
              <description> bitfield TO14 </description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TO13" -->
            <field>
              <name>TO13</name>
              <description> bitfield TO13 </description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TO12" -->
            <field>
              <name>TO12</name>
              <description> bitfield TO12 </description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TO11" -->
            <field>
              <name>TO11</name>
              <description> bitfield TO11 </description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TO10" -->
            <field>
              <name>TO10</name>
              <description> bitfield TO10 </description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TO9" -->
            <field>
              <name>TO9</name>
              <description> bitfield TO9 </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TO8" -->
            <field>
              <name>TO8</name>
              <description> bitfield TO8 </description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TO7" -->
            <field>
              <name>TO7</name>
              <description> bitfield TO7 </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TO6" -->
            <field>
              <name>TO6</name>
              <description> bitfield TO6 </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TO5" -->
            <field>
              <name>TO5</name>
              <description> bitfield TO5 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TO4" -->
            <field>
              <name>TO4</name>
              <description> bitfield TO4 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TO3" -->
            <field>
              <name>TO3</name>
              <description> bitfield TO3 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TO2" -->
            <field>
              <name>TO2</name>
              <description> bitfield TO2 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TO1" -->
            <field>
              <name>TO1</name>
              <description> bitfield TO1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TO0" -->
            <field>
              <name>TO0</name>
              <description> bitfield TO0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
