sol4ik/audio-steganography/try/fm4/s6e2cc_i2s_sk-fm4-176l-s6se2cc-v10/svd/S6E2CC.xml
        <!-- REGISTER "TXBCF" -->
        <register>
          <name>TXBCF</name>
          <description> register TXBCF </description>
          <addressOffset>0xDC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CF31" -->
            <field>
              <name>CF31</name>
              <description> bitfield CF31 </description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CF30" -->
            <field>
              <name>CF30</name>
              <description> bitfield CF30 </description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CF29" -->
            <field>
              <name>CF29</name>
              <description> bitfield CF29 </description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CF28" -->
            <field>
              <name>CF28</name>
              <description> bitfield CF28 </description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CF27" -->
            <field>
              <name>CF27</name>
              <description> bitfield CF27 </description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CF26" -->
            <field>
              <name>CF26</name>
              <description> bitfield CF26 </description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CF25" -->
            <field>
              <name>CF25</name>
              <description> bitfield CF25 </description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CF24" -->
            <field>
              <name>CF24</name>
              <description> bitfield CF24 </description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CF23" -->
            <field>
              <name>CF23</name>
              <description> bitfield CF23 </description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CF22" -->
            <field>
              <name>CF22</name>
              <description> bitfield CF22 </description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CF21" -->
            <field>
              <name>CF21</name>
              <description> bitfield CF21 </description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CF20" -->
            <field>
              <name>CF20</name>
              <description> bitfield CF20 </description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CF19" -->
            <field>
              <name>CF19</name>
              <description> bitfield CF19 </description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CF18" -->
            <field>
              <name>CF18</name>
              <description> bitfield CF18 </description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CF17" -->
            <field>
              <name>CF17</name>
              <description> bitfield CF17 </description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CF16" -->
            <field>
              <name>CF16</name>
              <description> bitfield CF16 </description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CF15" -->
            <field>
              <name>CF15</name>
              <description> bitfield CF15 </description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CF14" -->
            <field>
              <name>CF14</name>
              <description> bitfield CF14 </description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CF13" -->
            <field>
              <name>CF13</name>
              <description> bitfield CF13 </description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CF12" -->
            <field>
              <name>CF12</name>
              <description> bitfield CF12 </description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CF11" -->
            <field>
              <name>CF11</name>
              <description> bitfield CF11 </description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CF10" -->
            <field>
              <name>CF10</name>
              <description> bitfield CF10 </description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CF9" -->
            <field>
              <name>CF9</name>
              <description> bitfield CF9 </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CF8" -->
            <field>
              <name>CF8</name>
              <description> bitfield CF8 </description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CF7" -->
            <field>
              <name>CF7</name>
              <description> bitfield CF7 </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CF6" -->
            <field>
              <name>CF6</name>
              <description> bitfield CF6 </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CF5" -->
            <field>
              <name>CF5</name>
              <description> bitfield CF5 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CF4" -->
            <field>
              <name>CF4</name>
              <description> bitfield CF4 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CF3" -->
            <field>
              <name>CF3</name>
              <description> bitfield CF3 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CF2" -->
            <field>
              <name>CF2</name>
              <description> bitfield CF2 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CF1" -->
            <field>
              <name>CF1</name>
              <description> bitfield CF1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CF0" -->
            <field>
              <name>CF0</name>
              <description> bitfield CF0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TXBTIE" -->
        <register>
          <name>TXBTIE</name>
          <description> register TXBTIE </description>
          <addressOffset>0xE0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TIE31" -->
            <field>
              <name>TIE31</name>
              <description> bitfield TIE31 </description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIE30" -->
            <field>
              <name>TIE30</name>
              <description> bitfield TIE30 </description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIE29" -->
            <field>
              <name>TIE29</name>
              <description> bitfield TIE29 </description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIE28" -->
            <field>
              <name>TIE28</name>
              <description> bitfield TIE28 </description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIE27" -->
            <field>
              <name>TIE27</name>
              <description> bitfield TIE27 </description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIE26" -->
            <field>
              <name>TIE26</name>
              <description> bitfield TIE26 </description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIE25" -->
            <field>
              <name>TIE25</name>
              <description> bitfield TIE25 </description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIE24" -->
            <field>
              <name>TIE24</name>
              <description> bitfield TIE24 </description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIE23" -->
            <field>
              <name>TIE23</name>
              <description> bitfield TIE23 </description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIE22" -->
            <field>
              <name>TIE22</name>
              <description> bitfield TIE22 </description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIE21" -->
            <field>
              <name>TIE21</name>
              <description> bitfield TIE21 </description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIE20" -->
            <field>
              <name>TIE20</name>
              <description> bitfield TIE20 </description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIE19" -->
            <field>
              <name>TIE19</name>
              <description> bitfield TIE19 </description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIE18" -->
            <field>
              <name>TIE18</name>
              <description> bitfield TIE18 </description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIE17" -->
            <field>
              <name>TIE17</name>
              <description> bitfield TIE17 </description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIE16" -->
            <field>
              <name>TIE16</name>
              <description> bitfield TIE16 </description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIE15" -->
            <field>
              <name>TIE15</name>
              <description> bitfield TIE15 </description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIE14" -->
            <field>
              <name>TIE14</name>
              <description> bitfield TIE14 </description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIE13" -->
            <field>
              <name>TIE13</name>
              <description> bitfield TIE13 </description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIE12" -->
            <field>
              <name>TIE12</name>
              <description> bitfield TIE12 </description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIE11" -->
            <field>
              <name>TIE11</name>
              <description> bitfield TIE11 </description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIE10" -->
            <field>
              <name>TIE10</name>
              <description> bitfield TIE10 </description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIE9" -->
            <field>
              <name>TIE9</name>
              <description> bitfield TIE9 </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIE8" -->
            <field>
              <name>TIE8</name>
              <description> bitfield TIE8 </description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIE7" -->
            <field>
              <name>TIE7</name>
              <description> bitfield TIE7 </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIE6" -->
            <field>
              <name>TIE6</name>
              <description> bitfield TIE6 </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIE5" -->
            <field>
              <name>TIE5</name>
              <description> bitfield TIE5 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIE4" -->
            <field>
              <name>TIE4</name>
              <description> bitfield TIE4 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIE3" -->
            <field>
              <name>TIE3</name>
              <description> bitfield TIE3 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIE2" -->
            <field>
              <name>TIE2</name>
              <description> bitfield TIE2 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIE1" -->
            <field>
              <name>TIE1</name>
              <description> bitfield TIE1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIE0" -->
            <field>
              <name>TIE0</name>
              <description> bitfield TIE0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
