sol4ik/audio-steganography/try/fm4/s6e2cc_i2s_sk-fm4-176l-s6se2cc-v10/svd/S6E2CC.xml
        <!-- REGISTER "TXBCIE" -->
        <register>
          <name>TXBCIE</name>
          <description> register TXBCIE </description>
          <addressOffset>0xE4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CFIE31" -->
            <field>
              <name>CFIE31</name>
              <description> bitfield CFIE31 </description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CFIE30" -->
            <field>
              <name>CFIE30</name>
              <description> bitfield CFIE30 </description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CFIE29" -->
            <field>
              <name>CFIE29</name>
              <description> bitfield CFIE29 </description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CFIE28" -->
            <field>
              <name>CFIE28</name>
              <description> bitfield CFIE28 </description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CFIE27" -->
            <field>
              <name>CFIE27</name>
              <description> bitfield CFIE27 </description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CFIE26" -->
            <field>
              <name>CFIE26</name>
              <description> bitfield CFIE26 </description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CFIE25" -->
            <field>
              <name>CFIE25</name>
              <description> bitfield CFIE25 </description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CFIE24" -->
            <field>
              <name>CFIE24</name>
              <description> bitfield CFIE24 </description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CFIE23" -->
            <field>
              <name>CFIE23</name>
              <description> bitfield CFIE23 </description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CFIE22" -->
            <field>
              <name>CFIE22</name>
              <description> bitfield CFIE22 </description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CFIE21" -->
            <field>
              <name>CFIE21</name>
              <description> bitfield CFIE21 </description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CFIE20" -->
            <field>
              <name>CFIE20</name>
              <description> bitfield CFIE20 </description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CFIE19" -->
            <field>
              <name>CFIE19</name>
              <description> bitfield CFIE19 </description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CFIE18" -->
            <field>
              <name>CFIE18</name>
              <description> bitfield CFIE18 </description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CFIE17" -->
            <field>
              <name>CFIE17</name>
              <description> bitfield CFIE17 </description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CFIE16" -->
            <field>
              <name>CFIE16</name>
              <description> bitfield CFIE16 </description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CFIE15" -->
            <field>
              <name>CFIE15</name>
              <description> bitfield CFIE15 </description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CFIE14" -->
            <field>
              <name>CFIE14</name>
              <description> bitfield CFIE14 </description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CFIE13" -->
            <field>
              <name>CFIE13</name>
              <description> bitfield CFIE13 </description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CFIE12" -->
            <field>
              <name>CFIE12</name>
              <description> bitfield CFIE12 </description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CFIE11" -->
            <field>
              <name>CFIE11</name>
              <description> bitfield CFIE11 </description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CFIE10" -->
            <field>
              <name>CFIE10</name>
              <description> bitfield CFIE10 </description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CFIE9" -->
            <field>
              <name>CFIE9</name>
              <description> bitfield CFIE9 </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CFIE8" -->
            <field>
              <name>CFIE8</name>
              <description> bitfield CFIE8 </description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CFIE7" -->
            <field>
              <name>CFIE7</name>
              <description> bitfield CFIE7 </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CFIE6" -->
            <field>
              <name>CFIE6</name>
              <description> bitfield CFIE6 </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CFIE5" -->
            <field>
              <name>CFIE5</name>
              <description> bitfield CFIE5 </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CFIE4" -->
            <field>
              <name>CFIE4</name>
              <description> bitfield CFIE4 </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CFIE3" -->
            <field>
              <name>CFIE3</name>
              <description> bitfield CFIE3 </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CFIE2" -->
            <field>
              <name>CFIE2</name>
              <description> bitfield CFIE2 </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CFIE1" -->
            <field>
              <name>CFIE1</name>
              <description> bitfield CFIE1 </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CFIE0" -->
            <field>
              <name>CFIE0</name>
              <description> bitfield CFIE0 </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
