sol4ik/audio-steganography/try/fm4/s6e2cc_i2s_sk-fm4-176l-s6se2cc-v10/svd/S6E2CC.xml
        <!-- REGISTER "TXEFC" -->
        <register>
          <name>TXEFC</name>
          <description> register TXEFC </description>
          <addressOffset>0xF0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3F3FFFFC</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EFWM" -->
            <field>
              <name>EFWM</name>
              <description> bitfield EFWM </description>
              <lsb>24</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EFS" -->
            <field>
              <name>EFS</name>
              <description> bitfield EFS </description>
              <lsb>16</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EFSA" -->
            <field>
              <name>EFSA</name>
              <description> bitfield EFSA </description>
              <lsb>2</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TXFS" -->
        <register>
          <name>TXFS</name>
          <description> register TXFS </description>
          <addressOffset>0xF4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x031F1F3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TEFL" -->
            <field>
              <name>TEFL</name>
              <description> bitfield TEFL </description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EFF" -->
            <field>
              <name>EFF</name>
              <description> bitfield EFF </description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EFPI" -->
            <field>
              <name>EFPI</name>
              <description> bitfield EFPI </description>
              <lsb>16</lsb>
              <msb>20</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EFGI" -->
            <field>
              <name>EFGI</name>
              <description> bitfield EFGI </description>
              <lsb>8</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EFFL" -->
            <field>
              <name>EFFL</name>
              <description> bitfield EFFL </description>
              <lsb>0</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TXFA" -->
        <register>
          <name>TXFA</name>
          <description> register TXFA </description>
          <addressOffset>0xF8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000001F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "EFAI" -->
            <field>
              <name>EFAI</name>
              <description> bitfield EFAI </description>
              <lsb>0</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FDECR" -->
        <register>
          <name>FDECR</name>
          <description> register FDECR </description>
          <addressOffset>0x200</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CEIV" -->
            <field>
              <name>CEIV</name>
              <description> bitfield CEIV </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CEREN" -->
            <field>
              <name>CEREN</name>
              <description> bitfield CEREN </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DEIE" -->
            <field>
              <name>DEIE</name>
              <description> bitfield DEIE </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SEIE" -->
            <field>
              <name>SEIE</name>
              <description> bitfield SEIE </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FDESR" -->
        <register>
          <name>FDESR</name>
          <description> register FDESR </description>
          <addressOffset>0x201</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DEI" -->
            <field>
              <name>DEI</name>
              <description> bitfield DEI </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "SEI" -->
            <field>
              <name>SEI</name>
              <description> bitfield SEI </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
