sol4ik/audio-steganography/try/fm4/s6e2cc_i2s_sk-fm4-176l-s6se2cc-v10/svd/S6E2CC.xml
        <!-- REGISTER "FDSEAR" -->
        <register>
          <name>FDSEAR</name>
          <description> register FDSEAR </description>
          <addressOffset>0x202</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SRA" -->
            <field>
              <name>SRA</name>
              <description> bitfield SRA </description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FDESCR" -->
        <register>
          <name>FDESCR</name>
          <description> register FDESCR </description>
          <addressOffset>0x205</addressOffset>
          <size>8</size>
          <access>read-only</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DEIC" -->
            <field>
              <name>DEIC</name>
              <description> bitfield DEIC </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "SEIC" -->
            <field>
              <name>SEIC</name>
              <description> bitfield SEIC </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FDDEAR" -->
        <register>
          <name>FDDEAR</name>
          <description> register FDDEAR </description>
          <addressOffset>0x206</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DRA" -->
            <field>
              <name>DRA</name>
              <description> bitfield DRA </description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TSCNTR" -->
        <register>
          <name>TSCNTR</name>
          <description> register TSCNTR </description>
          <addressOffset>0x210</addressOffset>
          <size>16</size>
          <access>write-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x0001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CCLR" -->
            <field>
              <name>CCLR</name>
              <description> bitfield CCLR </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TSMDR" -->
        <register>
          <name>TSMDR</name>
          <description> register TSMDR </description>
          <addressOffset>0x212</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0x0001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CNTEN" -->
            <field>
              <name>CNTEN</name>
              <description> bitfield CNTEN </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TSDIVR" -->
        <register>
          <name>TSDIVR</name>
          <description> register TSDIVR </description>
          <addressOffset>0x214</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CDIV" -->
            <field>
              <name>CDIV</name>
              <description> bitfield CDIV </description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TSCDTR" -->
        <register>
          <name>TSCDTR</name>
          <description> register TSCDTR </description>
          <addressOffset>0x218</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CNT" -->
            <field>
              <name>CNT</name>
              <description> bitfield CNT </description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TSCPCLR" -->
        <register>
          <name>TSCPCLR</name>
          <description> register TSCPCLR </description>
          <addressOffset>0x21A</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CMP" -->
            <field>
              <name>CMP</name>
              <description> bitfield CMP </description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "ETHERNET_MAC0" -->
    <peripheral>
      <name>ETHERNET_MAC0</name>
      <description> peripheral ETHERNET_MAC0 </description>
      <groupName>ETHERNET_MAC0</groupName>
      <baseAddress>0x40064000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x1058</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- INTERRUPT "ETHER0" -->
      <interrupt>
        <name>ETHER0</name>
        <value>82</value>
      </interrupt>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "MCR" -->
        <register>
          <name>MCR</name>
          <description> register MCR </description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x03FFFFFC</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "CST" -->
            <field>
              <name>CST</name>
              <description> bitfield CST </description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TC" -->
            <field>
              <name>TC</name>
              <description> bitfield TC </description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WD" -->
            <field>
              <name>WD</name>
              <description> bitfield WD </description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "JD" -->
            <field>
              <name>JD</name>
              <description> bitfield JD </description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BE" -->
            <field>
              <name>BE</name>
              <description> bitfield BE </description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "JE" -->
            <field>
              <name>JE</name>
              <description> bitfield JE </description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "IFG" -->
            <field>
              <name>IFG</name>
              <description> bitfield IFG </description>
              <lsb>17</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DCRS" -->
            <field>
              <name>DCRS</name>
              <description> bitfield DCRS </description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PS" -->
            <field>
              <name>PS</name>
              <description> bitfield PS </description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FES" -->
            <field>
              <name>FES</name>
              <description> bitfield FES </description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DO" -->
            <field>
              <name>DO</name>
              <description> bitfield DO </description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LM" -->
            <field>
              <name>LM</name>
              <description> bitfield LM </description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DM" -->
            <field>
              <name>DM</name>
              <description> bitfield DM </description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "IPC" -->
            <field>
              <name>IPC</name>
              <description> bitfield IPC </description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DR" -->
            <field>
              <name>DR</name>
              <description> bitfield DR </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LUD" -->
            <field>
              <name>LUD</name>
              <description> bitfield LUD </description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ACS" -->
            <field>
              <name>ACS</name>
              <description> bitfield ACS </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BL" -->
            <field>
              <name>BL</name>
              <description> bitfield BL </description>
              <lsb>5</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DC" -->
            <field>
              <name>DC</name>
              <description> bitfield DC </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TE" -->
            <field>
              <name>TE</name>
              <description> bitfield TE </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RE" -->
            <field>
              <name>RE</name>
              <description> bitfield RE </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "MFFR" -->
        <register>
          <name>MFFR</name>
          <description> register MFFR </description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x800007FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RA" -->
            <field>
              <name>RA</name>
              <description> bitfield RA </description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "HPF" -->
            <field>
              <name>HPF</name>
              <description> bitfield HPF </description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SAF" -->
            <field>
              <name>SAF</name>
              <description> bitfield SAF </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SAIF" -->
            <field>
              <name>SAIF</name>
              <description> bitfield SAIF </description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PCF" -->
            <field>
              <name>PCF</name>
              <description> bitfield PCF </description>
              <lsb>6</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DB" -->
            <field>
              <name>DB</name>
              <description> bitfield DB </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PM" -->
            <field>
              <name>PM</name>
              <description> bitfield PM </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DAIF" -->
            <field>
              <name>DAIF</name>
              <description> bitfield DAIF </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "HMC" -->
            <field>
              <name>HMC</name>
              <description> bitfield HMC </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "HUC" -->
            <field>
              <name>HUC</name>
              <description> bitfield HUC </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PR" -->
            <field>
              <name>PR</name>
              <description> bitfield PR </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
