sol4ik/audio-steganography/try/fm4/s6e2cc_i2s_sk-fm4-176l-s6se2cc-v10/svd/S6E2CC.xml
        <!-- REGISTER "MHTRH" -->
        <register>
          <name>MHTRH</name>
          <description> register MHTRH </description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "HTH" -->
            <field>
              <name>HTH</name>
              <description> bitfield HTH </description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "MHTRL" -->
        <register>
          <name>MHTRL</name>
          <description> register MHTRL </description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "HTL" -->
            <field>
              <name>HTL</name>
              <description> bitfield HTL </description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "GAR" -->
        <register>
          <name>GAR</name>
          <description> register GAR </description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PA" -->
            <field>
              <name>PA</name>
              <description> bitfield PA </description>
              <lsb>11</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "GR" -->
            <field>
              <name>GR</name>
              <description> bitfield GR </description>
              <lsb>6</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CR" -->
            <field>
              <name>CR</name>
              <description> bitfield CR </description>
              <lsb>2</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "GW" -->
            <field>
              <name>GW</name>
              <description> bitfield GW </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "GB" -->
            <field>
              <name>GB</name>
              <description> bitfield GB </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "GDR" -->
        <register>
          <name>GDR</name>
          <description> register GDR </description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "GD" -->
            <field>
              <name>GD</name>
              <description> bitfield GD </description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "FCR" -->
        <register>
          <name>FCR</name>
          <description> register FCR </description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFF00BF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PT" -->
            <field>
              <name>PT</name>
              <description> bitfield PT </description>
              <lsb>16</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DZPQ" -->
            <field>
              <name>DZPQ</name>
              <description> bitfield DZPQ </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PLT" -->
            <field>
              <name>PLT</name>
              <description> bitfield PLT </description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UP" -->
            <field>
              <name>UP</name>
              <description> bitfield UP </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RFE" -->
            <field>
              <name>RFE</name>
              <description> bitfield RFE </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TFE" -->
            <field>
              <name>TFE</name>
              <description> bitfield TFE </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FCB_BPA" -->
            <field>
              <name>FCB_BPA</name>
              <description> bitfield FCB_BPA </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
