sol4ik/audio-steganography/try/fm4/s6e2cc_i2s_sk-fm4-176l-s6se2cc-v10/svd/S6E2CC.xml
        <!-- REGISTER "VTR" -->
        <register>
          <name>VTR</name>
          <description> register VTR </description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0001FFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ETV" -->
            <field>
              <name>ETV</name>
              <description> bitfield ETV </description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "VL" -->
            <field>
              <name>VL</name>
              <description> bitfield VL </description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RWFFR" -->
        <register>
          <name>RWFFR</name>
          <description> register RWFFR </description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RWFFR" -->
            <field>
              <name>RWFFR</name>
              <description> bitfield RWFFR </description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PMTR" -->
        <register>
          <name>PMTR</name>
          <description> register PMTR </description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x80000267</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RWFFRPR" -->
            <field>
              <name>RWFFRPR</name>
              <description> bitfield RWFFRPR </description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "GU" -->
            <field>
              <name>GU</name>
              <description> bitfield GU </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WPR" -->
            <field>
              <name>WPR</name>
              <description> bitfield WPR </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MPR" -->
            <field>
              <name>MPR</name>
              <description> bitfield MPR </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WFE" -->
            <field>
              <name>WFE</name>
              <description> bitfield WFE </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MPE" -->
            <field>
              <name>MPE</name>
              <description> bitfield MPE </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PD" -->
            <field>
              <name>PD</name>
              <description> bitfield PD </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LPICSR" -->
        <register>
          <name>LPICSR</name>
          <description> register LPICSR </description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000F030F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LPITXA" -->
            <field>
              <name>LPITXA</name>
              <description> bitfield LPITXA </description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PLSEN" -->
            <field>
              <name>PLSEN</name>
              <description> bitfield PLSEN </description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PLS" -->
            <field>
              <name>PLS</name>
              <description> bitfield PLS </description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "LPIEN" -->
            <field>
              <name>LPIEN</name>
              <description> bitfield LPIEN </description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RLPIST" -->
            <field>
              <name>RLPIST</name>
              <description> bitfield RLPIST </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TLPIST" -->
            <field>
              <name>TLPIST</name>
              <description> bitfield TLPIST </description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RLPIEX" -->
            <field>
              <name>RLPIEX</name>
              <description> bitfield RLPIEX </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RLPIEN" -->
            <field>
              <name>RLPIEN</name>
              <description> bitfield RLPIEN </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TLPIEX" -->
            <field>
              <name>TLPIEX</name>
              <description> bitfield TLPIEX </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TLPIEN" -->
            <field>
              <name>TLPIEN</name>
              <description> bitfield TLPIEN </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "LPITCR" -->
        <register>
          <name>LPITCR</name>
          <description> register LPITCR </description>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x03E80000</resetValue>
          <resetMask>0x03FFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LIT" -->
            <field>
              <name>LIT</name>
              <description> bitfield LIT </description>
              <lsb>16</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TWT" -->
            <field>
              <name>TWT</name>
              <description> bitfield TWT </description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ISR" -->
        <register>
          <name>ISR</name>
          <description> register ISR </description>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000006F9</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LPIIS" -->
            <field>
              <name>LPIIS</name>
              <description> bitfield LPIIS </description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TSIS" -->
            <field>
              <name>TSIS</name>
              <description> bitfield TSIS </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "COIS" -->
            <field>
              <name>COIS</name>
              <description> bitfield COIS </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TIS" -->
            <field>
              <name>TIS</name>
              <description> bitfield TIS </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RIS" -->
            <field>
              <name>RIS</name>
              <description> bitfield RIS </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "MIS" -->
            <field>
              <name>MIS</name>
              <description> bitfield MIS </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "PIS" -->
            <field>
              <name>PIS</name>
              <description> bitfield PIS </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RGIS" -->
            <field>
              <name>RGIS</name>
              <description> bitfield RGIS </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IMR" -->
        <register>
          <name>IMR</name>
          <description> register IMR </description>
          <addressOffset>0x3C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000609</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LPIIM" -->
            <field>
              <name>LPIIM</name>
              <description> bitfield LPIIM </description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TSIM" -->
            <field>
              <name>TSIM</name>
              <description> bitfield TSIM </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PIM" -->
            <field>
              <name>PIM</name>
              <description> bitfield PIM </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RGIM" -->
            <field>
              <name>RGIM</name>
              <description> bitfield RGIM </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
