sol4ik/audio-steganography/try/fm4/s6e2cc_i2s_sk-fm4-176l-s6se2cc-v10/svd/S6E2CC.xml
        <!-- REGISTER "MAR0H" -->
        <register>
          <name>MAR0H</name>
          <description> register MAR0H </description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x8000FFFF</resetValue>
          <resetMask>0x8000FFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MO" -->
            <field>
              <name>MO</name>
              <description> bitfield MO </description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "A0" -->
            <field>
              <name>A0</name>
              <description> bitfield A0 </description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "MAR0L" -->
        <register>
          <name>MAR0L</name>
          <description> register MAR0L </description>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "A0" -->
            <field>
              <name>A0</name>
              <description> bitfield A0 </description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "MAR1H" -->
        <register>
          <name>MAR1H</name>
          <description> register MAR1H </description>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000FFFF</resetValue>
          <resetMask>0xFF00FFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "AE" -->
            <field>
              <name>AE</name>
              <description> bitfield AE </description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SA" -->
            <field>
              <name>SA</name>
              <description> bitfield SA </description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MBC" -->
            <field>
              <name>MBC</name>
              <description> bitfield MBC </description>
              <lsb>24</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "A" -->
            <field>
              <name>A</name>
              <description> bitfield A </description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "MAR1L" -->
        <register>
          <name>MAR1L</name>
          <description> register MAR1L </description>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "A" -->
            <field>
              <name>A</name>
              <description> bitfield A </description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "MAR2H" -->
        <register derivedFrom="MAR1H">
          <name>MAR2H</name>
          <description> register MAR2H </description>
          <addressOffset>0x50</addressOffset>
        </register>
        <!-- REGISTER "MAR2L" -->
        <register derivedFrom="MAR1L">
          <name>MAR2L</name>
          <description> register MAR2L </description>
          <addressOffset>0x54</addressOffset>
        </register>
        <!-- REGISTER "MAR3H" -->
        <register derivedFrom="MAR1H">
          <name>MAR3H</name>
          <description> register MAR3H </description>
          <addressOffset>0x58</addressOffset>
        </register>
        <!-- REGISTER "MAR3L" -->
        <register derivedFrom="MAR1L">
          <name>MAR3L</name>
          <description> register MAR3L </description>
          <addressOffset>0x5C</addressOffset>
        </register>
        <!-- REGISTER "MAR4H" -->
        <register derivedFrom="MAR1H">
          <name>MAR4H</name>
          <description> register MAR4H </description>
          <addressOffset>0x60</addressOffset>
        </register>
        <!-- REGISTER "MAR4L" -->
        <register derivedFrom="MAR1L">
          <name>MAR4L</name>
          <description> register MAR4L </description>
          <addressOffset>0x64</addressOffset>
        </register>
        <!-- REGISTER "MAR5H" -->
        <register derivedFrom="MAR1H">
          <name>MAR5H</name>
          <description> register MAR5H </description>
          <addressOffset>0x68</addressOffset>
        </register>
        <!-- REGISTER "MAR5L" -->
        <register derivedFrom="MAR1L">
          <name>MAR5L</name>
          <description> register MAR5L </description>
          <addressOffset>0x6C</addressOffset>
        </register>
        <!-- REGISTER "MAR6H" -->
        <register derivedFrom="MAR1H">
          <name>MAR6H</name>
          <description> register MAR6H </description>
          <addressOffset>0x70</addressOffset>
        </register>
        <!-- REGISTER "MAR6L" -->
        <register derivedFrom="MAR1L">
          <name>MAR6L</name>
          <description> register MAR6L </description>
          <addressOffset>0x74</addressOffset>
        </register>
        <!-- REGISTER "MAR7H" -->
        <register derivedFrom="MAR1H">
          <name>MAR7H</name>
          <description> register MAR7H </description>
          <addressOffset>0x78</addressOffset>
        </register>
