sol4ik/audio-steganography/try/fm4/s6e2cc_i2s_sk-fm4-176l-s6se2cc-v10/svd/S6E2CC.xml
        <!-- REGISTER "MAR7L" -->
        <register derivedFrom="MAR1L">
          <name>MAR7L</name>
          <description> register MAR7L </description>
          <addressOffset>0x7C</addressOffset>
        </register>
        <!-- REGISTER "MAR8H" -->
        <register derivedFrom="MAR1H">
          <name>MAR8H</name>
          <description> register MAR8H </description>
          <addressOffset>0x80</addressOffset>
        </register>
        <!-- REGISTER "MAR8L" -->
        <register derivedFrom="MAR1L">
          <name>MAR8L</name>
          <description> register MAR8L </description>
          <addressOffset>0x84</addressOffset>
        </register>
        <!-- REGISTER "MAR9H" -->
        <register derivedFrom="MAR1H">
          <name>MAR9H</name>
          <description> register MAR9H </description>
          <addressOffset>0x88</addressOffset>
        </register>
        <!-- REGISTER "MAR9L" -->
        <register derivedFrom="MAR1L">
          <name>MAR9L</name>
          <description> register MAR9L </description>
          <addressOffset>0x8C</addressOffset>
        </register>
        <!-- REGISTER "MAR10H" -->
        <register derivedFrom="MAR1H">
          <name>MAR10H</name>
          <description> register MAR10H </description>
          <addressOffset>0x90</addressOffset>
        </register>
        <!-- REGISTER "MAR10L" -->
        <register derivedFrom="MAR1L">
          <name>MAR10L</name>
          <description> register MAR10L </description>
          <addressOffset>0x94</addressOffset>
        </register>
        <!-- REGISTER "MAR11H" -->
        <register derivedFrom="MAR1H">
          <name>MAR11H</name>
          <description> register MAR11H </description>
          <addressOffset>0x98</addressOffset>
        </register>
        <!-- REGISTER "MAR11L" -->
        <register derivedFrom="MAR1L">
          <name>MAR11L</name>
          <description> register MAR11L </description>
          <addressOffset>0x9C</addressOffset>
        </register>
        <!-- REGISTER "MAR12H" -->
        <register derivedFrom="MAR1H">
          <name>MAR12H</name>
          <description> register MAR12H </description>
          <addressOffset>0xA0</addressOffset>
        </register>
        <!-- REGISTER "MAR12L" -->
        <register derivedFrom="MAR1L">
          <name>MAR12L</name>
          <description> register MAR12L </description>
          <addressOffset>0xA4</addressOffset>
        </register>
        <!-- REGISTER "MAR13H" -->
        <register derivedFrom="MAR1H">
          <name>MAR13H</name>
          <description> register MAR13H </description>
          <addressOffset>0xA8</addressOffset>
        </register>
        <!-- REGISTER "MAR13L" -->
        <register derivedFrom="MAR1L">
          <name>MAR13L</name>
          <description> register MAR13L </description>
          <addressOffset>0xAC</addressOffset>
        </register>
        <!-- REGISTER "MAR14H" -->
        <register derivedFrom="MAR1H">
          <name>MAR14H</name>
          <description> register MAR14H </description>
          <addressOffset>0xB0</addressOffset>
        </register>
        <!-- REGISTER "MAR14L" -->
        <register derivedFrom="MAR1L">
          <name>MAR14L</name>
          <description> register MAR14L </description>
          <addressOffset>0xB4</addressOffset>
        </register>
        <!-- REGISTER "MAR15H" -->
        <register derivedFrom="MAR1H">
          <name>MAR15H</name>
          <description> register MAR15H </description>
          <addressOffset>0xB8</addressOffset>
        </register>
        <!-- REGISTER "MAR15L" -->
        <register derivedFrom="MAR1L">
          <name>MAR15L</name>
          <description> register MAR15L </description>
          <addressOffset>0xBC</addressOffset>
        </register>
        <!-- REGISTER "RGSR" -->
        <register>
          <name>RGSR</name>
          <description> register RGSR </description>
          <addressOffset>0xD8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LS" -->
            <field>
              <name>LS</name>
              <description> bitfield LS </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "LSP" -->
            <field>
              <name>LSP</name>
              <description> bitfield LSP </description>
              <lsb>1</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "LM" -->
            <field>
              <name>LM</name>
              <description> bitfield LM </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "mmc_cntl" -->
        <register>
          <name>mmc_cntl</name>
          <description> register mmc_cntl </description>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000003F</resetMask>
        </register>
        <!-- REGISTER "mmc_intr_rx" -->
        <register>
          <name>mmc_intr_rx</name>
          <description> register mmc_intr_rx </description>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
        </register>
        <!-- REGISTER "mmc_intr_tx" -->
        <register>
          <name>mmc_intr_tx</name>
          <description> register mmc_intr_tx </description>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x01FFFFFF</resetMask>
        </register>
        <!-- REGISTER "mmc_intr_mask_rx" -->
        <register>
          <name>mmc_intr_mask_rx</name>
          <description> register mmc_intr_mask_rx </description>
          <addressOffset>0x10C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FFFFFF</resetMask>
        </register>
        <!-- REGISTER "mmc_intr_mask_tx" -->
        <register>
          <name>mmc_intr_mask_tx</name>
          <description> register mmc_intr_mask_tx </description>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x01FFFFFF</resetMask>
        </register>
        <!-- REGISTER "txoctetcount_gb" -->
        <register>
          <name>txoctetcount_gb</name>
          <description> register txoctetcount_gb </description>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "txframecount_gb" -->
        <register>
          <name>txframecount_gb</name>
          <description> register txframecount_gb </description>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "txbroadcastframes_g" -->
        <register>
          <name>txbroadcastframes_g</name>
          <description> register txbroadcastframes_g </description>
          <addressOffset>0x11C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "txmulticastframes_g" -->
        <register>
          <name>txmulticastframes_g</name>
          <description> register txmulticastframes_g </description>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "tx64octets_gb" -->
        <register>
          <name>tx64octets_gb</name>
          <description> register tx64octets_gb </description>
          <addressOffset>0x124</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "tx65to127octets_gb" -->
        <register>
          <name>tx65to127octets_gb</name>
          <description> register tx65to127octets_gb </description>
          <addressOffset>0x128</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "tx128to255octets_gb" -->
        <register>
          <name>tx128to255octets_gb</name>
          <description> register tx128to255octets_gb </description>
          <addressOffset>0x12C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "tx256to511octets_gb" -->
        <register>
          <name>tx256to511octets_gb</name>
          <description> register tx256to511octets_gb </description>
          <addressOffset>0x130</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
