sol4ik/audio-steganography/try/fm4/s6e2cc_i2s_sk-fm4-176l-s6se2cc-v10/svd/S6E2CC.xml
        <!-- REGISTER "tx512to1023octets_gb" -->
        <register>
          <name>tx512to1023octets_gb</name>
          <description> register tx512to1023octets_gb </description>
          <addressOffset>0x134</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "tx1024tomaxoctets_gb" -->
        <register>
          <name>tx1024tomaxoctets_gb</name>
          <description> register tx1024tomaxoctets_gb </description>
          <addressOffset>0x138</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "txunicastframes_gb" -->
        <register>
          <name>txunicastframes_gb</name>
          <description> register txunicastframes_gb </description>
          <addressOffset>0x13C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "txmulticastframes_gb" -->
        <register>
          <name>txmulticastframes_gb</name>
          <description> register txmulticastframes_gb </description>
          <addressOffset>0x140</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "txbroadcastframes_gb" -->
        <register>
          <name>txbroadcastframes_gb</name>
          <description> register txbroadcastframes_gb </description>
          <addressOffset>0x144</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "txunderflowerror" -->
        <register>
          <name>txunderflowerror</name>
          <description> register txunderflowerror </description>
          <addressOffset>0x148</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "txsinglecol_g" -->
        <register>
          <name>txsinglecol_g</name>
          <description> register txsinglecol_g </description>
          <addressOffset>0x14C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "txmulticol_g" -->
        <register>
          <name>txmulticol_g</name>
          <description> register txmulticol_g </description>
          <addressOffset>0x150</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "txdeferred" -->
        <register>
          <name>txdeferred</name>
          <description> register txdeferred </description>
          <addressOffset>0x154</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "txlatecol" -->
        <register>
          <name>txlatecol</name>
          <description> register txlatecol </description>
          <addressOffset>0x158</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "txexesscol" -->
        <register>
          <name>txexesscol</name>
          <description> register txexesscol </description>
          <addressOffset>0x15C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "txcarriererror" -->
        <register>
          <name>txcarriererror</name>
          <description> register txcarriererror </description>
          <addressOffset>0x160</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "txoctetcount_g" -->
        <register>
          <name>txoctetcount_g</name>
          <description> register txoctetcount_g </description>
          <addressOffset>0x164</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "txframecount_g" -->
        <register>
          <name>txframecount_g</name>
          <description> register txframecount_g </description>
          <addressOffset>0x168</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "txexecessdef_g" -->
        <register>
          <name>txexecessdef_g</name>
          <description> register txexecessdef_g </description>
          <addressOffset>0x16C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "txpauseframes" -->
        <register>
          <name>txpauseframes</name>
          <description> register txpauseframes </description>
          <addressOffset>0x170</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
