sol4ik/audio-steganography/try/fm4/s6e2cc_i2s_sk-fm4-176l-s6se2cc-v10/svd/S6E2CC.xml
        <!-- REGISTER "txvlanframes_g" -->
        <register>
          <name>txvlanframes_g</name>
          <description> register txvlanframes_g </description>
          <addressOffset>0x174</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxframecount_gb" -->
        <register>
          <name>rxframecount_gb</name>
          <description> register rxframecount_gb </description>
          <addressOffset>0x180</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxoctetcount_gb" -->
        <register>
          <name>rxoctetcount_gb</name>
          <description> register rxoctetcount_gb </description>
          <addressOffset>0x184</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxoctetcount_g" -->
        <register>
          <name>rxoctetcount_g</name>
          <description> register rxoctetcount_g </description>
          <addressOffset>0x188</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxbroadcastframes_g" -->
        <register>
          <name>rxbroadcastframes_g</name>
          <description> register rxbroadcastframes_g </description>
          <addressOffset>0x18C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxmulticastframes_g" -->
        <register>
          <name>rxmulticastframes_g</name>
          <description> register rxmulticastframes_g </description>
          <addressOffset>0x190</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxcrcerror" -->
        <register>
          <name>rxcrcerror</name>
          <description> register rxcrcerror </description>
          <addressOffset>0x194</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxallignmenterror" -->
        <register>
          <name>rxallignmenterror</name>
          <description> register rxallignmenterror </description>
          <addressOffset>0x198</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxrunterror" -->
        <register>
          <name>rxrunterror</name>
          <description> register rxrunterror </description>
          <addressOffset>0x19C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxjabbererror" -->
        <register>
          <name>rxjabbererror</name>
          <description> register rxjabbererror </description>
          <addressOffset>0x1A0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxundersize_g" -->
        <register>
          <name>rxundersize_g</name>
          <description> register rxundersize_g </description>
          <addressOffset>0x1A4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxoversize_g" -->
        <register>
          <name>rxoversize_g</name>
          <description> register rxoversize_g </description>
          <addressOffset>0x1A8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rx64octets_gb" -->
        <register>
          <name>rx64octets_gb</name>
          <description> register rx64octets_gb </description>
          <addressOffset>0x1AC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rx65to127octets_gb" -->
        <register>
          <name>rx65to127octets_gb</name>
          <description> register rx65to127octets_gb </description>
          <addressOffset>0x1B0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rx128to255octets_gb" -->
        <register>
          <name>rx128to255octets_gb</name>
          <description> register rx128to255octets_gb </description>
          <addressOffset>0x1B4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rx256to511octets_gb" -->
        <register>
          <name>rx256to511octets_gb</name>
          <description> register rx256to511octets_gb </description>
          <addressOffset>0x1B8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rx512to1023octets_gb" -->
        <register>
          <name>rx512to1023octets_gb</name>
          <description> register rx512to1023octets_gb </description>
          <addressOffset>0x1BC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rx1024tomaxoctets_gb" -->
        <register>
          <name>rx1024tomaxoctets_gb</name>
          <description> register rx1024tomaxoctets_gb </description>
          <addressOffset>0x1C0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxunicastframes_g" -->
        <register>
          <name>rxunicastframes_g</name>
          <description> register rxunicastframes_g </description>
          <addressOffset>0x1C4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
