sol4ik/audio-steganography/try/fm4/s6e2cc_i2s_sk-fm4-176l-s6se2cc-v10/svd/S6E2CC.xml
        <!-- REGISTER "rxlengtherror" -->
        <register>
          <name>rxlengtherror</name>
          <description> register rxlengtherror </description>
          <addressOffset>0x1C8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxoutofrangetype" -->
        <register>
          <name>rxoutofrangetype</name>
          <description> register rxoutofrangetype </description>
          <addressOffset>0x1CC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxpauseframes" -->
        <register>
          <name>rxpauseframes</name>
          <description> register rxpauseframes </description>
          <addressOffset>0x1D0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxfifooverflow" -->
        <register>
          <name>rxfifooverflow</name>
          <description> register rxfifooverflow </description>
          <addressOffset>0x1D4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxvlanframes_gb" -->
        <register>
          <name>rxvlanframes_gb</name>
          <description> register rxvlanframes_gb </description>
          <addressOffset>0x1D8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxwatchdogerror" -->
        <register>
          <name>rxwatchdogerror</name>
          <description> register rxwatchdogerror </description>
          <addressOffset>0x1DC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "mmc_ipc_intr_mask_rx" -->
        <register>
          <name>mmc_ipc_intr_mask_rx</name>
          <description> register mmc_ipc_intr_mask_rx </description>
          <addressOffset>0x200</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3FFF3FFF</resetMask>
        </register>
        <!-- REGISTER "mmc_ipc_intr_rx" -->
        <register>
          <name>mmc_ipc_intr_rx</name>
          <description> register mmc_ipc_intr_rx </description>
          <addressOffset>0x208</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3FFF3FFF</resetMask>
        </register>
        <!-- REGISTER "rxipv4_gd_frms" -->
        <register>
          <name>rxipv4_gd_frms</name>
          <description> register rxipv4_gd_frms </description>
          <addressOffset>0x210</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxipv4_hdrerr_frms" -->
        <register>
          <name>rxipv4_hdrerr_frms</name>
          <description> register rxipv4_hdrerr_frms </description>
          <addressOffset>0x214</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxipv4_nopay_frms" -->
        <register>
          <name>rxipv4_nopay_frms</name>
          <description> register rxipv4_nopay_frms </description>
          <addressOffset>0x218</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxipv4_frag_frms" -->
        <register>
          <name>rxipv4_frag_frms</name>
          <description> register rxipv4_frag_frms </description>
          <addressOffset>0x21C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxipv4_udsbl_frms" -->
        <register>
          <name>rxipv4_udsbl_frms</name>
          <description> register rxipv4_udsbl_frms </description>
          <addressOffset>0x220</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxipv6_gd_frms" -->
        <register>
          <name>rxipv6_gd_frms</name>
          <description> register rxipv6_gd_frms </description>
          <addressOffset>0x224</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxipv6_hdrerr_frms" -->
        <register>
          <name>rxipv6_hdrerr_frms</name>
          <description> register rxipv6_hdrerr_frms </description>
          <addressOffset>0x228</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxipv6_nopay_frms" -->
        <register>
          <name>rxipv6_nopay_frms</name>
          <description> register rxipv6_nopay_frms </description>
          <addressOffset>0x22C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxudp_gd_frms" -->
        <register>
          <name>rxudp_gd_frms</name>
          <description> register rxudp_gd_frms </description>
          <addressOffset>0x230</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxudp_err_frms" -->
        <register>
          <name>rxudp_err_frms</name>
          <description> register rxudp_err_frms </description>
          <addressOffset>0x234</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxtcp_gd_frms" -->
        <register>
          <name>rxtcp_gd_frms</name>
          <description> register rxtcp_gd_frms </description>
          <addressOffset>0x238</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxtcp_err_frms" -->
        <register>
          <name>rxtcp_err_frms</name>
          <description> register rxtcp_err_frms </description>
          <addressOffset>0x23C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
