sol4ik/audio-steganography/try/fm4/s6e2cc_i2s_sk-fm4-176l-s6se2cc-v10/svd/S6E2CC.xml
        <!-- REGISTER "rxicmp_gd_frms" -->
        <register>
          <name>rxicmp_gd_frms</name>
          <description> register rxicmp_gd_frms </description>
          <addressOffset>0x240</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxicmp_err_frms" -->
        <register>
          <name>rxicmp_err_frms</name>
          <description> register rxicmp_err_frms </description>
          <addressOffset>0x244</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxipv4_gd_octets" -->
        <register>
          <name>rxipv4_gd_octets</name>
          <description> register rxipv4_gd_octets </description>
          <addressOffset>0x250</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxipv4_hdrerr_octets" -->
        <register>
          <name>rxipv4_hdrerr_octets</name>
          <description> register rxipv4_hdrerr_octets </description>
          <addressOffset>0x254</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxipv4_nopay_octets" -->
        <register>
          <name>rxipv4_nopay_octets</name>
          <description> register rxipv4_nopay_octets </description>
          <addressOffset>0x258</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxipv4_frag_octets" -->
        <register>
          <name>rxipv4_frag_octets</name>
          <description> register rxipv4_frag_octets </description>
          <addressOffset>0x25C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxipv4_udsbl_octets" -->
        <register>
          <name>rxipv4_udsbl_octets</name>
          <description> register rxipv4_udsbl_octets </description>
          <addressOffset>0x260</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxipv6_gd_octets" -->
        <register>
          <name>rxipv6_gd_octets</name>
          <description> register rxipv6_gd_octets </description>
          <addressOffset>0x264</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxipv6_hdrerr_octets" -->
        <register>
          <name>rxipv6_hdrerr_octets</name>
          <description> register rxipv6_hdrerr_octets </description>
          <addressOffset>0x268</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxipv6_nopay_octets" -->
        <register>
          <name>rxipv6_nopay_octets</name>
          <description> register rxipv6_nopay_octets </description>
          <addressOffset>0x26C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxudp_gd_octets" -->
        <register>
          <name>rxudp_gd_octets</name>
          <description> register rxudp_gd_octets </description>
          <addressOffset>0x270</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxudp_err_octets" -->
        <register>
          <name>rxudp_err_octets</name>
          <description> register rxudp_err_octets </description>
          <addressOffset>0x274</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxtcp_gd_octets" -->
        <register>
          <name>rxtcp_gd_octets</name>
          <description> register rxtcp_gd_octets </description>
          <addressOffset>0x278</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxtcp_err_octets" -->
        <register>
          <name>rxtcp_err_octets</name>
          <description> register rxtcp_err_octets </description>
          <addressOffset>0x27C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxicmp_gd_octets" -->
        <register>
          <name>rxicmp_gd_octets</name>
          <description> register rxicmp_gd_octets </description>
          <addressOffset>0x280</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
        <!-- REGISTER "rxicmp_err_octets" -->
        <register>
          <name>rxicmp_err_octets</name>
          <description> register rxicmp_err_octets </description>
          <addressOffset>0x284</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
