sol4ik/audio-steganography/try/fm4/s6e2cc_i2s_sk-fm4-176l-s6se2cc-v10/svd/S6E2CC.xml
        <!-- REGISTER "TSCR" -->
        <register>
          <name>TSCR</name>
          <description> register TSCR </description>
          <addressOffset>0x700</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00002000</resetValue>
          <resetMask>0x0107FF3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ATSFC" -->
            <field>
              <name>ATSFC</name>
              <description> bitfield ATSFC </description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TSENMF" -->
            <field>
              <name>TSENMF</name>
              <description> bitfield TSENMF </description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TSPS" -->
            <field>
              <name>TSPS</name>
              <description> bitfield TSPS </description>
              <lsb>16</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TSMRM" -->
            <field>
              <name>TSMRM</name>
              <description> bitfield TSMRM </description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TETSEM" -->
            <field>
              <name>TETSEM</name>
              <description> bitfield TETSEM </description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TSIP4E" -->
            <field>
              <name>TSIP4E</name>
              <description> bitfield TSIP4E </description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TSIP6E" -->
            <field>
              <name>TSIP6E</name>
              <description> bitfield TSIP6E </description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TETSP" -->
            <field>
              <name>TETSP</name>
              <description> bitfield TETSP </description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TSV2E" -->
            <field>
              <name>TSV2E</name>
              <description> bitfield TSV2E </description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TSDB" -->
            <field>
              <name>TSDB</name>
              <description> bitfield TSDB </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TSEA" -->
            <field>
              <name>TSEA</name>
              <description> bitfield TSEA </description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TARU" -->
            <field>
              <name>TARU</name>
              <description> bitfield TARU </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TITE" -->
            <field>
              <name>TITE</name>
              <description> bitfield TITE </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TSU" -->
            <field>
              <name>TSU</name>
              <description> bitfield TSU </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TSI" -->
            <field>
              <name>TSI</name>
              <description> bitfield TSI </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TFCU" -->
            <field>
              <name>TFCU</name>
              <description> bitfield TFCU </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TSE" -->
            <field>
              <name>TSE</name>
              <description> bitfield TSE </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "SSIR" -->
        <register>
          <name>SSIR</name>
          <description> register SSIR </description>
          <addressOffset>0x704</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SSINC" -->
            <field>
              <name>SSINC</name>
              <description> bitfield SSINC </description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "STSR" -->
        <register>
          <name>STSR</name>
          <description> register STSR </description>
          <addressOffset>0x708</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TSS" -->
            <field>
              <name>TSS</name>
              <description> bitfield TSS </description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
