sol4ik/audio-steganography/try/fm4/s6e2cc_i2s_sk-fm4-176l-s6se2cc-v10/svd/S6E2CC.xml
        <!-- REGISTER "STNR" -->
        <register>
          <name>STNR</name>
          <description> register STNR </description>
          <addressOffset>0x70C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7FFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TSSS" -->
            <field>
              <name>TSSS</name>
              <description> bitfield TSSS </description>
              <lsb>0</lsb>
              <msb>30</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "STSUR" -->
        <register>
          <name>STSUR</name>
          <description> register STSUR </description>
          <addressOffset>0x710</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TSS" -->
            <field>
              <name>TSS</name>
              <description> bitfield TSS </description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "STNUR" -->
        <register>
          <name>STNUR</name>
          <description> register STNUR </description>
          <addressOffset>0x714</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ADDSUB" -->
            <field>
              <name>ADDSUB</name>
              <description> bitfield ADDSUB </description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TSSS" -->
            <field>
              <name>TSSS</name>
              <description> bitfield TSSS </description>
              <lsb>0</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TSAR" -->
        <register>
          <name>TSAR</name>
          <description> register TSAR </description>
          <addressOffset>0x718</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TSAR" -->
            <field>
              <name>TSAR</name>
              <description> bitfield TSAR </description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TTSR" -->
        <register>
          <name>TTSR</name>
          <description> register TTSR </description>
          <addressOffset>0x71C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TSTR" -->
            <field>
              <name>TSTR</name>
              <description> bitfield TSTR </description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TTNR" -->
        <register>
          <name>TTNR</name>
          <description> register TTNR </description>
          <addressOffset>0x720</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7FFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TSTR" -->
            <field>
              <name>TSTR</name>
              <description> bitfield TSTR </description>
              <lsb>0</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "STHWSR" -->
        <register>
          <name>STHWSR</name>
          <description> register STHWSR </description>
          <addressOffset>0x724</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TSHWR" -->
            <field>
              <name>TSHWR</name>
              <description> bitfield TSHWR </description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TSR" -->
        <register>
          <name>TSR</name>
          <description> register TSR </description>
          <addressOffset>0x728</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0F00000F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ATSNS" -->
            <field>
              <name>ATSNS</name>
              <description> bitfield ATSNS </description>
              <lsb>25</lsb>
              <msb>27</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ATSSTM" -->
            <field>
              <name>ATSSTM</name>
              <description> bitfield ATSSTM </description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TRGTER" -->
            <field>
              <name>TRGTER</name>
              <description> bitfield TRGTER </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ATSTS" -->
            <field>
              <name>ATSTS</name>
              <description> bitfield ATSTS </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TSTART" -->
            <field>
              <name>TSTART</name>
              <description> bitfield TSTART </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TSSOVF" -->
            <field>
              <name>TSSOVF</name>
              <description> bitfield TSSOVF </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "PPSCR" -->
        <register>
          <name>PPSCR</name>
          <description> register PPSCR </description>
          <addressOffset>0x72C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000000F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PPSCTRL" -->
            <field>
              <name>PPSCTRL</name>
              <description> bitfield PPSCTRL </description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ATNR" -->
        <register>
          <name>ATNR</name>
          <description> register ATNR </description>
          <addressOffset>0x730</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7FFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ATN" -->
            <field>
              <name>ATN</name>
              <description> bitfield ATN </description>
              <lsb>0</lsb>
              <msb>30</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "ATSR" -->
        <register>
          <name>ATSR</name>
          <description> register ATSR </description>
          <addressOffset>0x734</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ATS" -->
            <field>
              <name>ATS</name>
              <description> bitfield ATS </description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "MAR16H" -->
        <register derivedFrom="MAR1H">
          <name>MAR16H</name>
          <description> register MAR16H </description>
          <addressOffset>0x800</addressOffset>
        </register>
        <!-- REGISTER "MAR16L" -->
        <register derivedFrom="MAR1L">
          <name>MAR16L</name>
          <description> register MAR16L </description>
          <addressOffset>0x804</addressOffset>
        </register>
        <!-- REGISTER "MAR17H" -->
        <register derivedFrom="MAR1H">
          <name>MAR17H</name>
          <description> register MAR17H </description>
          <addressOffset>0x808</addressOffset>
        </register>
        <!-- REGISTER "MAR17L" -->
        <register derivedFrom="MAR1L">
          <name>MAR17L</name>
          <description> register MAR17L </description>
          <addressOffset>0x80C</addressOffset>
        </register>
