sol4ik/audio-steganography/try/fm4/s6e2cc_i2s_sk-fm4-176l-s6se2cc-v10/svd/S6E2CC.xml
        <!-- REGISTER "MAR18H" -->
        <register derivedFrom="MAR1H">
          <name>MAR18H</name>
          <description> register MAR18H </description>
          <addressOffset>0x810</addressOffset>
        </register>
        <!-- REGISTER "MAR18L" -->
        <register derivedFrom="MAR1L">
          <name>MAR18L</name>
          <description> register MAR18L </description>
          <addressOffset>0x814</addressOffset>
        </register>
        <!-- REGISTER "MAR19H" -->
        <register derivedFrom="MAR1H">
          <name>MAR19H</name>
          <description> register MAR19H </description>
          <addressOffset>0x818</addressOffset>
        </register>
        <!-- REGISTER "MAR19L" -->
        <register derivedFrom="MAR1L">
          <name>MAR19L</name>
          <description> register MAR19L </description>
          <addressOffset>0x81C</addressOffset>
        </register>
        <!-- REGISTER "MAR20H" -->
        <register derivedFrom="MAR1H">
          <name>MAR20H</name>
          <description> register MAR20H </description>
          <addressOffset>0x820</addressOffset>
        </register>
        <!-- REGISTER "MAR20L" -->
        <register derivedFrom="MAR1L">
          <name>MAR20L</name>
          <description> register MAR20L </description>
          <addressOffset>0x824</addressOffset>
        </register>
        <!-- REGISTER "MAR21H" -->
        <register derivedFrom="MAR1H">
          <name>MAR21H</name>
          <description> register MAR21H </description>
          <addressOffset>0x828</addressOffset>
        </register>
        <!-- REGISTER "MAR21L" -->
        <register derivedFrom="MAR1L">
          <name>MAR21L</name>
          <description> register MAR21L </description>
          <addressOffset>0x82C</addressOffset>
        </register>
        <!-- REGISTER "MAR22H" -->
        <register derivedFrom="MAR1H">
          <name>MAR22H</name>
          <description> register MAR22H </description>
          <addressOffset>0x830</addressOffset>
        </register>
        <!-- REGISTER "MAR22L" -->
        <register derivedFrom="MAR1L">
          <name>MAR22L</name>
          <description> register MAR22L </description>
          <addressOffset>0x834</addressOffset>
        </register>
        <!-- REGISTER "MAR23H" -->
        <register derivedFrom="MAR1H">
          <name>MAR23H</name>
          <description> register MAR23H </description>
          <addressOffset>0x838</addressOffset>
        </register>
        <!-- REGISTER "MAR23L" -->
        <register derivedFrom="MAR1L">
          <name>MAR23L</name>
          <description> register MAR23L </description>
          <addressOffset>0x83C</addressOffset>
        </register>
        <!-- REGISTER "MAR24H" -->
        <register derivedFrom="MAR1H">
          <name>MAR24H</name>
          <description> register MAR24H </description>
          <addressOffset>0x840</addressOffset>
        </register>
        <!-- REGISTER "MAR24L" -->
        <register derivedFrom="MAR1L">
          <name>MAR24L</name>
          <description> register MAR24L </description>
          <addressOffset>0x844</addressOffset>
        </register>
        <!-- REGISTER "MAR25H" -->
        <register derivedFrom="MAR1H">
          <name>MAR25H</name>
          <description> register MAR25H </description>
          <addressOffset>0x848</addressOffset>
        </register>
        <!-- REGISTER "MAR25L" -->
        <register derivedFrom="MAR1L">
          <name>MAR25L</name>
          <description> register MAR25L </description>
          <addressOffset>0x84C</addressOffset>
        </register>
        <!-- REGISTER "MAR26H" -->
        <register derivedFrom="MAR1H">
          <name>MAR26H</name>
          <description> register MAR26H </description>
          <addressOffset>0x850</addressOffset>
        </register>
        <!-- REGISTER "MAR26L" -->
        <register derivedFrom="MAR1L">
          <name>MAR26L</name>
          <description> register MAR26L </description>
          <addressOffset>0x854</addressOffset>
        </register>
        <!-- REGISTER "MAR27H" -->
        <register derivedFrom="MAR1H">
          <name>MAR27H</name>
          <description> register MAR27H </description>
          <addressOffset>0x858</addressOffset>
        </register>
        <!-- REGISTER "MAR27L" -->
        <register derivedFrom="MAR1L">
          <name>MAR27L</name>
          <description> register MAR27L </description>
          <addressOffset>0x85C</addressOffset>
        </register>
        <!-- REGISTER "MAR28H" -->
        <register derivedFrom="MAR1H">
          <name>MAR28H</name>
          <description> register MAR28H </description>
          <addressOffset>0x860</addressOffset>
        </register>
        <!-- REGISTER "MAR28L" -->
        <register derivedFrom="MAR1L">
          <name>MAR28L</name>
          <description> register MAR28L </description>
          <addressOffset>0x864</addressOffset>
        </register>
        <!-- REGISTER "MAR29H" -->
        <register derivedFrom="MAR1H">
          <name>MAR29H</name>
          <description> register MAR29H </description>
          <addressOffset>0x868</addressOffset>
        </register>
        <!-- REGISTER "MAR29L" -->
        <register derivedFrom="MAR1L">
          <name>MAR29L</name>
          <description> register MAR29L </description>
          <addressOffset>0x86C</addressOffset>
        </register>
        <!-- REGISTER "MAR30H" -->
        <register derivedFrom="MAR1H">
          <name>MAR30H</name>
          <description> register MAR30H </description>
          <addressOffset>0x870</addressOffset>
        </register>
        <!-- REGISTER "MAR30L" -->
        <register derivedFrom="MAR1L">
          <name>MAR30L</name>
          <description> register MAR30L </description>
          <addressOffset>0x874</addressOffset>
        </register>
        <!-- REGISTER "MAR31H" -->
        <register derivedFrom="MAR1H">
          <name>MAR31H</name>
          <description> register MAR31H </description>
          <addressOffset>0x878</addressOffset>
        </register>
