sol4ik/audio-steganography/try/fm4/s6e2cc_i2s_sk-fm4-176l-s6se2cc-v10/svd/S6E2CC.xml
        <!-- REGISTER "MAR31L" -->
        <register derivedFrom="MAR1L">
          <name>MAR31L</name>
          <description> register MAR31L </description>
          <addressOffset>0x87C</addressOffset>
        </register>
        <!-- REGISTER "BMR" -->
        <register>
          <name>BMR</name>
          <description> register BMR </description>
          <addressOffset>0x1000</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00020101</resetValue>
          <resetMask>0x0FFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TXPR" -->
            <field>
              <name>TXPR</name>
              <description> bitfield TXPR </description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MB" -->
            <field>
              <name>MB</name>
              <description> bitfield MB </description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AAL" -->
            <field>
              <name>AAL</name>
              <description> bitfield AAL </description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "_8XPBL" -->
            <field>
              <name>_8XPBL</name>
              <description> bitfield _8XPBL </description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "USP" -->
            <field>
              <name>USP</name>
              <description> bitfield USP </description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RPBL" -->
            <field>
              <name>RPBL</name>
              <description> bitfield RPBL </description>
              <lsb>17</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FB" -->
            <field>
              <name>FB</name>
              <description> bitfield FB </description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PR" -->
            <field>
              <name>PR</name>
              <description> bitfield PR </description>
              <lsb>14</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "PBL" -->
            <field>
              <name>PBL</name>
              <description> bitfield PBL </description>
              <lsb>8</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ATDS" -->
            <field>
              <name>ATDS</name>
              <description> bitfield ATDS </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DSL" -->
            <field>
              <name>DSL</name>
              <description> bitfield DSL </description>
              <lsb>2</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DA" -->
            <field>
              <name>DA</name>
              <description> bitfield DA </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SWR" -->
            <field>
              <name>SWR</name>
              <description> bitfield SWR </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TPDR" -->
        <register>
          <name>TPDR</name>
          <description> register TPDR </description>
          <addressOffset>0x1004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TPD" -->
            <field>
              <name>TPD</name>
              <description> bitfield TPD </description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RPDR" -->
        <register>
          <name>RPDR</name>
          <description> register RPDR </description>
          <addressOffset>0x1008</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RPD" -->
            <field>
              <name>RPD</name>
              <description> bitfield RPD </description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RDLAR" -->
        <register>
          <name>RDLAR</name>
          <description> register RDLAR </description>
          <addressOffset>0x100C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFC</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SRL" -->
            <field>
              <name>SRL</name>
              <description> bitfield SRL </description>
              <lsb>2</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TDLAR" -->
        <register>
          <name>TDLAR</name>
          <description> register TDLAR </description>
          <addressOffset>0x1010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFC</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "STL" -->
            <field>
              <name>STL</name>
              <description> bitfield STL </description>
              <lsb>2</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "SR" -->
        <register>
          <name>SR</name>
          <description> register SR </description>
          <addressOffset>0x1014</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7FFFE7FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "GLPII" -->
            <field>
              <name>GLPII</name>
              <description> bitfield GLPII </description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TTI" -->
            <field>
              <name>TTI</name>
              <description> bitfield TTI </description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "GPI" -->
            <field>
              <name>GPI</name>
              <description> bitfield GPI </description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "GMI" -->
            <field>
              <name>GMI</name>
              <description> bitfield GMI </description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "GLI" -->
            <field>
              <name>GLI</name>
              <description> bitfield GLI </description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "EB" -->
            <field>
              <name>EB</name>
              <description> bitfield EB </description>
              <lsb>23</lsb>
              <msb>25</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TS" -->
            <field>
              <name>TS</name>
              <description> bitfield TS </description>
              <lsb>20</lsb>
              <msb>22</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RS" -->
            <field>
              <name>RS</name>
              <description> bitfield RS </description>
              <lsb>17</lsb>
              <msb>19</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NIS" -->
            <field>
              <name>NIS</name>
              <description> bitfield NIS </description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "AIS" -->
            <field>
              <name>AIS</name>
              <description> bitfield AIS </description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ERI" -->
            <field>
              <name>ERI</name>
              <description> bitfield ERI </description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "FBI" -->
            <field>
              <name>FBI</name>
              <description> bitfield FBI </description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ETI" -->
            <field>
              <name>ETI</name>
              <description> bitfield ETI </description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RWT" -->
            <field>
              <name>RWT</name>
              <description> bitfield RWT </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RPS" -->
            <field>
              <name>RPS</name>
              <description> bitfield RPS </description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RU" -->
            <field>
              <name>RU</name>
              <description> bitfield RU </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RI" -->
            <field>
              <name>RI</name>
              <description> bitfield RI </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "UNF" -->
            <field>
              <name>UNF</name>
              <description> bitfield UNF </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "OVF" -->
            <field>
              <name>OVF</name>
              <description> bitfield OVF </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TJT" -->
            <field>
              <name>TJT</name>
              <description> bitfield TJT </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TU" -->
            <field>
              <name>TU</name>
              <description> bitfield TU </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TPS" -->
            <field>
              <name>TPS</name>
              <description> bitfield TPS </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TI" -->
            <field>
              <name>TI</name>
              <description> bitfield TI </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "OMR" -->
        <register>
          <name>OMR</name>
          <description> register OMR </description>
          <addressOffset>0x1018</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0731E0DE</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DT" -->
            <field>
              <name>DT</name>
              <description> bitfield DT </description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RSF" -->
            <field>
              <name>RSF</name>
              <description> bitfield RSF </description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DFF" -->
            <field>
              <name>DFF</name>
              <description> bitfield DFF </description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TSF" -->
            <field>
              <name>TSF</name>
              <description> bitfield TSF </description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FTF" -->
            <field>
              <name>FTF</name>
              <description> bitfield FTF </description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TTC" -->
            <field>
              <name>TTC</name>
              <description> bitfield TTC </description>
              <lsb>14</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ST" -->
            <field>
              <name>ST</name>
              <description> bitfield ST </description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FEF" -->
            <field>
              <name>FEF</name>
              <description> bitfield FEF </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FUF" -->
            <field>
              <name>FUF</name>
              <description> bitfield FUF </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RTC" -->
            <field>
              <name>RTC</name>
              <description> bitfield RTC </description>
              <lsb>3</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "OSF" -->
            <field>
              <name>OSF</name>
              <description> bitfield OSF </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SR" -->
            <field>
              <name>SR</name>
              <description> bitfield SR </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "IER" -->
        <register>
          <name>IER</name>
          <description> register IER </description>
          <addressOffset>0x101C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0001E7FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "NIE" -->
            <field>
              <name>NIE</name>
              <description> bitfield NIE </description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "AIE" -->
            <field>
              <name>AIE</name>
              <description> bitfield AIE </description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ERE" -->
            <field>
              <name>ERE</name>
              <description> bitfield ERE </description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FBE" -->
            <field>
              <name>FBE</name>
              <description> bitfield FBE </description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ETE" -->
            <field>
              <name>ETE</name>
              <description> bitfield ETE </description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RWE" -->
            <field>
              <name>RWE</name>
              <description> bitfield RWE </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RSE" -->
            <field>
              <name>RSE</name>
              <description> bitfield RSE </description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RUE" -->
            <field>
              <name>RUE</name>
              <description> bitfield RUE </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RIE" -->
            <field>
              <name>RIE</name>
              <description> bitfield RIE </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "UNE" -->
            <field>
              <name>UNE</name>
              <description> bitfield UNE </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "OVE" -->
            <field>
              <name>OVE</name>
              <description> bitfield OVE </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TJE" -->
            <field>
              <name>TJE</name>
              <description> bitfield TJE </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TUE" -->
            <field>
              <name>TUE</name>
              <description> bitfield TUE </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TSE" -->
            <field>
              <name>TSE</name>
              <description> bitfield TSE </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TIE" -->
            <field>
              <name>TIE</name>
              <description> bitfield TIE </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "MFBOCR" -->
        <register>
          <name>MFBOCR</name>
          <description> register MFBOCR </description>
          <addressOffset>0x1020</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x1FFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ONMFF" -->
            <field>
              <name>ONMFF</name>
              <description> bitfield ONMFF </description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NMFF" -->
            <field>
              <name>NMFF</name>
              <description> bitfield NMFF </description>
              <lsb>17</lsb>
              <msb>27</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "ONMFH" -->
            <field>
              <name>ONMFH</name>
              <description> bitfield ONMFH </description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "NMFH" -->
            <field>
              <name>NMFH</name>
              <description> bitfield NMFH </description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "RIWTR" -->
        <register>
          <name>RIWTR</name>
          <description> register RIWTR </description>
          <addressOffset>0x1024</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RIWT" -->
            <field>
              <name>RIWT</name>
              <description> bitfield RIWT </description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
