sol4ik/audio-steganography/try/fm4/s6e2cc_i2s_sk-fm4-176l-s6se2cc-v10/svd/S6E2CC.xml
      </registers>
    </peripheral>
    <!-- PERIPHERAL "I2S0" -->
    <peripheral>
      <name>I2S0</name>
      <description> peripheral I2S0 </description>
      <groupName>I2S0</groupName>
      <baseAddress>0x4006C000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xC</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x14</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x18</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1C</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x20</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x24</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x28</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2C</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- INTERRUPT "PRGCRC_I2S" -->
      <interrupt>
        <name>PRGCRC_I2S</name>
        <value>117</value>
      </interrupt>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "RXFDAT" -->
        <register>
          <name>RXFDAT</name>
          <description> register RXFDAT </description>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RXDATA" -->
            <field>
              <name>RXDATA</name>
              <description> bitfield RXDATA </description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TXFDAT" -->
        <register>
          <name>TXFDAT</name>
          <description> register TXFDAT </description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TXDATA" -->
            <field>
              <name>TXDATA</name>
              <description> bitfield TXDATA </description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "CNTREG" -->
        <register>
          <name>CNTREG</name>
          <description> register CNTREG </description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFF7FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "OVHD" -->
            <field>
              <name>OVHD</name>
              <description> bitfield OVHD </description>
              <lsb>16</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MSKB" -->
            <field>
              <name>MSKB</name>
              <description> bitfield MSKB </description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MSMD" -->
            <field>
              <name>MSMD</name>
              <description> bitfield MSMD </description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SBFN" -->
            <field>
              <name>SBFN</name>
              <description> bitfield SBFN </description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RHLL" -->
            <field>
              <name>RHLL</name>
              <description> bitfield RHLL </description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ECKM" -->
            <field>
              <name>ECKM</name>
              <description> bitfield ECKM </description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BEXT" -->
            <field>
              <name>BEXT</name>
              <description> bitfield BEXT </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FRUN" -->
            <field>
              <name>FRUN</name>
              <description> bitfield FRUN </description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MLSB" -->
            <field>
              <name>MLSB</name>
              <description> bitfield MLSB </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TXDIS" -->
            <field>
              <name>TXDIS</name>
              <description> bitfield TXDIS </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RXDIS" -->
            <field>
              <name>RXDIS</name>
              <description> bitfield RXDIS </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SMPL" -->
            <field>
              <name>SMPL</name>
              <description> bitfield SMPL </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CPOL" -->
            <field>
              <name>CPOL</name>
              <description> bitfield CPOL </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FSPH" -->
            <field>
              <name>FSPH</name>
              <description> bitfield FSPH </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FSLN" -->
            <field>
              <name>FSLN</name>
              <description> bitfield FSLN </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FSPL" -->
            <field>
              <name>FSPL</name>
              <description> bitfield FSPL </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "MCR0REG" -->
        <register>
          <name>MCR0REG</name>
          <description> register MCR0REG </description>
          <addressOffset>0xC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7FFF7FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "S1CHN" -->
            <field>
              <name>S1CHN</name>
              <description> bitfield S1CHN </description>
              <lsb>26</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S1CHL" -->
            <field>
              <name>S1CHL</name>
              <description> bitfield S1CHL </description>
              <lsb>21</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S1WDL" -->
            <field>
              <name>S1WDL</name>
              <description> bitfield S1WDL </description>
              <lsb>16</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S0CHN" -->
            <field>
              <name>S0CHN</name>
              <description> bitfield S0CHN </description>
              <lsb>10</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S0CHL" -->
            <field>
              <name>S0CHL</name>
              <description> bitfield S0CHL </description>
              <lsb>5</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S0WDL" -->
            <field>
              <name>S0WDL</name>
              <description> bitfield S0WDL </description>
              <lsb>0</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
