sol4ik/audio-steganography/try/fm4/s6e2cc_i2s_sk-fm4-176l-s6se2cc-v10/svd/S6E2CC.xml
        <!-- REGISTER "MCR1REG" -->
        <register>
          <name>MCR1REG</name>
          <description> register MCR1REG </description>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "S0CH31" -->
            <field>
              <name>S0CH31</name>
              <description> bitfield S0CH31 </description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S0CH30" -->
            <field>
              <name>S0CH30</name>
              <description> bitfield S0CH30 </description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S0CH29" -->
            <field>
              <name>S0CH29</name>
              <description> bitfield S0CH29 </description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S0CH28" -->
            <field>
              <name>S0CH28</name>
              <description> bitfield S0CH28 </description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S0CH27" -->
            <field>
              <name>S0CH27</name>
              <description> bitfield S0CH27 </description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S0CH26" -->
            <field>
              <name>S0CH26</name>
              <description> bitfield S0CH26 </description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S0CH25" -->
            <field>
              <name>S0CH25</name>
              <description> bitfield S0CH25 </description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S0CH24" -->
            <field>
              <name>S0CH24</name>
              <description> bitfield S0CH24 </description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S0CH23" -->
            <field>
              <name>S0CH23</name>
              <description> bitfield S0CH23 </description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S0CH22" -->
            <field>
              <name>S0CH22</name>
              <description> bitfield S0CH22 </description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S0CH21" -->
            <field>
              <name>S0CH21</name>
              <description> bitfield S0CH21 </description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S0CH20" -->
            <field>
              <name>S0CH20</name>
              <description> bitfield S0CH20 </description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S0CH19" -->
            <field>
              <name>S0CH19</name>
              <description> bitfield S0CH19 </description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S0CH18" -->
            <field>
              <name>S0CH18</name>
              <description> bitfield S0CH18 </description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S0CH17" -->
            <field>
              <name>S0CH17</name>
              <description> bitfield S0CH17 </description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S0CH16" -->
            <field>
              <name>S0CH16</name>
              <description> bitfield S0CH16 </description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S0CH15" -->
            <field>
              <name>S0CH15</name>
              <description> bitfield S0CH15 </description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S0CH14" -->
            <field>
              <name>S0CH14</name>
              <description> bitfield S0CH14 </description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S0CH13" -->
            <field>
              <name>S0CH13</name>
              <description> bitfield S0CH13 </description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S0CH12" -->
            <field>
              <name>S0CH12</name>
              <description> bitfield S0CH12 </description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S0CH11" -->
            <field>
              <name>S0CH11</name>
              <description> bitfield S0CH11 </description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S0CH10" -->
            <field>
              <name>S0CH10</name>
              <description> bitfield S0CH10 </description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S0CH09" -->
            <field>
              <name>S0CH09</name>
              <description> bitfield S0CH09 </description>
              <lsb>09</lsb>
              <msb>09</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S0CH08" -->
            <field>
              <name>S0CH08</name>
              <description> bitfield S0CH08 </description>
              <lsb>08</lsb>
              <msb>08</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S0CH07" -->
            <field>
              <name>S0CH07</name>
              <description> bitfield S0CH07 </description>
              <lsb>07</lsb>
              <msb>07</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S0CH06" -->
            <field>
              <name>S0CH06</name>
              <description> bitfield S0CH06 </description>
              <lsb>06</lsb>
              <msb>06</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S0CH05" -->
            <field>
              <name>S0CH05</name>
              <description> bitfield S0CH05 </description>
              <lsb>05</lsb>
              <msb>05</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S0CH04" -->
            <field>
              <name>S0CH04</name>
              <description> bitfield S0CH04 </description>
              <lsb>04</lsb>
              <msb>04</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S0CH03" -->
            <field>
              <name>S0CH03</name>
              <description> bitfield S0CH03 </description>
              <lsb>03</lsb>
              <msb>03</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S0CH02" -->
            <field>
              <name>S0CH02</name>
              <description> bitfield S0CH02 </description>
              <lsb>02</lsb>
              <msb>02</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S0CH01" -->
            <field>
              <name>S0CH01</name>
              <description> bitfield S0CH01 </description>
              <lsb>01</lsb>
              <msb>01</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S0CH00" -->
            <field>
              <name>S0CH00</name>
              <description> bitfield S0CH00 </description>
              <lsb>00</lsb>
              <msb>00</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "MCR2REG" -->
        <register>
          <name>MCR2REG</name>
          <description> register MCR2REG </description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "S1CH31" -->
            <field>
              <name>S1CH31</name>
              <description> bitfield S1CH31 </description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S1CH30" -->
            <field>
              <name>S1CH30</name>
              <description> bitfield S1CH30 </description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S1CH29" -->
            <field>
              <name>S1CH29</name>
              <description> bitfield S1CH29 </description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S1CH28" -->
            <field>
              <name>S1CH28</name>
              <description> bitfield S1CH28 </description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S1CH27" -->
            <field>
              <name>S1CH27</name>
              <description> bitfield S1CH27 </description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S1CH26" -->
            <field>
              <name>S1CH26</name>
              <description> bitfield S1CH26 </description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S1CH25" -->
            <field>
              <name>S1CH25</name>
              <description> bitfield S1CH25 </description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S1CH24" -->
            <field>
              <name>S1CH24</name>
              <description> bitfield S1CH24 </description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S1CH23" -->
            <field>
              <name>S1CH23</name>
              <description> bitfield S1CH23 </description>
              <lsb>23</lsb>
              <msb>23</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S1CH22" -->
            <field>
              <name>S1CH22</name>
              <description> bitfield S1CH22 </description>
              <lsb>22</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S1CH21" -->
            <field>
              <name>S1CH21</name>
              <description> bitfield S1CH21 </description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S1CH20" -->
            <field>
              <name>S1CH20</name>
              <description> bitfield S1CH20 </description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S1CH19" -->
            <field>
              <name>S1CH19</name>
              <description> bitfield S1CH19 </description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S1CH18" -->
            <field>
              <name>S1CH18</name>
              <description> bitfield S1CH18 </description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S1CH17" -->
            <field>
              <name>S1CH17</name>
              <description> bitfield S1CH17 </description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S1CH16" -->
            <field>
              <name>S1CH16</name>
              <description> bitfield S1CH16 </description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S1CH15" -->
            <field>
              <name>S1CH15</name>
              <description> bitfield S1CH15 </description>
              <lsb>15</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S1CH14" -->
            <field>
              <name>S1CH14</name>
              <description> bitfield S1CH14 </description>
              <lsb>14</lsb>
              <msb>14</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S1CH13" -->
            <field>
              <name>S1CH13</name>
              <description> bitfield S1CH13 </description>
              <lsb>13</lsb>
              <msb>13</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S1CH12" -->
            <field>
              <name>S1CH12</name>
              <description> bitfield S1CH12 </description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S1CH11" -->
            <field>
              <name>S1CH11</name>
              <description> bitfield S1CH11 </description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S1CH10" -->
            <field>
              <name>S1CH10</name>
              <description> bitfield S1CH10 </description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S1CH09" -->
            <field>
              <name>S1CH09</name>
              <description> bitfield S1CH09 </description>
              <lsb>09</lsb>
              <msb>09</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S1CH08" -->
            <field>
              <name>S1CH08</name>
              <description> bitfield S1CH08 </description>
              <lsb>08</lsb>
              <msb>08</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S1CH07" -->
            <field>
              <name>S1CH07</name>
              <description> bitfield S1CH07 </description>
              <lsb>07</lsb>
              <msb>07</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S1CH06" -->
            <field>
              <name>S1CH06</name>
              <description> bitfield S1CH06 </description>
              <lsb>06</lsb>
              <msb>06</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S1CH05" -->
            <field>
              <name>S1CH05</name>
              <description> bitfield S1CH05 </description>
              <lsb>05</lsb>
              <msb>05</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S1CH04" -->
            <field>
              <name>S1CH04</name>
              <description> bitfield S1CH04 </description>
              <lsb>04</lsb>
              <msb>04</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S1CH03" -->
            <field>
              <name>S1CH03</name>
              <description> bitfield S1CH03 </description>
              <lsb>03</lsb>
              <msb>03</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S1CH02" -->
            <field>
              <name>S1CH02</name>
              <description> bitfield S1CH02 </description>
              <lsb>02</lsb>
              <msb>02</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S1CH01" -->
            <field>
              <name>S1CH01</name>
              <description> bitfield S1CH01 </description>
              <lsb>01</lsb>
              <msb>01</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "S1CH00" -->
            <field>
              <name>S1CH00</name>
              <description> bitfield S1CH00 </description>
              <lsb>00</lsb>
              <msb>00</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "OPRREG" -->
        <register>
          <name>OPRREG</name>
          <description> register OPRREG </description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x01010001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RXENB" -->
            <field>
              <name>RXENB</name>
              <description> bitfield RXENB </description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TXENB" -->
            <field>
              <name>TXENB</name>
              <description> bitfield TXENB </description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "START" -->
            <field>
              <name>START</name>
              <description> bitfield START </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
