sol4ik/audio-steganography/try/fm4/s6e2cc_i2s_sk-fm4-176l-s6se2cc-v10/svd/S6E2CC.xml
        <!-- REGISTER "SRST" -->
        <register>
          <name>SRST</name>
          <description> register SRST </description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SRST" -->
            <field>
              <name>SRST</name>
              <description> bitfield SRST </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "INTCNT" -->
        <register>
          <name>INTCNT</name>
          <description> register INTCNT </description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x7F3F0000</resetValue>
          <resetMask>0x7F3F0F3F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TXUD1M" -->
            <field>
              <name>TXUD1M</name>
              <description> bitfield TXUD1M </description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TBERM" -->
            <field>
              <name>TBERM</name>
              <description> bitfield TBERM </description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FERRM" -->
            <field>
              <name>FERRM</name>
              <description> bitfield FERRM </description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TXUD0M" -->
            <field>
              <name>TXUD0M</name>
              <description> bitfield TXUD0M </description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TXOVM" -->
            <field>
              <name>TXOVM</name>
              <description> bitfield TXOVM </description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TXFDM" -->
            <field>
              <name>TXFDM</name>
              <description> bitfield TXFDM </description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TXFIM" -->
            <field>
              <name>TXFIM</name>
              <description> bitfield TXFIM </description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RBERM" -->
            <field>
              <name>RBERM</name>
              <description> bitfield RBERM </description>
              <lsb>21</lsb>
              <msb>21</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RXUDM" -->
            <field>
              <name>RXUDM</name>
              <description> bitfield RXUDM </description>
              <lsb>20</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RXOVM" -->
            <field>
              <name>RXOVM</name>
              <description> bitfield RXOVM </description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EOPM" -->
            <field>
              <name>EOPM</name>
              <description> bitfield EOPM </description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RXFDM" -->
            <field>
              <name>RXFDM</name>
              <description> bitfield RXFDM </description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RXFIM" -->
            <field>
              <name>RXFIM</name>
              <description> bitfield RXFIM </description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TFTH" -->
            <field>
              <name>TFTH</name>
              <description> bitfield TFTH </description>
              <lsb>8</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RPTMR" -->
            <field>
              <name>RPTMR</name>
              <description> bitfield RPTMR </description>
              <lsb>4</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FTH" -->
            <field>
              <name>FTH</name>
              <description> bitfield FTH </description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "STATUS" -->
        <register>
          <name>STATUS</name>
          <description> register STATUS </description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFF0FFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TBERR" -->
            <field>
              <name>TBERR</name>
              <description> bitfield TBERR </description>
              <lsb>31</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RBERR" -->
            <field>
              <name>RBERR</name>
              <description> bitfield RBERR </description>
              <lsb>30</lsb>
              <msb>30</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "FERR" -->
            <field>
              <name>FERR</name>
              <description> bitfield FERR </description>
              <lsb>29</lsb>
              <msb>29</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TXUDR1" -->
            <field>
              <name>TXUDR1</name>
              <description> bitfield TXUDR1 </description>
              <lsb>28</lsb>
              <msb>28</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TXUDR0" -->
            <field>
              <name>TXUDR0</name>
              <description> bitfield TXUDR0 </description>
              <lsb>27</lsb>
              <msb>27</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TXOVR" -->
            <field>
              <name>TXOVR</name>
              <description> bitfield TXOVR </description>
              <lsb>26</lsb>
              <msb>26</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RXUDR" -->
            <field>
              <name>RXUDR</name>
              <description> bitfield RXUDR </description>
              <lsb>25</lsb>
              <msb>25</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RXOVR" -->
            <field>
              <name>RXOVR</name>
              <description> bitfield RXOVR </description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "EOPI" -->
            <field>
              <name>EOPI</name>
              <description> bitfield EOPI </description>
              <lsb>19</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "BSY" -->
            <field>
              <name>BSY</name>
              <description> bitfield BSY </description>
              <lsb>18</lsb>
              <msb>18</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TXFI" -->
            <field>
              <name>TXFI</name>
              <description> bitfield TXFI </description>
              <lsb>17</lsb>
              <msb>17</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RXFI" -->
            <field>
              <name>RXFI</name>
              <description> bitfield RXFI </description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TXNUM" -->
            <field>
              <name>TXNUM</name>
              <description> bitfield TXNUM </description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RXNUM" -->
            <field>
              <name>RXNUM</name>
              <description> bitfield RXNUM </description>
              <lsb>0</lsb>
              <msb>7</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "DMAACT" -->
        <register>
          <name>DMAACT</name>
          <description> register DMAACT </description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x01010101</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TL1E0" -->
            <field>
              <name>TL1E0</name>
              <description> bitfield TL1E0 </description>
              <lsb>24</lsb>
              <msb>24</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TDMACT" -->
            <field>
              <name>TDMACT</name>
              <description> bitfield TDMACT </description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RL1E0" -->
            <field>
              <name>RL1E0</name>
              <description> bitfield RL1E0 </description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RDMACT" -->
            <field>
              <name>RDMACT</name>
              <description> bitfield RDMACT </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "TSTREG" -->
        <register>
          <name>TSTREG</name>
          <description> register TSTREG </description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000001</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "LBMD" -->
            <field>
              <name>LBMD</name>
              <description> bitfield LBMD </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
