sol4ik/audio-steganography/try/fm4/s6e2cc_i2s_sk-fm4-176l-s6se2cc-v10/svd/S6E2CC.xml
        <!-- REGISTER "PRGCRC_RD" -->
        <register>
          <name>PRGCRC_RD</name>
          <description> register PRGCRC_RD </description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
        </register>
      </registers>
    </peripheral>
    <!-- PERIPHERAL "HS_QSPI" -->
    <peripheral>
      <name>HS_QSPI</name>
      <description> peripheral HS_QSPI </description>
      <groupName>HS_QSPI</groupName>
      <baseAddress>0xD0000000</baseAddress>
      <!-- ADDRESS BLOCK -->
      <addressBlock>
        <offset>0x0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x8</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xC</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x10</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x14</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x18</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x1C</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x20</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x24</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x28</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x2C</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x30</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x34</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x35</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x38</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x39</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x3A</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x3B</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x3C</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x3E</offset>
        <size>0x2</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x40</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x4C</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x50</offset>
        <size>0x64</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x90</offset>
        <size>0x64</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xD0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xD4</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xD8</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xDC</offset>
        <size>0x32</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0xFC</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x400</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <addressBlock>
        <offset>0x404</offset>
        <size>0x1</size>
        <usage>registers</usage>
      </addressBlock>
      <!-- INTERRUPT "HS_QSPI" -->
      <interrupt>
        <name>HS_QSPI</name>
        <value>115</value>
      </interrupt>
      <!-- REGISTERS -->
      <registers>
        <!-- REGISTER "HSSPIn_MCTRL" -->
        <register>
          <name>HSSPIn_MCTRL</name>
          <description> register HSSPIn_MCTRL </description>
          <addressOffset>0x00</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000033</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SYNCON" -->
            <field>
              <name>SYNCON</name>
              <description> bitfield SYNCON </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MES" -->
            <field>
              <name>MES</name>
              <description> bitfield MES </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "CSEN" -->
            <field>
              <name>CSEN</name>
              <description> bitfield CSEN </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MEN" -->
            <field>
              <name>MEN</name>
              <description> bitfield MEN </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "HSSPIn_PCC0" -->
        <register>
          <name>HSSPIn_PCC0</name>
          <description> register HSSPIn_PCC0 </description>
          <addressOffset>0x04</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x007FFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RDDSEL" -->
            <field>
              <name>RDDSEL</name>
              <description> bitfield RDDSEL </description>
              <lsb>21</lsb>
              <msb>22</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "WRDSEL" -->
            <field>
              <name>WRDSEL</name>
              <description> bitfield WRDSEL </description>
              <lsb>17</lsb>
              <msb>20</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SAFESYNC" -->
            <field>
              <name>SAFESYNC</name>
              <description> bitfield SAFESYNC </description>
              <lsb>16</lsb>
              <msb>16</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CDRS" -->
            <field>
              <name>CDRS</name>
              <description> bitfield CDRS </description>
              <lsb>9</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SENDIAN" -->
            <field>
              <name>SENDIAN</name>
              <description> bitfield SENDIAN </description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SDIR" -->
            <field>
              <name>SDIR</name>
              <description> bitfield SDIR </description>
              <lsb>7</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SS2CD" -->
            <field>
              <name>SS2CD</name>
              <description> bitfield SS2CD </description>
              <lsb>5</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SSPOL" -->
            <field>
              <name>SSPOL</name>
              <description> bitfield SSPOL </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RTM" -->
            <field>
              <name>RTM</name>
              <description> bitfield RTM </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "ACES" -->
            <field>
              <name>ACES</name>
              <description> bitfield ACES </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CPOL" -->
            <field>
              <name>CPOL</name>
              <description> bitfield CPOL </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CPHA" -->
            <field>
              <name>CPHA</name>
              <description> bitfield CPHA </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "HSSPIn_PCC1" -->
        <register derivedFrom="HSSPIn_PCC0">
          <name>HSSPIn_PCC1</name>
          <description> register HSSPIn_PCC1 </description>
          <addressOffset>0x08</addressOffset>
        </register>
        <!-- REGISTER "HSSPIn_PCC2" -->
        <register derivedFrom="HSSPIn_PCC0">
          <name>HSSPIn_PCC2</name>
          <description> register HSSPIn_PCC2 </description>
          <addressOffset>0x0C</addressOffset>
        </register>
