sol4ik/audio-steganography/try/fm4/s6e2cc_i2s_sk-fm4-176l-s6se2cc-v10/svd/S6E2CC.xml
        <!-- REGISTER "HSSPIn_PCC3" -->
        <register derivedFrom="HSSPIn_PCC0">
          <name>HSSPIn_PCC3</name>
          <description> register HSSPIn_PCC3 </description>
          <addressOffset>0x10</addressOffset>
        </register>
        <!-- REGISTER "HSSPIn_TXF" -->
        <register>
          <name>HSSPIn_TXF</name>
          <description> register HSSPIn_TXF </description>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000007F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TSSRS" -->
            <field>
              <name>TSSRS</name>
              <description> bitfield TSSRS </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TFMTS" -->
            <field>
              <name>TFMTS</name>
              <description> bitfield TFMTS </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TFLETS" -->
            <field>
              <name>TFLETS</name>
              <description> bitfield TFLETS </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TFUS" -->
            <field>
              <name>TFUS</name>
              <description> bitfield TFUS </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TFOS" -->
            <field>
              <name>TFOS</name>
              <description> bitfield TFOS </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TFES" -->
            <field>
              <name>TFES</name>
              <description> bitfield TFES </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TFFS" -->
            <field>
              <name>TFFS</name>
              <description> bitfield TFFS </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "HSSPIn_TXE" -->
        <register>
          <name>HSSPIn_TXE</name>
          <description> register HSSPIn_TXE </description>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000007F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TSSRE" -->
            <field>
              <name>TSSRE</name>
              <description> bitfield TSSRE </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TFMTE" -->
            <field>
              <name>TFMTE</name>
              <description> bitfield TFMTE </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TFLETE" -->
            <field>
              <name>TFLETE</name>
              <description> bitfield TFLETE </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TFUE" -->
            <field>
              <name>TFUE</name>
              <description> bitfield TFUE </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TFOE" -->
            <field>
              <name>TFOE</name>
              <description> bitfield TFOE </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TFEE" -->
            <field>
              <name>TFEE</name>
              <description> bitfield TFEE </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TFFE" -->
            <field>
              <name>TFFE</name>
              <description> bitfield TFFE </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "HSSPIn_TXC" -->
        <register>
          <name>HSSPIn_TXC</name>
          <description> register HSSPIn_TXC </description>
          <addressOffset>0x1C</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000007F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TSSRC" -->
            <field>
              <name>TSSRC</name>
              <description> bitfield TSSRC </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "TFMTC" -->
            <field>
              <name>TFMTC</name>
              <description> bitfield TFMTC </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "TFLETC" -->
            <field>
              <name>TFLETC</name>
              <description> bitfield TFLETC </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "TFUC" -->
            <field>
              <name>TFUC</name>
              <description> bitfield TFUC </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "TFOC" -->
            <field>
              <name>TFOC</name>
              <description> bitfield TFOC </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "TFEC" -->
            <field>
              <name>TFEC</name>
              <description> bitfield TFEC </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "TFFC" -->
            <field>
              <name>TFFC</name>
              <description> bitfield TFFC </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
