sol4ik/audio-steganography/try/fm4/s6e2cc_i2s_sk-fm4-176l-s6se2cc-v10/svd/S6E2CC.xml
        <!-- REGISTER "HSSPIn_RXF" -->
        <register>
          <name>HSSPIn_RXF</name>
          <description> register HSSPIn_RXF </description>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000007F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RSSRS" -->
            <field>
              <name>RSSRS</name>
              <description> bitfield RSSRS </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RFMTS" -->
            <field>
              <name>RFMTS</name>
              <description> bitfield RFMTS </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RFLETS" -->
            <field>
              <name>RFLETS</name>
              <description> bitfield RFLETS </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RFUS" -->
            <field>
              <name>RFUS</name>
              <description> bitfield RFUS </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RFOS" -->
            <field>
              <name>RFOS</name>
              <description> bitfield RFOS </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RFES" -->
            <field>
              <name>RFES</name>
              <description> bitfield RFES </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RFFS" -->
            <field>
              <name>RFFS</name>
              <description> bitfield RFFS </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "HSSPIn_RXE" -->
        <register>
          <name>HSSPIn_RXE</name>
          <description> register HSSPIn_RXE </description>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000007F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RSSRE" -->
            <field>
              <name>RSSRE</name>
              <description> bitfield RSSRE </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RFMTE" -->
            <field>
              <name>RFMTE</name>
              <description> bitfield RFMTE </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RFLETE" -->
            <field>
              <name>RFLETE</name>
              <description> bitfield RFLETE </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RFUE" -->
            <field>
              <name>RFUE</name>
              <description> bitfield RFUE </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RFOE" -->
            <field>
              <name>RFOE</name>
              <description> bitfield RFOE </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RFEE" -->
            <field>
              <name>RFEE</name>
              <description> bitfield RFEE </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RFFE" -->
            <field>
              <name>RFFE</name>
              <description> bitfield RFFE </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "HSSPIn_RXC" -->
        <register>
          <name>HSSPIn_RXC</name>
          <description> register HSSPIn_RXC </description>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000007F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RSSRC" -->
            <field>
              <name>RSSRC</name>
              <description> bitfield RSSRC </description>
              <lsb>6</lsb>
              <msb>6</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "RFMTC" -->
            <field>
              <name>RFMTC</name>
              <description> bitfield RFMTC </description>
              <lsb>5</lsb>
              <msb>5</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "RFLETC" -->
            <field>
              <name>RFLETC</name>
              <description> bitfield RFLETC </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "RFUC" -->
            <field>
              <name>RFUC</name>
              <description> bitfield RFUC </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "RFOC" -->
            <field>
              <name>RFOC</name>
              <description> bitfield RFOC </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "RFEC" -->
            <field>
              <name>RFEC</name>
              <description> bitfield RFEC </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "RFFC" -->
            <field>
              <name>RFFC</name>
              <description> bitfield RFFC </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "HSSPIn_FAULTF" -->
        <register>
          <name>HSSPIn_FAULTF</name>
          <description> register HSSPIn_FAULTF </description>
          <addressOffset>0x2C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000001F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DRCBSFS" -->
            <field>
              <name>DRCBSFS</name>
              <description> bitfield DRCBSFS </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "DWCBSFS" -->
            <field>
              <name>DWCBSFS</name>
              <description> bitfield DWCBSFS </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "PVFS" -->
            <field>
              <name>PVFS</name>
              <description> bitfield PVFS </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "WAFS" -->
            <field>
              <name>WAFS</name>
              <description> bitfield WAFS </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "UMAFS" -->
            <field>
              <name>UMAFS</name>
              <description> bitfield UMAFS </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
