sol4ik/audio-steganography/try/fm4/s6e2cc_i2s_sk-fm4-176l-s6se2cc-v10/svd/S6E2CC.xml
        <!-- REGISTER "HSSPIn_FAULTC" -->
        <register>
          <name>HSSPIn_FAULTC</name>
          <description> register HSSPIn_FAULTC </description>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000001F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "DRCBSFC" -->
            <field>
              <name>DRCBSFC</name>
              <description> bitfield DRCBSFC </description>
              <lsb>4</lsb>
              <msb>4</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "DWCBSFC" -->
            <field>
              <name>DWCBSFC</name>
              <description> bitfield DWCBSFC </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "PVFC" -->
            <field>
              <name>PVFC</name>
              <description> bitfield PVFC </description>
              <lsb>2</lsb>
              <msb>2</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "WAFC" -->
            <field>
              <name>WAFC</name>
              <description> bitfield WAFC </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "UMAFC" -->
            <field>
              <name>UMAFC</name>
              <description> bitfield UMAFC </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "HSSPIn_DMCFG" -->
        <register>
          <name>HSSPIn_DMCFG</name>
          <description> register HSSPIn_DMCFG </description>
          <addressOffset>0x34</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x01</resetValue>
          <resetMask>0x02</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "SSDC" -->
            <field>
              <name>SSDC</name>
              <description> bitfield SSDC </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "HSSPIn_DMDMAEN" -->
        <register>
          <name>HSSPIn_DMDMAEN</name>
          <description> register HSSPIn_DMDMAEN </description>
          <addressOffset>0x35</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TXDMAEN" -->
            <field>
              <name>TXDMAEN</name>
              <description> bitfield TXDMAEN </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RXDMAEN" -->
            <field>
              <name>RXDMAEN</name>
              <description> bitfield RXDMAEN </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "HSSPIn_DMSTART" -->
        <register>
          <name>HSSPIn_DMSTART</name>
          <description> register HSSPIn_DMSTART </description>
          <addressOffset>0x38</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x01</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "START" -->
            <field>
              <name>START</name>
              <description> bitfield START </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "HSSPIn_DMSTOP" -->
        <register>
          <name>HSSPIn_DMSTOP</name>
          <description> register HSSPIn_DMSTOP </description>
          <addressOffset>0x39</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x01</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "STOP" -->
            <field>
              <name>STOP</name>
              <description> bitfield STOP </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "HSSPIn_DMPSEL" -->
        <register>
          <name>HSSPIn_DMPSEL</name>
          <description> register HSSPIn_DMPSEL </description>
          <addressOffset>0x3A</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "PSEL" -->
            <field>
              <name>PSEL</name>
              <description> bitfield PSEL </description>
              <lsb>0</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "HSSPIn_DMTRP" -->
        <register>
          <name>HSSPIn_DMTRP</name>
          <description> register HSSPIn_DMTRP </description>
          <addressOffset>0x3B</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TRP" -->
            <field>
              <name>TRP</name>
              <description> bitfield TRP </description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "HSSPIn_DMBCC" -->
        <register>
          <name>HSSPIn_DMBCC</name>
          <description> register HSSPIn_DMBCC </description>
          <addressOffset>0x3C</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BCC" -->
            <field>
              <name>BCC</name>
              <description> bitfield BCC </description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
