sol4ik/audio-steganography/try/fm4/s6e2cc_i2s_sk-fm4-176l-s6se2cc-v10/svd/S6E2CC.xml
        <!-- REGISTER "HSSPIn_DMBCS" -->
        <register>
          <name>HSSPIn_DMBCS</name>
          <description> register HSSPIn_DMBCS </description>
          <addressOffset>0x3E</addressOffset>
          <size>16</size>
          <access>read-only</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "BCS" -->
            <field>
              <name>BCS</name>
              <description> bitfield BCS </description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "HSSPIn_DMSTATUS" -->
        <register>
          <name>HSSPIn_DMSTATUS</name>
          <description> register HSSPIn_DMSTATUS </description>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x001F1F03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TXFLEVEL" -->
            <field>
              <name>TXFLEVEL</name>
              <description> bitfield TXFLEVEL </description>
              <lsb>16</lsb>
              <msb>20</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RXFLEVEL" -->
            <field>
              <name>RXFLEVEL</name>
              <description> bitfield RXFLEVEL </description>
              <lsb>8</lsb>
              <msb>12</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "TXACTIVE" -->
            <field>
              <name>TXACTIVE</name>
              <description> bitfield TXACTIVE </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-only</access>
            </field>
            <!-- FIELD "RXACTIVE" -->
            <field>
              <name>RXACTIVE</name>
              <description> bitfield RXACTIVE </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "HSSPIn_FIFOCFG" -->
        <register>
          <name>HSSPIn_FIFOCFG</name>
          <description> register HSSPIn_FIFOCFG </description>
          <addressOffset>0x4C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000077</resetValue>
          <resetMask>0x00001FFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TXFLSH" -->
            <field>
              <name>TXFLSH</name>
              <description> bitfield TXFLSH </description>
              <lsb>12</lsb>
              <msb>12</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "RXFLSH" -->
            <field>
              <name>RXFLSH</name>
              <description> bitfield RXFLSH </description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>write-only</access>
            </field>
            <!-- FIELD "TXCTRL" -->
            <field>
              <name>TXCTRL</name>
              <description> bitfield TXCTRL </description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "FWIDTH" -->
            <field>
              <name>FWIDTH</name>
              <description> bitfield FWIDTH </description>
              <lsb>8</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TXFTH" -->
            <field>
              <name>TXFTH</name>
              <description> bitfield TXFTH </description>
              <lsb>4</lsb>
              <msb>7</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RXFTH" -->
            <field>
              <name>RXFTH</name>
              <description> bitfield RXFTH </description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "HSSPIn_TXFIFO0" -->
        <register>
          <name>HSSPIn_TXFIFO0</name>
          <description> register HSSPIn_TXFIFO0 </description>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TXDATA" -->
            <field>
              <name>TXDATA</name>
              <description> bitfield TXDATA </description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "HSSPIn_TXFIFO1" -->
        <register derivedFrom="HSSPIn_TXFIFO0">
          <name>HSSPIn_TXFIFO1</name>
          <description> register HSSPIn_TXFIFO1 </description>
          <addressOffset>0x54</addressOffset>
        </register>
        <!-- REGISTER "HSSPIn_TXFIFO2" -->
        <register derivedFrom="HSSPIn_TXFIFO0">
          <name>HSSPIn_TXFIFO2</name>
          <description> register HSSPIn_TXFIFO2 </description>
          <addressOffset>0x58</addressOffset>
        </register>
        <!-- REGISTER "HSSPIn_TXFIFO3" -->
        <register derivedFrom="HSSPIn_TXFIFO0">
          <name>HSSPIn_TXFIFO3</name>
          <description> register HSSPIn_TXFIFO3 </description>
          <addressOffset>0x5C</addressOffset>
        </register>
        <!-- REGISTER "HSSPIn_TXFIFO4" -->
        <register derivedFrom="HSSPIn_TXFIFO0">
          <name>HSSPIn_TXFIFO4</name>
          <description> register HSSPIn_TXFIFO4 </description>
          <addressOffset>0x60</addressOffset>
        </register>
        <!-- REGISTER "HSSPIn_TXFIFO5" -->
        <register derivedFrom="HSSPIn_TXFIFO0">
          <name>HSSPIn_TXFIFO5</name>
          <description> register HSSPIn_TXFIFO5 </description>
          <addressOffset>0x64</addressOffset>
        </register>
