sol4ik/audio-steganography/try/fm4/s6e2cc_i2s_sk-fm4-176l-s6se2cc-v10/svd/S6E2CC.xml
        <!-- REGISTER "HSSPIn_TXFIFO6" -->
        <register derivedFrom="HSSPIn_TXFIFO0">
          <name>HSSPIn_TXFIFO6</name>
          <description> register HSSPIn_TXFIFO6 </description>
          <addressOffset>0x68</addressOffset>
        </register>
        <!-- REGISTER "HSSPIn_TXFIFO7" -->
        <register derivedFrom="HSSPIn_TXFIFO0">
          <name>HSSPIn_TXFIFO7</name>
          <description> register HSSPIn_TXFIFO7 </description>
          <addressOffset>0x6C</addressOffset>
        </register>
        <!-- REGISTER "HSSPIn_TXFIFO8" -->
        <register derivedFrom="HSSPIn_TXFIFO0">
          <name>HSSPIn_TXFIFO8</name>
          <description> register HSSPIn_TXFIFO8 </description>
          <addressOffset>0x70</addressOffset>
        </register>
        <!-- REGISTER "HSSPIn_TXFIFO9" -->
        <register derivedFrom="HSSPIn_TXFIFO0">
          <name>HSSPIn_TXFIFO9</name>
          <description> register HSSPIn_TXFIFO9 </description>
          <addressOffset>0x74</addressOffset>
        </register>
        <!-- REGISTER "HSSPIn_TXFIFO10" -->
        <register derivedFrom="HSSPIn_TXFIFO0">
          <name>HSSPIn_TXFIFO10</name>
          <description> register HSSPIn_TXFIFO10 </description>
          <addressOffset>0x78</addressOffset>
        </register>
        <!-- REGISTER "HSSPIn_TXFIFO11" -->
        <register derivedFrom="HSSPIn_TXFIFO0">
          <name>HSSPIn_TXFIFO11</name>
          <description> register HSSPIn_TXFIFO11 </description>
          <addressOffset>0x7C</addressOffset>
        </register>
        <!-- REGISTER "HSSPIn_TXFIFO12" -->
        <register derivedFrom="HSSPIn_TXFIFO0">
          <name>HSSPIn_TXFIFO12</name>
          <description> register HSSPIn_TXFIFO12 </description>
          <addressOffset>0x80</addressOffset>
        </register>
        <!-- REGISTER "HSSPIn_TXFIFO13" -->
        <register derivedFrom="HSSPIn_TXFIFO0">
          <name>HSSPIn_TXFIFO13</name>
          <description> register HSSPIn_TXFIFO13 </description>
          <addressOffset>0x84</addressOffset>
        </register>
        <!-- REGISTER "HSSPIn_TXFIFO14" -->
        <register derivedFrom="HSSPIn_TXFIFO0">
          <name>HSSPIn_TXFIFO14</name>
          <description> register HSSPIn_TXFIFO14 </description>
          <addressOffset>0x88</addressOffset>
        </register>
        <!-- REGISTER "HSSPIn_TXFIFO15" -->
        <register derivedFrom="HSSPIn_TXFIFO0">
          <name>HSSPIn_TXFIFO15</name>
          <description> register HSSPIn_TXFIFO15 </description>
          <addressOffset>0x8C</addressOffset>
        </register>
        <!-- REGISTER "HSSPIn_RXFIFO0" -->
        <register>
          <name>HSSPIn_RXFIFO0</name>
          <description> register HSSPIn_RXFIFO0 </description>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RXDATA" -->
            <field>
              <name>RXDATA</name>
              <description> bitfield RXDATA </description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "HSSPIn_RXFIFO1" -->
        <register derivedFrom="HSSPIn_RXFIFO0">
          <name>HSSPIn_RXFIFO1</name>
          <description> register HSSPIn_RXFIFO1 </description>
          <addressOffset>0x94</addressOffset>
        </register>
        <!-- REGISTER "HSSPIn_RXFIFO2" -->
        <register derivedFrom="HSSPIn_RXFIFO0">
          <name>HSSPIn_RXFIFO2</name>
          <description> register HSSPIn_RXFIFO2 </description>
          <addressOffset>0x98</addressOffset>
        </register>
        <!-- REGISTER "HSSPIn_RXFIFO3" -->
        <register derivedFrom="HSSPIn_RXFIFO0">
          <name>HSSPIn_RXFIFO3</name>
          <description> register HSSPIn_RXFIFO3 </description>
          <addressOffset>0x9C</addressOffset>
        </register>
        <!-- REGISTER "HSSPIn_RXFIFO4" -->
        <register derivedFrom="HSSPIn_RXFIFO0">
          <name>HSSPIn_RXFIFO4</name>
          <description> register HSSPIn_RXFIFO4 </description>
          <addressOffset>0xA0</addressOffset>
        </register>
        <!-- REGISTER "HSSPIn_RXFIFO5" -->
        <register derivedFrom="HSSPIn_RXFIFO0">
          <name>HSSPIn_RXFIFO5</name>
          <description> register HSSPIn_RXFIFO5 </description>
          <addressOffset>0xA4</addressOffset>
        </register>
        <!-- REGISTER "HSSPIn_RXFIFO6" -->
        <register derivedFrom="HSSPIn_RXFIFO0">
          <name>HSSPIn_RXFIFO6</name>
          <description> register HSSPIn_RXFIFO6 </description>
          <addressOffset>0xA8</addressOffset>
        </register>
        <!-- REGISTER "HSSPIn_RXFIFO7" -->
        <register derivedFrom="HSSPIn_RXFIFO0">
          <name>HSSPIn_RXFIFO7</name>
          <description> register HSSPIn_RXFIFO7 </description>
          <addressOffset>0xAC</addressOffset>
        </register>
        <!-- REGISTER "HSSPIn_RXFIFO8" -->
        <register derivedFrom="HSSPIn_RXFIFO0">
          <name>HSSPIn_RXFIFO8</name>
          <description> register HSSPIn_RXFIFO8 </description>
          <addressOffset>0xB0</addressOffset>
        </register>
        <!-- REGISTER "HSSPIn_RXFIFO9" -->
        <register derivedFrom="HSSPIn_RXFIFO0">
          <name>HSSPIn_RXFIFO9</name>
          <description> register HSSPIn_RXFIFO9 </description>
          <addressOffset>0xB4</addressOffset>
        </register>
        <!-- REGISTER "HSSPIn_RXFIFO10" -->
        <register derivedFrom="HSSPIn_RXFIFO0">
          <name>HSSPIn_RXFIFO10</name>
          <description> register HSSPIn_RXFIFO10 </description>
          <addressOffset>0xB8</addressOffset>
        </register>
