sol4ik/audio-steganography/try/fm4/s6e2cc_i2s_sk-fm4-176l-s6se2cc-v10/svd/S6E2CC.xml
        <!-- REGISTER "HSSPIn_RXFIFO11" -->
        <register derivedFrom="HSSPIn_RXFIFO0">
          <name>HSSPIn_RXFIFO11</name>
          <description> register HSSPIn_RXFIFO11 </description>
          <addressOffset>0xBC</addressOffset>
        </register>
        <!-- REGISTER "HSSPIn_RXFIFO12" -->
        <register derivedFrom="HSSPIn_RXFIFO0">
          <name>HSSPIn_RXFIFO12</name>
          <description> register HSSPIn_RXFIFO12 </description>
          <addressOffset>0xC0</addressOffset>
        </register>
        <!-- REGISTER "HSSPIn_RXFIFO13" -->
        <register derivedFrom="HSSPIn_RXFIFO0">
          <name>HSSPIn_RXFIFO13</name>
          <description> register HSSPIn_RXFIFO13 </description>
          <addressOffset>0xC4</addressOffset>
        </register>
        <!-- REGISTER "HSSPIn_RXFIFO14" -->
        <register derivedFrom="HSSPIn_RXFIFO0">
          <name>HSSPIn_RXFIFO14</name>
          <description> register HSSPIn_RXFIFO14 </description>
          <addressOffset>0xC8</addressOffset>
        </register>
        <!-- REGISTER "HSSPIn_RXFIFO15" -->
        <register derivedFrom="HSSPIn_RXFIFO0">
          <name>HSSPIn_RXFIFO15</name>
          <description> register HSSPIn_RXFIFO15 </description>
          <addressOffset>0xCC</addressOffset>
        </register>
        <!-- REGISTER "HSSPIn_CSCFG" -->
        <register>
          <name>HSSPIn_CSCFG</name>
          <description> register HSSPIn_CSCFG </description>
          <addressOffset>0xD0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000F0F07</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MSEL" -->
            <field>
              <name>MSEL</name>
              <description> bitfield MSEL </description>
              <lsb>16</lsb>
              <msb>19</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SSEL3EN" -->
            <field>
              <name>SSEL3EN</name>
              <description> bitfield SSEL3EN </description>
              <lsb>11</lsb>
              <msb>11</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SSEL2EN" -->
            <field>
              <name>SSEL2EN</name>
              <description> bitfield SSEL2EN </description>
              <lsb>10</lsb>
              <msb>10</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SSEL1EN" -->
            <field>
              <name>SSEL1EN</name>
              <description> bitfield SSEL1EN </description>
              <lsb>9</lsb>
              <msb>9</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SSEL0EN" -->
            <field>
              <name>SSEL0EN</name>
              <description> bitfield SSEL0EN </description>
              <lsb>8</lsb>
              <msb>8</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "MBM" -->
            <field>
              <name>MBM</name>
              <description> bitfield MBM </description>
              <lsb>1</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "SRAM" -->
            <field>
              <name>SRAM</name>
              <description> bitfield SRAM </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "HSSPIn_CSITIME" -->
        <register>
          <name>HSSPIn_CSITIME</name>
          <description> register HSSPIn_CSITIME </description>
          <addressOffset>0xD4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x0000FFFF</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "ITIME" -->
            <field>
              <name>ITIME</name>
              <description> bitfield ITIME </description>
              <lsb>0</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "HSSPIn_CSAEXT" -->
        <register>
          <name>HSSPIn_CSAEXT</name>
          <description> register HSSPIn_CSAEXT </description>
          <addressOffset>0xD8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFE000</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "AEXT" -->
            <field>
              <name>AEXT</name>
              <description> bitfield AEXT </description>
              <lsb>13</lsb>
              <msb>31</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "HSSPIn_RDCSDC0" -->
        <register>
          <name>HSSPIn_RDCSDC0</name>
          <description> register HSSPIn_RDCSDC0 </description>
          <addressOffset>0xDC</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFF0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "RDCSDATA" -->
            <field>
              <name>RDCSDATA</name>
              <description> bitfield RDCSDATA </description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CONT" -->
            <field>
              <name>CONT</name>
              <description> bitfield CONT </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TRP" -->
            <field>
              <name>TRP</name>
              <description> bitfield TRP </description>
              <lsb>1</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DEC" -->
            <field>
              <name>DEC</name>
              <description> bitfield DEC </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "HSSPIn_RDCSDC1" -->
        <register derivedFrom="HSSPIn_RDCSDC0">
          <name>HSSPIn_RDCSDC1</name>
          <description> register HSSPIn_RDCSDC1 </description>
          <addressOffset>0xDE</addressOffset>
        </register>
