sol4ik/audio-steganography/try/fm4/s6e2cc_i2s_sk-fm4-176l-s6se2cc-v10/svd/S6E2CC.xml
        <!-- REGISTER "HSSPIn_RDCSDC2" -->
        <register derivedFrom="HSSPIn_RDCSDC0">
          <name>HSSPIn_RDCSDC2</name>
          <description> register HSSPIn_RDCSDC2 </description>
          <addressOffset>0xE0</addressOffset>
        </register>
        <!-- REGISTER "HSSPIn_RDCSDC3" -->
        <register derivedFrom="HSSPIn_RDCSDC0">
          <name>HSSPIn_RDCSDC3</name>
          <description> register HSSPIn_RDCSDC3 </description>
          <addressOffset>0xE2</addressOffset>
        </register>
        <!-- REGISTER "HSSPIn_RDCSDC4" -->
        <register derivedFrom="HSSPIn_RDCSDC0">
          <name>HSSPIn_RDCSDC4</name>
          <description> register HSSPIn_RDCSDC4 </description>
          <addressOffset>0xE4</addressOffset>
        </register>
        <!-- REGISTER "HSSPIn_RDCSDC5" -->
        <register derivedFrom="HSSPIn_RDCSDC0">
          <name>HSSPIn_RDCSDC5</name>
          <description> register HSSPIn_RDCSDC5 </description>
          <addressOffset>0xE6</addressOffset>
        </register>
        <!-- REGISTER "HSSPIn_RDCSDC6" -->
        <register derivedFrom="HSSPIn_RDCSDC0">
          <name>HSSPIn_RDCSDC6</name>
          <description> register HSSPIn_RDCSDC6 </description>
          <addressOffset>0xE8</addressOffset>
        </register>
        <!-- REGISTER "HSSPIn_RDCSDC7" -->
        <register derivedFrom="HSSPIn_RDCSDC0">
          <name>HSSPIn_RDCSDC7</name>
          <description> register HSSPIn_RDCSDC7 </description>
          <addressOffset>0xEA</addressOffset>
        </register>
        <!-- REGISTER "HSSPIn_WRCSDC0" -->
        <register>
          <name>HSSPIn_WRCSDC0</name>
          <description> register HSSPIn_WRCSDC0 </description>
          <addressOffset>0xEC</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000</resetValue>
          <resetMask>0xFF0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "WRCSDATA" -->
            <field>
              <name>WRCSDATA</name>
              <description> bitfield WRCSDATA </description>
              <lsb>8</lsb>
              <msb>15</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "CONT" -->
            <field>
              <name>CONT</name>
              <description> bitfield CONT </description>
              <lsb>3</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "TRP" -->
            <field>
              <name>TRP</name>
              <description> bitfield TRP </description>
              <lsb>1</lsb>
              <msb>2</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "DEC" -->
            <field>
              <name>DEC</name>
              <description> bitfield DEC </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "HSSPIn_WRCSDC1" -->
        <register derivedFrom="HSSPIn_WRCSDC0">
          <name>HSSPIn_WRCSDC1</name>
          <description> register HSSPIn_WRCSDC1 </description>
          <addressOffset>0xEE</addressOffset>
        </register>
        <!-- REGISTER "HSSPIn_WRCSDC2" -->
        <register derivedFrom="HSSPIn_WRCSDC0">
          <name>HSSPIn_WRCSDC2</name>
          <description> register HSSPIn_WRCSDC2 </description>
          <addressOffset>0xF0</addressOffset>
        </register>
        <!-- REGISTER "HSSPIn_WRCSDC3" -->
        <register derivedFrom="HSSPIn_WRCSDC0">
          <name>HSSPIn_WRCSDC3</name>
          <description> register HSSPIn_WRCSDC3 </description>
          <addressOffset>0xF2</addressOffset>
        </register>
        <!-- REGISTER "HSSPIn_WRCSDC4" -->
        <register derivedFrom="HSSPIn_WRCSDC0">
          <name>HSSPIn_WRCSDC4</name>
          <description> register HSSPIn_WRCSDC4 </description>
          <addressOffset>0xF4</addressOffset>
        </register>
        <!-- REGISTER "HSSPIn_WRCSDC5" -->
        <register derivedFrom="HSSPIn_WRCSDC0">
          <name>HSSPIn_WRCSDC5</name>
          <description> register HSSPIn_WRCSDC5 </description>
          <addressOffset>0xF6</addressOffset>
        </register>
        <!-- REGISTER "HSSPIn_WRCSDC6" -->
        <register derivedFrom="HSSPIn_WRCSDC0">
          <name>HSSPIn_WRCSDC6</name>
          <description> register HSSPIn_WRCSDC6 </description>
          <addressOffset>0xF8</addressOffset>
        </register>
        <!-- REGISTER "HSSPIn_WRCSDC7" -->
        <register derivedFrom="HSSPIn_WRCSDC0">
          <name>HSSPIn_WRCSDC7</name>
          <description> register HSSPIn_WRCSDC7 </description>
          <addressOffset>0xFA</addressOffset>
        </register>
        <!-- REGISTER "HSSPIn_MID" -->
        <register>
          <name>HSSPIn_MID</name>
          <description> register HSSPIn_MID </description>
          <addressOffset>0xFC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000630</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "MID" -->
            <field>
              <name>MID</name>
              <description> bitfield MID </description>
              <lsb>0</lsb>
              <msb>31</msb>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "QDCLKR" -->
        <register>
          <name>QDCLKR</name>
          <description> register QDCLKR </description>
          <addressOffset>0x400</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0F</resetValue>
          <resetMask>0x0F</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "QHDIV" -->
            <field>
              <name>QHDIV</name>
              <description> bitfield QHDIV </description>
              <lsb>0</lsb>
              <msb>3</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <!-- REGISTER "DBCNT" -->
        <register>
          <name>DBCNT</name>
          <description> register DBCNT </description>
          <addressOffset>0x404</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <resetMask>0x03</resetMask>
          <!-- FIELDS -->
          <fields>
            <!-- FIELD "TXDBEN" -->
            <field>
              <name>TXDBEN</name>
              <description> bitfield TXDBEN </description>
              <lsb>1</lsb>
              <msb>1</msb>
              <access>read-write</access>
            </field>
            <!-- FIELD "RXDBEN" -->
            <field>
              <name>RXDBEN</name>
              <description> bitfield RXDBEN </description>
              <lsb>0</lsb>
              <msb>0</msb>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
 </peripherals>
</device>